{"pii": "B9780128205815000158", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"view": "extended", "id": "ab0010", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0135", "view": "all"}, "$$": [{"#name": "anchor", "$": {"id": "page253"}}, {"#name": "__text__", "_": "The use of radio signal for position tracking (positioning) and navigation has a long tradition. Most notably, global navigation satellite systems (GNSS) are now widely applied for civilian applications, ranging all the way from tracking of cargo containers to gaming. However, GNSS suffers from limited coverage in dense urban areas and indoors and also from a limited position accuracy, which rules out most location-based applications that are concerned with the (natural) interaction of humans with their immediate surroundings, the physical environment in which we live, work, and spend our free time."}]}, {"#name": "simple-para", "$": {"id": "sp0140", "view": "all"}, "_": "This chapter highlights the expected benefits of the new wireless technologies proposed for the fifth generation (5G) of mobile communication systems and for the Internet of Things (IoT) for the purpose of improved radiopositioning. It starts with a summary of the most promising future application scenarios for high-accuracy positioning, followed by a discussion on the technical challenges arising from those applications, and on the expected features and limitations of 5G and IoT wireless systems with respect to positioning. These initial considerations are followed by four technical sections, focusing on measurement acquisition and modeling, position estimation, multipath-assisted positioning, and system-level studies. Finally, a range of experimental facilities are described, which have been used to validate the theoretical contributions."}]}]}]}}