{"pii": "S0006291X24007617", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Data acquisition for transcriptomic studies used to be the bottleneck in the transcriptomic analytical pipeline. However, recent developments in transcriptome profiling technologies have increased researchers’ ability to obtain data, resulting in a shift in focus to data analysis. Incorporating machine learning to traditional analytical methods allows the possibility of handling larger volumes of complex data more efficiently. Many bioinformaticians, especially those unfamiliar with ML in the study of human transcriptomics and complex biological systems, face a significant barrier stemming from their limited awareness of the current landscape of ML utilisation in this field. To address this gap, this review endeavours to introduce those individuals to the general types of ML, followed by a comprehensive range of more specific techniques, demonstrated through examples of their incorporation into analytical pipelines for human transcriptome investigations. Important computational aspects such as data pre-processing, task formulation, results (performance of ML models), and validation methods are encompassed. In hope of better practical relevance, there is a strong focus on studies published within the last five years, almost exclusively examining human transcriptomes, with outcomes compared with standard non-ML tools."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Transcriptomic data acquisition bottleneck shifts to analysis."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Machine learning (ML) enhances complex data handling."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "ML integration is not yet standardized in transcriptomics."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Presentation of diverse ML techniques explored in recent studies."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "Review offers comprehensive insights into ML use."}]}]}]}]}]}]}}