{"pii": "S0004370213001276", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0200", "view": "all"}, "$$": [{"#name": "__text__", "_": "Subjective assessments (SAs), such as “elegant” and “gorgeous,” are assigned to items by users, and they are common in the reviews and tags found on many online sites. Analyzing the linked information provided by an SA assigned by a user to an item can improve the recommendation accuracy. This is because this information contains the reason why the user assigned a high or low rating value to the item. However, previous studies have failed to use SAs in an effective manner to improve the recommendation accuracy because few users rate the "}, {"#name": "italic", "_": "same"}, {"#name": "__text__", "_": " items with the "}, {"#name": "italic", "_": "same"}, {"#name": "__text__", "_": " SAs, which leads to the sparsity problem during collaborative filtering. To overcome this problem, we propose a novel method, called "}, {"#name": "italic", "_": "Linked Taxonomies"}, {"#name": "__text__", "_": ", which links a taxonomy of items to a taxonomy of SAs to capture the userʼs interests in detail. First, our method groups the SAs assigned by users to an item into subjective classes (SCs), which are defined using a taxonomy of SAs such as those in WordNet, and they reflect the SAs/SCs assigned to an item based on their classes. Thus, our method can measure the similarity of users based on the SAs/SCs assigned to items and their classes (item classes are defined using a taxonomy of items), which overcomes the sparsity problem. Furthermore, SAs that are ineffective for accurate recommendations are excluded automatically from the taxonomy of SAs using this method. This is highly beneficial for the designers of taxonomies of SAs because it helps to ensure the production of accurate recommendations. We conducted investigations using a movie ratings/tags dataset with a taxonomy of SAs extracted from WordNet and a restaurant ratings/reviews dataset with an expert-created taxonomy of SAs, which demonstrated that our method generated more accurate recommendations than previous methods."}]}]}]}]}}