{"pii": "S0006320723003488", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0045", "view": "all"}, "_": "At the current rates of species extinction on a global level, Red List assessments need to speed up to inform conservation management in a timely manner. This study analyzed the progress made over the last 10 years in red listing aquatic invertebrates in Northern Europe. A survey of 43 freshwater molluscs and 1492 marine crustaceans was carried out for their Red List status in twelve countries during a twenty year interval (2003−2022). Our survey demonstrated that many countries have no national Red List or outdated Red Lists for the freshwater molluscs and only four countries have assessed their existing crustacean species. Alarmingly, we find 13 % fewer occurrence records for the crustaceans and 48 % fewer records for the freshwater molluscs in GBIF in the last 10 years (2013−2022) than in the 10 years previously (2003−2012). A barcode gap analysis reveals more barcodes for the 16S gene (77 %) than for the COI gene (63 %) for the freshwater molluscs and even fewer barcodes for the marine crustaceans (17 % for 16S and 40 % for the COI gene). With the current methods, regular comprehensive red listing of aquatic invertebrates is unrealistic. Here we present a set of scripts that allow automated occurrence and barcode gap analyses on unrepresented species groups. Finally, we discuss ways to increase the number of occurrence records and speed up red listing under existing European frameworks through whole community screening of ecosystems using molecular and other emerging tools."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0050", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Red listing for aquatic invertebrates needs to speed up to inform conservation."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p2005", "view": "all"}, "_": "A North European survey of molluscs and crustaceans was carried for the last 20 years."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p2010", "view": "all"}, "_": "Red lists for the aquatic invertebrates are either lacking or not up to date. · Regular and comprehensive red listing of aquatic invertebrates is unrealistic."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p2015", "view": "all"}, "_": "Citizen science and eDNA community screening can increase the number of occurrences."}]}]}]}]}]}]}}