{"pii": "S0006320723000241", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0040", "view": "all"}, "_": "Unsustainable trade in wildlife is one of the major threats affecting the global biodiversity crisis. An important part of the trade now occurs on digital marketplaces and social media. Automated methods to identify trade posts are needed as resources for conservation are limited. Here, we developed machine vision models based on Deep Neural Networks with the aim to automatically identify images of exotic pet animals for sale. We trained 24 neural-net models on a newly created dataset, spanning a combination of five different architectures, three methods of training and two types of datasets. Model generalisation improved after setting a portion of the training images to represent negative features. Models were evaluated on both within and out-of-distribution data to test wider model applicability. The top performing models achieved an f-score of over 0.95 on within-distribution evaluation and between 0.75 and 0.87 on the two out-of-distribution datasets (i.e., data acquired from a source unrelated to training data), therefore, showcasing the potential application of the model to help identify content related to the sale of threatened species on digital platforms. Notably, feature-visualisation indicated that models performed well in detecting the surrounding context in which an animal was located, therefore helping to automatically detect images of animals in non-natural environments. The proposed methods are an important step towards automatic detection of online wildlife trade using machine vision models and can also be adapted to study more broadly other types of online people-nature interactions. Future studies can use these findings to build robust machine-learning models."}]}]}]}}