{"pii": "S0003347224002215", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "To acquire or retain a higher quality breeding site, individuals may occupy sites outside the breeding season, with those investing more time and energy in this benefiting from improved breeding success. However, despite this benefit, the occupancy patterns of individuals may vary. Occupancy may be influenced by the distance individuals travel from breeding sites during the nonbreeding season; individuals nearer the colony may undertake occupancy earlier and more frequently than conspecifics because of shorter commuting distances from migration and foraging locations. Occupancy may also be energetically costly and affect how individuals are able to allocate their time to other key behaviours such as foraging. However, our understanding of how occupancy behaviour relates to an individual's distribution and ability to balance time and energy allocated to other behaviours is limited. Using data from a population of common guillemots, "}, {"#name": "italic", "_": "Uria aalge"}, {"#name": "__text__", "_": ", a colonially breeding seabird, on the Isle of May, U.K., we investigated how nonbreeding occupancy of breeding sites is related to at-sea distribution, and how much energy and time individuals allocate to behaviours throughout the nonbreeding season We used bird-borne geolocators and time-depth recorders to record distribution and estimate time allocated to behaviours including occupancy, flight and foraging. Individuals that remained nearer to the colony before their first return then returned earlier and had shorter bouts of absence thereafter. Individuals also experienced a trade-off in the time spent in occupancy or foraging. Our data allowed us to estimate the increase in foraging efficiency required to offset the lost foraging time in individuals that occupied breeding sites. Overall, despite its known benefits, individuals varied in their timing and pattern of occupancy. We suggest that achieving consistently high breeding success, via nonbreeding season occupancy, may depend on an individual's distribution and ability to forage efficiently throughout the nonbreeding season."}]}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Individuals demonstrate great variation in breeding site occupancy patterns."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Individuals remaining nearer the colony returned to sites earlier."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "There was no direct energetic cost of occupying breeding sites."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Individuals experienced a trade-off in the time spent in occupancy or foraging."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "More efficient foragers are hypothesized to occupy sites for longer."}]}]}]}]}]}]}}