{"pii": "S000709122100341X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"role": "background", "id": "abssec0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Awake tracheal intubation is commonly performed with flexible bronchoscopes, but the emerging role of alternative airway devices, such as videolaryngoscopes, direct laryngoscopes, and optical stylets, has been recognised."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0020"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "CENTRAL, CINAHL, EMBASE, MEDLINE, and Web of Science were searched for RCTs that compared flexible bronchoscopes, direct laryngoscopes, optical stylets and channelled or unchannelled videolaryngoscopes in adult patients having awake tracheal intubation were included. The co-primary outcomes were first-pass success rate and time to tracheal intubation. Continuous outcomes were extracted as mean and standard deviation, and dichotomous outcomes were converted to overall numbers of incidence. Frequentist network meta-analysis was conducted, and network plots and network league tables were produced."}]}, {"#name": "abstract-sec", "$": {"role": "results", "id": "abssec0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0025"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "Twelve RCTs were included, none of which evaluated direct laryngoscopes. The first-pass success rate was not different between flexible bronchoscopes, optical stylets, and channelled and unchannelled videolaryngoscopes, with the quality of evidence rated as moderate in view of imprecision. Optical stylets, followed by unchannelled videolaryngoscopes and then felxible bronchoscopes resulted in the shortest time to tracheal intubation, with the quality of evidence rated as high. No differences were shown between the airway devices with respect to the incidence of oesophageal intubation, change of airway technique, oxygen desaturation, airway bleeding, or the rate of hoarseness and sore throat."}]}, {"#name": "abstract-sec", "$": {"role": "conclusion", "id": "abssec0025", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0030"}, "_": "Conclusions"}, {"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "Flexible bronchoscopes, optical stylets, and channelled and unchannelled videolaryngoscopes were clinically comparable airway devices in the setting of awake trachela intubation and the time to tracheal intubation was shortest with optical stylets and longest with flexible bronchoscopes."}]}]}]}}