{"pii": "S0006320723000058", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0035", "view": "all"}, "_": "E-commerce has become a booming market for wildlife trafficking, as online platforms are increasingly more accessible and easier to navigate by sellers, while still lacking adequate supervision. Artificial intelligence models, and specifically deep learning, have been emerging as promising tools for the automated analysis and monitoring of digital online content pertaining to wildlife trade. Here, we used and fine-tuned freely available artificial intelligence models (i.e., convolutional neural networks) to understand the potential of these models to identify instances of wildlife trade. We specifically focused on pangolin species, which are among the most trafficked mammals globally and receiving increasing trade attention since the COVID-19 pandemic. Our convolutional neural networks were trained using online images (available from iNaturalist, Flickr and Google) displaying both traded and non-traded pangolin settings. The trained models showed great performances, being able to identify over 90 % of potential instances of pangolin trade in the considered imagery dataset. These instances included the showcasing of pangolins in popular marketplaces (e.g., wet markets and cages), and the displaying of commonly traded pangolin parts and derivates (e.g., scales) online. Nevertheless, not all instances of pangolin trade could be identified by our models (e.g., in images with dark colours and shaded areas), leaving space for further research developments. The methodological developments and results from this exploratory study represent an advancement in the monitoring of online wildlife trade. Complementing our approach with other forms of online data, such as text, would be a way forward to deliver more robust monitoring tools for online trafficking."}]}]}]}}