{"pii": "S0007091223003161", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"role": "background", "id": "abssec0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Neuraxial opioids provide effective analgesia for Caesarean delivery, however, pruritus can be a troubling side-effect. Effective agents to prevent pruritus are needed. Our objective was to perform an updated systematic review and network meta-analysis to provide clinicians with a comparison of relative efficacy of available interventions to reduce the incidence of pruritus, induced by either intrathecal or epidural single-shot morphine, in women undergoing Caesarean delivery."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0020"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "Databases systematically searched (up to January 2022) included PubMed MEDLINE, Web of Science, EBSCO CINAHL, Embase, LILACS, and two Cochrane databases. We included randomised, controlled trials involving adult female patients undergoing Caesarean delivery. We pooled trials comparing interventions used for preventing pruritus after Caesarean delivery and performed a Bayesian model network meta-analysis."}]}, {"#name": "abstract-sec", "$": {"role": "results", "id": "abssec0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0025"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "The final primary network included data from comparisons of 14 distinct interventions (including placebo) used to reduce the incidence of pruritus in 6185 participants. We judged five interventions to be ‘definitely superior’ to placebo: propofol, opioid agonist-antagonists (neuraxial), opioid antagonists, opioid agonist-antagonists (systemic), and serotonin antagonists. For the network evaluating the incidence of severe pruritus (warranting additional therapeutic treatment of pruritus), data were available for 14 interventions (including placebo) in 4489 patients. For this outcome, we judged three interventions to be ‘definitely superior’ to placebo: dopamine antagonists (neuraxial) and systemic and neuraxial opioid agonist-antagonists."}]}, {"#name": "abstract-sec", "$": {"role": "conclusion", "id": "abssec0025", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0030"}, "_": "Conclusion"}, {"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "Our analysis found several interventions to be effective in reducing the incidence of pruritus. Although sub-hypnotic doses of propofol appear to have an antipruritic effect, replication of this finding and further investigation of optimal dosing are warranted."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0030", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0035"}, "_": "Systematic review protocol"}, {"#name": "simple-para", "$": {"id": "abspara0030", "view": "all"}, "_": "PROSPERO (CRD42022367058)."}]}]}]}}