{"pii": "S0002929723004482", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Summary"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "The calcium/calmodulin-dependent protein kinase type 2 (CAMK2) family consists of four different isozymes, encoded by four different genes—"}, {"#name": "italic", "_": "CAMK2A, CAMK2B, CAMK2G"}, {"#name": "__text__", "_": ", and "}, {"#name": "italic", "_": "CAMK2D"}, {"#name": "__text__", "_": "—of which the first three have been associated recently with neurodevelopmental disorders. CAMK2D is one of the major CAMK2 proteins expressed in the heart and has been associated with cardiac anomalies. Although this CAMK2 isoform is also known to be one of the major CAMK2 subtypes expressed during early brain development, it has never been linked with neurodevelopmental disorders until now. Here we show that CAMK2D plays an important role in neurodevelopment not only in mice but also in humans. We identified eight individuals harboring heterozygous variants in "}, {"#name": "italic", "_": "CAMK2D"}, {"#name": "__text__", "_": " who display symptoms of intellectual disability, delayed speech, behavioral problems, and dilated cardiomyopathy. The majority of the variants tested lead to a gain of function (GoF), which appears to cause both neurological problems and dilated cardiomyopathy. In contrast, loss-of-function (LoF) variants appear to induce only neurological symptoms. Together, we describe a cohort of individuals with neurodevelopmental disorders and cardiac anomalies, harboring pathogenic variants in "}, {"#name": "italic", "_": "CAMK2D"}, {"#name": "__text__", "_": ", confirming an important role for the CAMK2D isozyme in both heart and brain function."}]}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0015", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "CAMK2 disorder is a relatively new disorder where three of the four CAMK2s (CAMK2A, B, and G) are shown to cause neurodevelopmental disorders. In this paper we describe a cohort of eight individuals with neurodevelopmental disorders and cardiac abnormalities, having CAMK2D variants, proving all CAMK2s are important for normal development."}]}]}]}}