{"pii": "S0017931024012535", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara017", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "A novel simulation method is proposed to realize microwave heating of liquids under stirring."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "Simulations were carried out to predict the temperature rise with microwave exposure time."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "The effect of stirring on temperature uniformity was studied."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "The effect of microwave power on coefficient of variation in temperature discussed."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara018", "view": "all"}, "_": "Microwave-assisted chemical reactions present potentially more sustainable routes for process intensification compared with traditional approaches, due to the reduction of reaction times, temperatures, and side reactions. Despite the common misconception that microwave heating is uniform, many processes can be expected to show temperature distributions that vary significantly over the volume, even at length scales far below the operating wavelength. Numerical methods are often employed in the design and optimization phase of a given process, however, due to the multitude of interdependent physics required; the fast and efficient modelling of microwave heating in liquids remains a significant challenge, particularly with respect to computational resources. Here, we report a new multi-physics simulation methodology that models microwave heating of liquids during agitation, requiring less computational resources and delivering temperature predictions within 2.78 % of relative root mean square error. By applying the frozen rotor approach, near-perfect temperature profiles are predicted at approximately 600 times faster convergence time compared to the conventional sliding mesh method. Our proposed model can be used to mimic real reaction systems in a fast and resource-efficient way."}]}]}]}}