{"pii": "S0010027724001495", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0085", "view": "all"}, "$$": [{"#name": "__text__", "_": "The human capacity to imagine possible future events unintentionally, with minimal cognitive effort, is termed spontaneous future thought (SFT). This paper addresses an important theoretical question for cognitive science: What are the possible cognitive mechanisms underlying such SFT experiences? We contrasted three hypotheses present in the literature: the "}, {"#name": "italic", "_": "online construction hypothesis"}, {"#name": "__text__", "_": ", the "}, {"#name": "italic", "_": "recasting hypothesis"}, {"#name": "__text__", "_": ", and the "}, {"#name": "italic", "_": "memories of future thoughts hypothesis"}, {"#name": "__text__", "_": ". Study 1 ("}, {"#name": "italic", "_": "N"}, {"#name": "__text__", "_": " = 41) used novel subjective ratings which challenged the recasting mechanism: SFTs were mostly rated as dissimilar to autobiographical memories, suggesting they are not simply past experiences ‘recast’ as future events. Study 2 ("}, {"#name": "italic", "_": "N"}, {"#name": "__text__", "_": " = 90) used a novel experimental paradigm, comparing effects of voluntary episodic future constructions and non-personal narratives upon subsequent spontaneous thought sampling. Results suggested that voluntary future constructions remain accessible to spontaneous retrieval, supporting the memories of future thoughts hypothesis. This finding, and other data presented across the two studies, still indicates a role for online construction processes in SFT, but further empirical work is needed to clarify how and when constructive processes are engaged in SFT. Taken together, these two studies represent initial efforts to elucidate the mechanisms underlying SFT, providing the first proof-of-principle that deliberately envisioned future events can reappear, without intention, in consciousness at some later time, and further supporting the dual process account of future thinking. These methods and findings provide a firm basis for subsequent experimental and longitudinal research on SFT."}]}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0090", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Spontaneous future thought denotes the phenomenon of imagining possible future events unintentionally and with minimal cognitive effort."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Despite growing interest in SFT, its underlying mechanisms have received little empirical attention."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "In two studies, we evaluated three hypotheses seeking to explain how SFTs arise (online construction hypothesis, recasting hypothesis, memories of future thoughts hypothesis)."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Strongest support was found for the memories of future thoughts hypothesis. This opens new avenues for more extensive experimental and longitudinal research on SFT."}]}]}]}]}]}]}}