{"pii": "S0018506X24001557", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0055", "view": "all"}, "_": "Maternal behavior experienced in early life provides essential scaffolding to infant psychobiology with life-long effects on neurobiological and behavioral outcomes. However, infants are not passive recipients of caregiving. Evidence in rodents suggests that pups actively contribute to dam-pup interactions by soliciting maternal care with auditory, tactile, and hormonal cues. The limited bedding and nesting material (LBN) rearing manipulation induces changes in maternal care that have been attributed to maternal stress caused by the low-resource environment. The goal of the current study was to determine whether LBN also alters pup cues for maternal behavior, with implications for the mechanism of LBN-induced effects. Rat dams and pups were randomly assigned to LBN or Control rearing conditions on postnatal day (P) 0–6 and pups were fostered to the same or different condition on P6–13. LBN increased pup-directed maternal behaviors measured through 24 h monitoring using machine learning based automated analysis. LBN altered several pup cues known to affect maternal behavior including reducing pup core body temperature, reducing body weight, and altering pup vocalizations on P6 and P12. P6–13 LBN-exposed pups had elevated serum testosterone, which positively correlated with maternal licking and grooming. LBN reduced pup movement between nest attendance onset and the start of nursing, which was negatively related to dam nursing latency and contributed to longer nursing latency in LBN dams. P0–6 pup exposure to LBN also led to longer nest attendance bouts and shorter licking and grooming bouts on P7 and P9, suggesting lasting effects of LBN on pups. These data demonstrate that LBN changes pup behavioral and hormonal signals consistent with eliciting more maternal care, contributing to augmented pup-directed behaviors. This bidirectional interplay may be a critical mechanism involved in the lasting effects of early life environments."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0060", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Limited bedding (LBN) increased maternal pup-directed behaviors."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "LBN, dam behavior, and pup age affected pup body temperature."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Home cage pup movement was reduced by LBN and predicted dam nursing latency."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "LBN increased pup serum testosterone and was correlated with licking and grooming."}]}, {"#name": "list-item", "$": {"id": "li0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "LBN effects on pups are consistent with eliciting more maternal care."}]}]}]}]}]}]}}