{"pii": "S001379521930359X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab0005", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0065", "view": "all"}, "_": "Geologists, mine planners, geotechnical, and mining engineers always strive for maximum information to get a better insight of the rock mass before interacting with it. Over the recent decades, close-range terrestrial digital photogrammetry (CRTDP) has been increasingly used for data acquisition and to support the conventional methods for rock mass characterization. It provides a safe, time-saving and contact-free way to gather enough data to minimize user dependent biases. However, it requires an expensive camera, fieldwork and some software to extract the information from images. In addition, it can over-estimate the rock fracturing sometimes due to weathering of the rock face or poor blasting practices. Measurement while drilling (MWD) data include the responses of different drilling parameters to the variations in the rock mass. MWD data are produced in large quantity, as they come from every hole drilled. These data correspond to the inside variations of rock rather than the surface ones counted in photogrammetry."}, {"#name": "simple-para", "$": {"id": "sp0070", "view": "all"}, "_": "In this paper, structural data are obtained from different bench faces of an open pit mine using a commercial software package, ShapeMetriX3D (by 3GSM). These data are compared to the MWD data of the boreholes that were blasted to produce these bench faces to establish certain relationships between drilling parameters and rock mass structures. Half casts of the boreholes with MWD data were visible on the bench faces of the pre-split wall that allowed a better correlation. The results show abrupt changes in MWD parameters for open joints or cavities with some infilling material and overall increases or decreases in parameters for closely spaced bedding planes, fractures or foliations. The results are promising and suggest the method can be used to characterize the rock mass, modify the charging of explosives in blasting operations and facilitate the geological modeling of the rock mass."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "ab0010", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0075", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "The response of penetration rate, percussion pressure, feed pressure and rotation pressure to discontinuities is studied."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Feed pressure and percussive pressure, being controlled by drill control system, usually do not respond to discontinuities."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "However, penetration rate and rotation pressure, vary with the variations in the rock mass being drilled."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The penetration rate and rotation pressure normally rise when the drill bit intersects a joint."}]}, {"#name": "list-item", "$": {"id": "li0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "With a cavity, variations appear in multiple samples that appears as a noisy region on the MWD plot."}]}, {"#name": "list-item", "$": {"id": "li0725"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0625", "view": "all"}, "_": "The closed joints and fractures or bedding planes do not cause variations in drilling parameters."}]}, {"#name": "list-item", "$": {"id": "li6025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p8025", "view": "all"}, "_": "However, these sort of discontinuities lower the mean values for penetration rate and rotation pressure."}]}]}]}]}]}]}}