{"pii": "S0019103523003135", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0165", "view": "all"}, "_": "We use observations of Bennu's impact craters, and measurements of particle sizes seen in images from the OSIRIS-REx (the Origins, Spectral Interpretation, Resource Identification Regolith Explorer sample-return mission) sampling event, to conclude there is a ∼ global sub-surface layer of finer-grained material on Bennu. The layer is evident in particle measurements from areas inside and around craters, roughness assessments of crater interiors vs. surrounding terrain, crater colors, crater depth-to-diameter (d/D) ratios, and the global crater size-frequency distribution. All data sets show a transition in behavior at crater diameters between 20 m and 40 m, with the most abrupt changes at ∼25 m diameter. Based on the depth of ∼25 m diameter craters, we infer that the layer is 1–4 m thick. The reddest craters are the youngest craters, and there is a trend to older ages as redness decreases. The decrease in redness is characterized by an initial, rapid fade, followed by a slower fade. The reduction in expected crater abundance with diameters ∼40–80 m, when extrapolating from larger sizes, is consistent with impact armoring caused by deeper, large sub-surface boulders depressing crater diameter. The existence of the layer appears to be a natural byproduct of impacts across a wide energy range and can be described as a “punctuated equilibrium”: small, frequent impacts contribute to the local production of finer-grained particles and locally mix smaller particles into the subsurface; larger, less-frequent large impacts eject the fine-grained material, exposing interior boulders, and resetting the finer-grained particle population in that area. Other processes, e.g. thermal fracturing, could also contribute to the production of fine-grained material on rapid timescales. Extrapolating to the broader asteroid population and considering the production and preservation of small particles is related to target strength, surface acceleration, and impact speeds, we expect to find such layers on other asteroids, and that the layer thickness and depth will vary with composition, size, and orbital parameters."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0170", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Impact crater features on asteroid (101955) Bennu indicate subsurface layering."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Particles visible during the sampling event at Bennu support this conclusion."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "A near-surface layer consists of finer-grained particles, and is 1–4 m thick."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "We predict a layer of finer-grained particles should exist on other asteroids."}]}, {"#name": "list-item", "$": {"id": "li0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Layering has implications for the evolution of asteroid surfaces and interiors."}]}]}]}]}]}]}}