{"pii": "S0016718523000714", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Digitization and automation of mining amplifies abstraction and decontextualization."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Conceptualizes the digital mine as a self-reinforcing earth-as-mine feedback loop."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Utilizes theories of mediation to unblackbox technical relations of smart mine."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "$$": [{"#name": "__text__", "_": "Automation can transform the conceptual "}, {"#name": "italic", "_": "god's-eye-view"}, {"#name": "__text__", "_": " into the "}, {"#name": "italic", "_": "hand-of-god."}]}]}, {"#name": "list-item", "$": {"id": "o0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Digital twin transmutes complex milieu into dominant representation of target site."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "As natural resource extraction moves into increasingly remote frontiers, rapidly proliferating technologies associated with digitization and automation are respatializing technical and environmental relations both on- and off-shore. Drawing on scholarship in digital geographies and media studies, we employ the concept of mediation to open up the blackbox of digital encounters in mining and extraction. The digitization of earth’s lithosphere serves to physically distance the miner from the mine, while simultaneously producing novel relations between humans and more-than-human matter via granular, multi-spectral, and richly textured information that streams from the mines. Thus, the mine is reconceived as a double treasure trove, where the seams of the earth are both ore and data rich. Focusing on two iron-rich sites targeted for robotic extraction - the proposed seabed mine off Aotearoa New Zealand and the heavily-mined Pilbara region of Western Australia - the comparative findings expand theorization through an explicit focus on digital mediation and shifting relations of the human and non-human components of the extractive industry. Our analysis of the digital mine illustrates how these technologies are driving increased abstraction and decontextualization of the broader socio-ecological relations, serving to obscure the ecological, social, and cultural context within which the mine site is materially entangled. Technologies with automated and remotely-controlled manipulation and simulation capacities, such as digital twins, displace human miners from physical mine sites, increase transmission distances, and reinforce extractive ways of knowing the subterranean and subaqueous. We reveal how digital mediation amplifies a reflexive phenomenon of earth-as-mine feedback loop and how environmental manipulation-from-nowhere transforms the god’s-eye-view into the hand-of-god."}]}]}]}}