{"pii": "S0010945223001867", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Glioma in the left frontal cortex has been reported to cause agrammatic comprehension and induce global functional connectivity alterations within the syntax-related networks. However, it remains unclear to what extent the structural reorganization is affected by preexisting syntax-related networks. We examined 28 patients with a diffuse glioma in the left hemisphere and 23 healthy participants. Syntactic abilities were assessed by a picture-sentence matching task with various sentence types. The lesion responsible for agrammatic comprehension was identified by region-of-interest-based lesion-symptom mapping (RLSM). Cortical structural alterations were examined by surface-based morphometry (SBM), in which the cortical thickness and fractal dimension were measured with three-dimensional magnetic resonance imaging (MRI). Fiber tracking on the human population-averaged diffusion MRI template was performed to examine whether the cortical structural alterations were associated with the syntax-related networks. The RLSM revealed associations between agrammatic comprehension and a glioma in the posterior limb of the left internal capsule. The SBM demonstrated that "}, {"#name": "italic", "_": "decreased"}, {"#name": "__text__", "_": " cortical thickness and/or "}, {"#name": "italic", "_": "increased"}, {"#name": "__text__", "_": " complexity of the right posterior insula were associated not only with agrammatic comprehension of the patients but also with the syntactic abilities of healthy participants. The fiber tracking revealed that the route between these two regions was anatomically integrated into the preexisting syntax-related networks previously identified. These results suggest a potential association between agrammatic comprehension in patients with diffuse glioma and structural variations in specific tracts and cortical regions, which may be closely related to the syntax-related networks."}]}]}]}]}}