{"pii": "S0010482522009192", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1262", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1263"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1265", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1266", "view": "all"}, "_": "Large-scale neuroimaging datasets present unique challenges for automated processing pipelines. Motivated by a large clinical trials dataset with over 235,000 MRI scans, we consider the challenge of defacing — anonymisation to remove identifying facial features. The defacing process must undergo quality control (QC) checks to ensure that the facial features have been removed and that the brain tissue is left intact. Visual QC checks are time-consuming and can cause delays in preparing data. We have developed a convolutional neural network (CNN) that can assist with the QC of the application of MRI defacing; our CNN is able to distinguish between scans that are correctly defaced and can classify defacing failures into three sub-types to facilitate parameter tuning during remedial re-defacing. Since integrating the CNN into our anonymisation pipeline, over 75,000 scans have been processed. Strict thresholds have been applied so that ambiguous classifications are referred for visual QC checks, however all scans still undergo an efficient verification check before being marked as passed. After applying the thresholds, our network is 92% accurate and can classify nearly half of the scans without the need for protracted manual checks. Our model can generalise across MRI modalities and has comparable performance when tested on an independent dataset. Even with the introduction of the verification checks, incorporation of the CNN has reduced the time spent undertaking QC checks by 42% during initial defacing, and by 35% overall. With the help of the CNN, we have been able to successfully deface 96% of the scans in the project whilst maintaining high QC standards. In a similarly sized new project, we would expect the model to reduce the time spent on manual QC checks by 125 h. Our approach is applicable to other projects with the potential to greatly improve the efficiency of imaging anonymisation pipelines."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1268", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1269"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1271", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1272", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1274"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1275"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1278", "view": "all"}, "_": "A deep learning model was developed to verify whether MRI defacing was successful."}]}, {"#name": "list-item", "$": {"id": "d1e1280"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1283", "view": "all"}, "_": "Our CNN ensures that facial features are removed and that the brain is left intact."}]}, {"#name": "list-item", "$": {"id": "d1e1285"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1288", "view": "all"}, "_": "The CNN has high accuracy (92%) when strict thresholds are applied."}]}, {"#name": "list-item", "$": {"id": "d1e1290"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1293", "view": "all"}, "_": "The model correctly identified scans with defacing errors in 94% of cases."}]}, {"#name": "list-item", "$": {"id": "d1e1295"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1298", "view": "all"}, "_": "When incorporated into our pipeline, the model reduces QC time by over one third."}]}]}]}]}]}]}}