{"pii": "S0013935122009045", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "In a world with increasing systems accessing to radio spectrum, the concern for exposure to electromagnetic fields is growing and therefore it is necessary to check limits in those areas where electromagnetic sources are working. Therefore, radio and exposure maps are continuously being generated, mainly in outdoor areas, by using many interpolation techniques. In this work, Surfer software and Kriging interpolation have been used for the first time to generate an indoor exposure map. A regular measuring mesh has been generated. Elimination of Less Significant Points (ELSP) and Geometrical Elimination of Neighbors (GEN) strategies to reduce the measuring points have been presented and evaluated. Both strategies have been compared to the map generated with all the measurements by calculating the root mean square and mean absolute errors. Results indicate that ELSP method can reduce up to 70% of the mesh measuring points while producing similar exposure maps to the one generated with all the measuring points. GEN, however, produces distorted maps and much higher error indicators even for 50% of eliminated measuring points. As a conclusion, a procedure for reducing the measuring points to generate radio and exposure maps is proposed based on the ELSP method and the Kriging interpolation."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Minimization of measuring points for the electric field exposure map generation."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Using Kriging interpolation for indoor electric field exposure map generation."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Elimination of less significant points strategy."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Geometrical Elimination of Neighbors (GEN) with similar electric field values."}]}]}]}]}]}]}}