{"pii": "S0010482524004244", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The aging population is steadily increasing, posing new challenges and opportunities for healthcare systems worldwide. Technological advancements, particularly in commercially available Active Assisted Living devices, offer a promising alternative. These readily accessible products, ranging from smartwatches to home automation systems, are often equipped with Artificial Intelligence capabilities that can monitor health metrics, predict adverse events, and facilitate a safer living environment. However, there is no review exploring how Artificial Intelligence has been integrated into commercially available Active Assisted Living technologies, and how these devices monitor health metrics and provide healthcare solutions in a real-world environment for healthy aging. This review is essential because it fills a knowledge gap in understanding AI's integration in Active Assisted Living technologies in promoting healthy aging in real-world settings, identifying key issues that require to be addressed in future studies."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0020"}, "_": "Objective"}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "The aim of this overview is to outline current understanding, identify potential research opportunities, and highlight research gaps from published studies regarding the use of Artificial Intelligence in commercially available Active Assisted Living technologies that assists older individuals aging at home."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0025"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "A comprehensive search was conducted in six databases—PubMed, CINAHL, IEEE Xplore, Scopus, ACM Digital Library, and Web of Science—to identify relevant studies published over the past decade from 2013 to 2024. Our methodology adhered to the PRISMA extension for scoping reviews to ensure rigor and transparency throughout the review process. After applying predefined inclusion and exclusion criteria on 825 retrieved articles, a total of 64 papers were included for analysis and synthesis."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0025", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0030"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "Several trends emerged from our analysis of the 64 selected papers. A majority of the work (39/64, 61%) was published after the year 2020. Geographically, most of the studies originated from East Asia and North America (36/64, 56%). The primary application goal of Artificial Intelligence in the reviewed literature was focused on activity recognition (34/64, 53%), followed by daily monitoring (10/64, 16%). Methodologically, tree-based and neural network-based approaches were the most prevalent Artificial Intelligence algorithms used in studies (32/64, 50% and 31/64, 48% respectively). A notable proportion of the studies (32/64, 50%) carried out their research using specially designed smart home testbeds that simulate the conditions in real-world. Moreover, ambient technology was a common thread (49/64, 77%), with occupancy-related data (such as motion and electrical appliance usage logs) and environmental sensors (indicators like temperature and humidity) being the most frequently used."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0030", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0035"}, "_": "Conclusion"}, {"#name": "simple-para", "$": {"id": "abspara0030", "view": "all"}, "_": "Our results suggest that Artificial Intelligence has been increasingly deployed in the real-world Active Assisted Living context over the past decade, offering a variety of applications aimed at healthy aging and facilitating independent living for the older adults. A wide range of smart home indicators were leveraged for comprehensive data analysis, exploring and enhancing the potentials and effectiveness of solutions. However, our review has identified multiple research gaps that need further investigation. First, most research has been conducted in controlled testbed environments, leaving a lack of real-world applications that could validate the technologies' efficacy and scalability. Second, there is a noticeable absence of research leveraging cloud technology, an essential tool for large-scale deployment and standardized data collection and management. Future work should prioritize these areas to maximize the potential benefits of Artificial Intelligence in Active Assisted Living settings."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0040"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0035", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0035", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "AI integration in Active Assisted Living devices aids healthy aging and independent living."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Majority of studies (61%) published post-2020, highlighting a growing research interest."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Tree-based and neural network algorithms most used in AI for aging-at-home technologies."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "50% of research utilized smart home testbeds, indicating a need for real-world application studies."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "Future research to focus on cloud technology for scalable Active Assisted Living solutions."}]}]}]}]}]}]}}