{"pii": "S0026049520302043", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab0005", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "sp0030", "view": "all"}, "_": "Obesity is a major risk factor for diabetes and cardiovascular diseases such as hypertension, heart failure, and stroke. Impaired endothelial function occurs in the earliest stages of obesity and underlies vascular alterations that give rise to cardiovascular disease. However, the mechanisms that link weight gain to endothelial dysfunction are ill-defined. Increasing evidence suggests that endothelial cells are not a population of uniform cells but are highly heterogeneous and are organized as a communicating multicellular network that controls vascular function."}]}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0015"}, "_": "Purpose"}, {"#name": "simple-para", "$": {"id": "sp0035", "view": "all"}, "_": "To investigate the hypothesis that disrupted endothelial heterogeneity and network-level organization contribute to impaired vascular reactivity in obesity."}]}, {"#name": "abstract-sec", "$": {"id": "as0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Methods and results"}, {"#name": "simple-para", "$": {"id": "sp0040", "view": "all"}, "_": "To study obesity-related vascular function without complications associated with diabetes, a state of prediabetic obesity was induced in rats. Small artery diameter recordings confirmed nitric-oxide mediated vasodilator responses were dependent on increases in endothelial calcium levels and were impaired in obese animals. Single-photon imaging revealed a linear relationship between blood vessel relaxation and population-wide calcium responses. Obesity did not alter the slope of this relationship, but impaired calcium responses in the endothelial cell network. The network comprised structural and functional components. The structural architecture, a hexagonal lattice network of connected cells, was unchanged in obesity. The functional network contained sub-populations of clustered specialized agonist-sensing cells from which signals were communicated through the network. In obesity there were fewer but larger clusters of sensory cells and communication path lengths between clusters increased. Communication between neighboring cells was unaltered in obesity. Altered network organization resulted in impaired, population-level calcium signaling and deficient endothelial control of vascular tone."}]}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0025"}, "_": "Conclusions"}, {"#name": "simple-para", "$": {"id": "sp0045", "view": "all"}, "_": "The distribution of cells in the endothelial network is critical in determining overall vascular response. Altered cell heterogeneity and arrangement in obesity decreases endothelial function and provides a novel framework for understanding compromised endothelial function in cardiovascular disease."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "ab0010", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0030"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0025", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0050", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "The endothelium is an assembly of exquisitely organized cells in a highly-refined network that is essential to function."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "In obesity, the network is disorganized into fewer, larger sensory clusters with increased path lengths between clusters"}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "$$": [{"#name": "__text__", "_": "The disorganized endothelial network resulted in deficient encoding of vasoactive stimuli to population level Ca"}, {"#name": "sup", "$": {"loc": "post"}, "_": "2+"}, {"#name": "__text__", "_": " responses"}]}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Changes in the network organization of endothelial cells contributes to obesity-related vascular dysfunction."}]}]}]}]}]}]}}