{"pii": "S0021925823001047", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Cavβ subunits are essential for surface expression of voltage-gated calcium channel complexes and crucially modulate biophysical properties like voltage-dependent inactivation. Here, we describe the discovery and characterization of a novel Cavβ"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": " variant with distinct features that predominates in the retina. We determined spliced exons in retinal transcripts of the "}, {"#name": "italic", "_": "Cacnb2"}, {"#name": "__text__", "_": " gene, coding for Cavβ"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": ", by RNA-Seq data analysis and quantitative PCR. We cloned a novel Cavβ"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": " splice variant from mouse retina, which we are calling β"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2i"}, {"#name": "__text__", "_": ", and investigated biophysical properties of calcium currents with this variant in a heterologous expression system as well as its intrinsic membrane interaction when expressed alone. Our data showed that β"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2i"}, {"#name": "__text__", "_": " predominated in the retina with expression in photoreceptors and bipolar cells. Furthermore, we observed that the β"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2i"}, {"#name": "__text__", "_": " N-terminus exhibited an extraordinary concentration of hydrophobic residues, a distinct feature not seen in canonical variants. The biophysical properties resembled known membrane-associated variants, and β"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2i"}, {"#name": "__text__", "_": " exhibited both a strong membrane association and a propensity for clustering, which depended on hydrophobic residues in its N-terminus. We considered available Cavβ structure data to elucidate potential mechanisms underlying the observed characteristics but resolved N-terminus structures were lacking and thus, precluded clear conclusions. With this description of a novel N-terminus variant of Cavβ"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": ", we expand the scope of functional variation through N-terminal splicing with a distinct form of membrane attachment. Further investigation of the molecular mechanisms underlying the features of β"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2i"}, {"#name": "__text__", "_": " could provide new angles on the way Cavβ subunits modulate Ca"}, {"#name": "sup", "$": {"loc": "post"}, "_": "2+"}, {"#name": "__text__", "_": " channels at the plasma membrane."}]}]}]}]}}