{"pii": "S0021925819350781", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ceab10", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara140", "view": "all"}, "_": "Clathrin-mediated endocytosis is the major pathway for recycling of granule membrane components after strong stimulation and high exocytotic rates. It resembles “classical” receptor-mediated endocytosis but has a trigger that is unique to secretion, the sudden appearance of the secretory granule membrane in the plasma membrane. The spatial localization, the relationship to individual fusion events, the nature of the cargo, and the timing and nature of the nucleation events are unknown. Furthermore, a size mismatch between chromaffin granules (∼300-nm diameter) and typical clathrin-coated vesicles (∼90 nm) makes it unlikely that clathrin-mediated endocytosis internalizes as a unit the entire fused granule membrane. We have used a combination of total internal reflection fluorescence microscopy of transiently expressed proteins and time-resolved quantitative confocal imaging of endogenous proteins along with a fluid-phase marker to address these issues. We demonstrate that the fused granule membrane remains a distinct entity and serves as a nucleation site for clathrin- and dynamin-mediated endocytosis that internalizes granule membrane components in small increments."}]}]}, {"#name": "abstract", "$": {"id": "ceab20", "class": "teaser", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "ceabs20", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara150", "view": "all"}, "$$": [{"#name": "bold", "_": "Background:"}, {"#name": "__text__", "_": " Retrieval of the fused secretory granule membrane is poorly understood."}]}, {"#name": "simple-para", "$": {"id": "spara160", "view": "all"}, "$$": [{"#name": "bold", "_": "Results:"}, {"#name": "__text__", "_": " Granule membrane proteins remain associated after fusion, attract clathrin and dynamin, and are gradually removed together."}]}, {"#name": "simple-para", "$": {"id": "spara170", "view": "all"}, "$$": [{"#name": "bold", "_": "Conclusion:"}, {"#name": "__text__", "_": " The fused membrane is a nucleation site for endocytosis, which internalizes the membrane bit-by-bit."}]}, {"#name": "simple-para", "$": {"id": "spara180", "view": "all"}, "$$": [{"#name": "bold", "_": "Significance:"}, {"#name": "__text__", "_": " This work provides a fundamental mechanistic insight into a process essential for secretory cells."}]}]}]}]}}