{"pii": "S0023683722600527", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "Abs1", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cestitle10"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara130", "view": "all"}, "_": "Transgenic mouse models of cancer represent a powerful approach for exploring disease processes and testing potential therapeutic interventions. Currently, it is difficult to predict if a specific genetic manipulation will result in a desirable phenotype. The present study tests the idea that tissue recombinants recapitulate the pathologic features of the neoplastic prostate seen in transgenic mice, and would thus be suitable predictive models for new mouse design. The large probasin-large T-antigen (LPB-Tag) transgenic lines 12T-7f and 12T-10 were used as a basis for this study. Tissue recombinants of bladder epithelium (BlE) and urogenital sinus mesenchyme (UGM) were implanted under the renal capsule of athymic mice. Recombinants composed of BlE from 12T-10 LPB-Tag and wild-type (wt) UGM faithfully recapitulated the histopathologic and temporal features of intact transgenic mice of this line. Tissue recombinants using BlE from 12T-7f mice and wt UGM developed epithelial proliferation with atypia that lacked the associated hypercellular stroma seen in the intact 12T-7f line. Recombinants using 12T-7f UGM demonstrated that the hypercellular stroma results from stromal cell expression of the SV40 large T antigen. Corresponding to the recombinant phenotypes, stromal Tag immunostaining was observed in prostate tissues from intact 12T-7f but not 12T-10 mice. Similar stromal expression of Tag was also noted in the hypercellular TRAMP prostatic stroma. Further analysis revealed a previously unreported pattern of SV40T expression in the LADY and TRAMP models including ductus deferens and seminal vesicle stroma as well as region and cell type-specific patterns in the epididymis. The present study demonstrates the utility of using tissue recombination to explore organ-specific phenotypes. Recombination strategies should enable quick and cost-effective screening for likely phenotypes in transgenic animals. This comparison of tissue recombination to existing models shows that this approach can elicit new information on well-characterized models."}]}]}]}}