{"pii": "S0021925823024249", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Scaffold proteins help mediate interactions between protein partners, often to optimize intracellular signaling. Herein, we use comparative, biochemical, biophysical, molecular, and cellular approaches to investigate how the scaffold protein NEMO contributes to signaling in the NF-κB pathway. Comparison of NEMO and the related protein optineurin from a variety of evolutionarily distant organisms revealed that a central region of NEMO, called the Intervening Domain (IVD), is conserved between NEMO and optineurin. Previous studies have shown that this central core region of the IVD is required for cytokine-induced activation of IκB kinase (IKK). We show that the analogous region of optineurin can functionally replace the core region of the NEMO IVD. We also show that an intact IVD is required for the formation of disulfide-bonded dimers of NEMO. Moreover, inactivating mutations in this core region abrogate the ability of NEMO to form ubiquitin-induced liquid-liquid phase separation droplets "}, {"#name": "italic", "_": "in vitro"}, {"#name": "__text__", "_": " and signal-induced puncta "}, {"#name": "italic", "_": "in vivo"}, {"#name": "__text__", "_": ". Thermal and chemical denaturation studies of truncated NEMO variants indicate that the IVD, while not intrinsically destabilizing, can reduce the stability of surrounding regions of NEMO due to the conflicting structural demands imparted on this region by flanking upstream and downstream domains. This conformational strain in the IVD mediates allosteric communication between the N- and C-terminal regions of NEMO. Overall, these results support a model in which the IVD of NEMO participates in signal-induced activation of the IKK/NF-κB pathway by acting as a mediator of conformational changes in NEMO."}]}]}]}]}}