{"pii": "S0021925823025796", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Bromodomain-PHD finger protein 1 (BRPF1) belongs to the BRPF family of bromodomain-containing proteins. Bromodomains are exclusive reader modules that recognize and bind acetylated histones and non-histone transcription factors to regulate gene expression. The biological functions of acetylated histone recognition by BRPF1 bromodomain are well characterized; however, the function of BRPF1 regulation "}, {"#name": "italic", "_": "via"}, {"#name": "__text__", "_": " non-histone acetylation is still unexplored. Therefore, identifying the non-histone interactome of BRPF1 is pivotal in deciphering its role in diverse cellular processes, including its misregulation in diseases like cancer. Herein, we identified the non-histone interacting partners of BRPF1 utilizing a protein engineering-based approach. We site-specifically introduced the unnatural photo-cross-linkable amino acid 4-azido-L-phenylalanine into the bromodomain of BRPF1 without altering its ability to recognize acetylated histone proteins. Upon photoirradiation, the engineered BRPF1 generates a reactive nitrene species, cross-linking interacting partners with spatio-temporal precision. We demonstrated the robust cross-linking efficiency of the engineered variant with reported histone ligands of BRPF1 and further used the variant reader to cross-link its interactome. We also characterized novel interacting partners by proteomics, suggesting roles for BRPF1 in diverse cellular processes. BRPF1 interaction with interleukin enhancer–binding factor 3, one of these novel interacting partners, was further validated by isothermal titration calorimetry and co-IP. Lastly, we used publicly available ChIP-seq and RNA-seq datasets to understand the colocalization of BRPF1 and interleukin enhancer–binding factor 3 in regulating gene expression in the context of hepatocellular carcinoma. Together, these results will be crucial for full understanding of the roles of BRPF1 in transcriptional regulation and in the design of small-molecule inhibitors for cancer treatment."}]}]}]}]}}