{"pii": "S0021925818307907", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ceab10", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara110", "view": "all"}, "_": "Membrane proteins of the endoplasmic reticulum (ER) may be localized to this organelle by mechanisms that involve retention, retrieval, or a combination of both. For luminal ER proteins, which contain a KDEL domain, and for type I transmembrane proteins carrying a dilysine motif, specific retrieval mechanisms have been identified. However, most ER membrane proteins do not contain easily identifiable retrieval motifs. ER localization information has been found in cytoplasmic, transmembrane, or luminal domains. In this study, we have identified ER localization domains within the three type I transmembrane proteins, ribophorin I (RI), ribophorin II (RII), and OST48. Together with DAD1, these membrane proteins form an oligomeric complex that has oligosaccharyltransferase (OST) activity. We have previously shown that ER retention information is independently contained within the transmembrane and the cytoplasmic domain of RII, and in the case of RI, a truncated form consisting of the luminal domain was retained in the ER. To determine whether other domains of RI carry additional retention information, we have generated chimeras by exchanging individual domains of the Tac antigen with the corresponding ones of RI. We demonstrate here that only the luminal domain of RI contains ER retention information. We also show that the dilysine motif in OST48 functions as an ER localization motif because OST48 in which the two lysine residues are replaced by serine (OST48ss) is no longer retained in the ER and is found instead also at the plasma membrane. OST48ss is, however, retained in the ER when coexpressed with RI, RII, or chimeras, which by themselves do not exit from the ER, indicating that they may form partial oligomeric complexes by interacting with the luminal domain of OST48. In the case of the Tac chimera containing only the luminal domain of RII, which by itself exits from the ER and is rapidly degraded, it is retained in the ER and becomes stabilized when coexpressed with OST48."}]}]}]}}