{"pii": "S0022227523000226", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "We previously demonstrated that antisense oligonucleotide-mediated knockdown of Mboat7, the gene encoding membrane bound O-acyltransferase 7, in the liver and adipose tissue of mice promoted high fat diet-induced hepatic steatosis, hyperinsulinemia, and systemic insulin resistance. Thereafter, other groups showed that hepatocyte-specific genetic deletion of Mboat7 promoted striking fatty liver and NAFLD progression in mice but does not alter insulin sensitivity, suggesting the potential for cell autonomous roles. Here, we show that MBOAT7 function in adipocytes contributes to diet-induced metabolic disturbances including hyperinsulinemia and systemic insulin resistance. We generated Mboat7 floxed mice and created hepatocyte- and adipocyte-specific Mboat7 knockout mice using Cre-recombinase mice under the control of the albumin and adiponectin promoter, respectively. Here, we show that MBOAT7 function in adipocytes contributes to diet-induced metabolic disturbances including hyperinsulinemia and systemic insulin resistance. The expression of Mboat7 in white adipose tissue closely correlates with diet-induced obesity across a panel of ∼100 inbred strains of mice fed a high fat/high sucrose diet. Moreover, we found that adipocyte-specific genetic deletion of Mboat7 is sufficient to promote hyperinsulinemia, systemic insulin resistance, and mild fatty liver. Unlike in the liver, where Mboat7 plays a relatively minor role in maintaining arachidonic acid-containing PI pools, Mboat7 is the major source of arachidonic acid-containing PI pools in adipose tissue. Our data demonstrate that MBOAT7 is a critical regulator of adipose tissue PI homeostasis, and adipocyte MBOAT7-driven PI biosynthesis is closely linked to hyperinsulinemia and insulin resistance in mice."}]}]}]}}