{"pii": "S0023683722002112", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "Abs1", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cestitle10"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara140", "view": "all"}, "$$": [{"#name": "__text__", "_": "Multiplexed ion beam imaging by time-of-flight (MIBI-TOF) is a form of mass spectrometry imaging that uses metal labeled antibodies and secondary ion mass spectrometry to image dozens of proteins simultaneously in the same tissue section. Working with the National Cancer Institute's (NCI) Cancer Immune Monitoring and Analysis Centers (CIMAC), we undertook a validation study, assessing concordance across a dozen serial sections of a tissue microarray of 21 samples that were independently processed and imaged by MIBI-TOF or single-plex immunohistochemistry (IHC) over 12 days. Pixel-level features were highly concordant across all 16 targets assessed in both staining intensity ("}, {"#name": "italic", "_": "R"}, {"#name": "sup", "$": {"loc": "post"}, "$$": [{"#name": "italic", "_": "2"}]}, {"#name": "__text__", "_": " = 0.94 ± 0.04) and frequency ("}, {"#name": "italic", "_": "R"}, {"#name": "sup", "$": {"loc": "post"}, "$$": [{"#name": "italic", "_": "2"}]}, {"#name": "__text__", "_": " = 0.95 ± 0.04). Comparison to digitized, single-plex IHC on adjacent serial sections revealed similar concordance ("}, {"#name": "italic", "_": "R"}, {"#name": "sup", "$": {"loc": "post"}, "$$": [{"#name": "italic", "_": "2"}]}, {"#name": "__text__", "_": " = 0.85 ± 0.08) as well. Lastly, automated segmentation and clustering of eight cell populations found that cell frequencies between serial sections yielded an average correlation of "}, {"#name": "italic", "_": "R"}, {"#name": "sup", "$": {"loc": "post"}, "$$": [{"#name": "italic", "_": "2"}]}, {"#name": "__text__", "_": " = 0.94 ± 0.05. Taken together, we demonstrate that MIBI-TOF, with well-vetted reagents and automated analysis, can generate consistent and quantitative annotations of clinically relevant cell states in archival human tissue, and more broadly, present a scalable framework for benchmarking multiplexed IHC approaches."}]}]}]}]}}