{"pii": "S002240731930086X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "id": "absh001", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0001", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "lst0007"}, "$$": [{"#name": "list-item", "$": {"id": "lstitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0001", "view": "all"}, "_": "This article outlines the objectives, concept and expected performance of the ALTIUS (Atmospheric Limb Tracker for the Investigation of the Upcoming Stratosphere) mission in view of the continuation of earth limb measurements for atmospheric science. This type of measurement became rare with the failure of the European ENVISAT mission in 2012 and the number will further decrease when several Canadian, Swedish and US limb missions will terminate within the next few years."}]}, {"#name": "list-item", "$": {"id": "lstitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0002", "view": "all"}, "_": "The project was presented as a small mission initiative based on a micro-satellite platform of the PROBA (Project for On-Board Autonomy) class, with a high agility allowing for atmospheric limb observations in different remote sensing geometries from a low earth orbit. The instrument consists of three independent spectral imagers covering the UV–vis–NIR ranges."}]}, {"#name": "list-item", "$": {"id": "lstitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0003", "view": "all"}, "_": "Recently, the ALTIUS mission has been declared as an element compliant to the ESA Earth Watch programme."}]}, {"#name": "list-item", "$": {"id": "lstitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0004", "view": "all"}, "_": "The paper identifies the general scientific context of the project and derives the mission, instrument and scientific products requirements. The general design of the payload and platform systems is discussed. The preliminary data processing chain is presented, from telemetry data to retrieved geophysical profiles, with a complementary data assimilation level. A preliminary assessment of the mission performance is discussed with focus on ozone profile retrievals, which are the main objective of the mission."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0002", "view": "all"}, "$$": [{"#name": "__text__", "_": "This article describes the objectives, concept and expected performance of the ALTIUS (Atmospheric Limb Tracker for the Investigation of the Upcoming Stratosphere) mission in view of the continuation of earth limb measurements for atmospheric science. The instrument, consisting of three independent spectral imagers in the UV–vis–NIR range, will be operated from several observation geometries with a global coverage in a 3-days revisit cycle. ALTIUS will retrieve vertical concentration profiles of ozone with a required 3–10% total error in the stratosphere. Other important scientific objectives will address NO"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": ", H"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": "O, CH"}, {"#name": "inf", "$": {"loc": "post"}, "_": "4"}, {"#name": "__text__", "_": ", various aerosol and cloud extinction profiles as well as other minor absorbers. Tomography, temperature retrievals and self-calibrating observations will be also implemented."}]}, {"#name": "simple-para", "$": {"id": "sp0003", "view": "all"}, "_": "This type of measurement became rare with the failure of the European ENVISAT mission in 2012 and the number will further decrease when several Canadian, Swedish and US limb missions will terminate within the next few years. It is a small mission initiative based on a micro-satellite platform of the PROBA (Project for On-Board Autonomy) class, with a high agility allowing for atmospheric limb observations in different remote sensing geometries from a low earth orbit. The instrument consists of three independent spectral imagers covering the UV–vis–NIR ranges."}, {"#name": "simple-para", "$": {"id": "sp0004", "view": "all"}, "_": "The ALTIUS mission will be implemented as an element of the ESA Earth Watch programme."}, {"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The paper identifies the general scientific context of the project and derives the mission, instrument and scientific products requirements. The general design of the payload and platform systems is discussed. The preliminary data processing chain is presented, from telemetry data to retrieved geophysical profiles, with a complementary data assimilation level. A preliminary assessment of the mission performance is discussed with focus on ozone profile retrievals, which are the main objective of the mission."}]}]}]}}