{"pii": "S0022000011001164", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "aep-abstract-id4"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id5"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "In recent times, digital music items on the internet have been evolving in a vast information space where consumers try to find/locate the piece of music of their choice by means of search engines. The current trend of searching for music by means of music consumersʼ keywords/tags is unable to provide satisfactory search results. It is argued that search and retrieval of music can be significantly improved provided end-usersʼ tags are associated with semantic information in terms of acoustic metadata – the latter being easy to extract automatically from digital music items. This paper presents a lightweight ontology that will enable music producers to annotate music against MPEG-7 description (with its acoustic metadata) and the generated annotation may in turn be used to deliver meaningful search results. Several potential multimedia ontologies have been explored and a music annotation ontology, named "}, {"#name": "bold", "$$": [{"#name": "italic", "_": "mpeg-7Music"}]}, {"#name": "__text__", "_": ", has been designed so that it can be used as a backbone for annotating music items."}]}]}]}, {"#name": "abstract", "$": {"class": "graphical", "id": "aep-abstract-id6"}, "$$": [{"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id7"}, "$$": [{"#name": "section-title", "_": "Highlights"}, {"#name": "simple-para", "$": {"id": "sp0020", "view": "all"}, "$$": [{"#name": "__text__", "_": "► Currently internet searching for digital music items produces unsatisfactory results. ► Semantic annotation can significantly enhance search and retrieval of music items. ► We propose "}, {"#name": "bold", "$$": [{"#name": "italic", "_": "Mpeg-7Music"}]}, {"#name": "__text__", "_": " ontology for semantic annotation of digital music items. ► "}, {"#name": "bold", "$$": [{"#name": "italic", "_": "Mpeg-7Music"}]}, {"#name": "__text__", "_": " was mapped to MPEG-7 Audio data types and encoded in OWL1.0. ► "}, {"#name": "bold", "$$": [{"#name": "italic", "_": "Mpeg-7Music"}]}, {"#name": "__text__", "_": " novelty: Creation of a bridge between music consumersʼ tags and Mpeg7."}]}]}]}]}}