{"pii": "S0021925824022269", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Mutations of human "}, {"#name": "italic", "_": "TBC1D24"}, {"#name": "__text__", "_": " are associated with deafness, epilepsy, or DOORS syndrome (deafness, onychodystrophy, osteodystrophy, cognitive disability, and seizures). The causal relationships between "}, {"#name": "italic", "_": "TBC1D24"}, {"#name": "__text__", "_": " variants and the different clinical phenotypes are not understood. Our hypothesis is that phenotypic heterogeneity of missense mutations of "}, {"#name": "italic", "_": "TBC1D24"}, {"#name": "__text__", "_": " results, in part, from perturbed binding of different protein partners. To discover novel protein partners of TBC1D24, we conducted yeast two-hybrid (Y2H) screen using mouse full-length TBC1D24 as bait. Kidney and brain protein (KIBRA), a scaffold protein encoded by "}, {"#name": "italic", "_": "Wwc1"}, {"#name": "__text__", "_": ", was identified as a partner of TBC1D24. KIBRA functions in the Hippo signaling pathway and is important for human cognition and memory. The TBC1D24 TLDc domain binds to KIBRA full-length and to its C2 domain, confirmed by Y2H assays. No interaction was detected with Y2H assays between the KIBRA C2 domain and TLDc domains of NCOA7, MEAK7, and OXR1. Moreover, the C2 domains of other WWC family proteins do not interact with the TLDc domain of TBC1D24, demonstrating specificity. The mRNAs encoding TBC1D24 and KIBRA proteins in mouse are coexpressed at least in a subset of hippocampal cells indicating availability to interact "}, {"#name": "italic", "_": "in vivo"}, {"#name": "__text__", "_": ". As two epilepsy-associated recessive variants (Gly511Arg and Ala515Val) in the TLDc domain of human TBC1D24 disrupt the interaction with the human KIBRA C2 domain, this study reveals a pathogenic mechanism of TBC1D24-associated epilepsy, linking the TBC1D24 and KIBRA pathways. The interaction of TBC1D24-KIBRA is physiologically meaningful and necessary to reduce the risk of epilepsy."}]}]}]}]}}