{"pii": "S0022096521001259", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "id": "ab005", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Caregivers read children (aged 5–7 years) a story containing novel words."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "New word production and comprehension were better at the 24 hr than 0 hr test."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Children with better vocabulary showed larger overnight gains in comprehension."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Overnight comprehension gains were largest if the story was read 3–5 hrs before bed."}]}, {"#name": "list-item", "$": {"id": "o0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Findings lend ecological validity to lab-based findings in word learning."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Shared storybook reading is a key aid to vocabulary acquisition during childhood. However, word learning research has tended to use unnaturalistic (explicit) training regimes. Using a storybook paradigm, we examined whether children (particularly those with weaker vocabularies) are more likely to retain new words if they learn them closer to sleep. Parents read their children (5- to 7-year-olds; "}, {"#name": "italic", "_": "N"}, {"#name": "__text__", "_": " = 237) an alien adventure story that contained 12 novel words with illustrations at one of two training times: at bedtime or 3–5 h before bedtime. Using online tasks, parents tested their children’s ability to recall the new words (production) and associate them with pictures (comprehension) immediately after hearing the story and again the following morning. As hypothesized, we replicated two findings. First, children showed overnight improvements in their ability to produce and comprehend new words when tested again the next day. Second, children with better existing vocabulary knowledge showed larger overnight gains in new word comprehension. Counter to expectations, overnight gains in comprehension were larger if the story was read 3–5 h before bedtime rather than at bedtime. These ecologically valid findings are consistent with theories that characterize word learning as a prolonged process supported by mechanisms such as consolidation and retrieval practice, with existing vocabulary knowledge acting as an important source of variability in retention. The findings provide preliminary evidence that encountering new words in stories later in the day (but not too close to sleep) may help to harness vocabulary growth and may be more beneficial than leaving shared storybook reading just for bedtime."}]}]}]}]}}