{"pii": "S0021925823023232", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Loss of functional RAB18 causes the autosomal recessive condition Warburg Micro syndrome. To better understand this disease, we used proximity biotinylation to generate an inventory of potential RAB18 effectors. A restricted set of 28 RAB18 interactions were dependent on the binary RAB3GAP1–RAB3GAP2 RAB18–guanine nucleotide exchange factor complex. Twelve of these 28 interactions are supported by prior reports, and we have directly validated novel interactions with SEC22A, TMCO4, and INPP5B. Consistent with a role for RAB18 in regulating membrane contact sites, interactors included groups of microtubule/membrane-remodeling proteins, membrane-tethering and docking proteins, and lipid-modifying/transporting proteins. Two of the putative interactors, EBP and OSBPL2/ORP2, have sterol substrates. EBP is a Δ8-Δ7 sterol isomerase, and ORP2 is a lipid transport protein. This prompted us to investigate a role for RAB18 in cholesterol biosynthesis. We found that the cholesterol precursor and EBP-product lathosterol accumulates in both RAB18-null HeLa cells and RAB3GAP1-null fibroblasts derived from an affected individual. Furthermore, "}, {"#name": "italic", "_": "de novo"}, {"#name": "__text__", "_": " cholesterol biosynthesis is impaired in cells in which RAB18 is absent or dysregulated or in which ORP2 expression is disrupted. Our data demonstrate that guanine nucleotide exchange factor–dependent Rab interactions are highly amenable to interrogation by proximity biotinylation and may suggest that Micro syndrome is a cholesterol biosynthesis disorder."}]}]}]}]}}