{"pii": "S0022169422015773", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Removal of GEDI outliers and water level evaluation."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Bias adjustment between mission ICESat-2 and GEDI."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Water level dynamics from integrating ICESat-2 and GEDI."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Water levels cross validation with DAHITI and Hydroweb datasets."}]}, {"#name": "list-item", "$": {"id": "o0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Factors that affecting the accuracy of water level monitoring."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "The water levels of inland lakes on the Tibetan Plateau are extremely sensitive to global climate change and can objectively reflect the temporal and spatial changes in local water resources. However, monthly and seasonal variations in lake water levels are difficult to monitor due to the lack of sufficient "}, {"#name": "italic", "_": "in situ"}, {"#name": "__text__", "_": " gauges across mountainous areas. Moreover, GEDI products exhibit large uncertainties in mountainous surroundings. In this paper, taking Qinghai Lake as an example, we first refined the raw data of the GEDI and ICESat-2 missions by implementing a quality control procedure involving outlier removal tailored to the characteristics of each mission; then, we analyzed the accuracy of each mission, especially targeting factors that affect the water level retrievals in the GEDI products. Third, the bias between the two missions was adjusted by selecting the overlapping or adjacent observation dates. Finally, we constructed dense temporal water-level data by integrating the refined ICESat-2 and GEDI data. Data from water level stations and the DAHITI and Hydroweb datasets were also utilized for validation. The results show that (1) very accurate results can be obtained from the ICESat-2 ATL13 product, and the standard deviations of most observed days are under 0.05 m; (2) the GEDI products derived from algorithm 2 can offer more effective footprints than those from algorithm 1, with an improvement of approximately 9.78 %. Moreover, large differences exist among the different GEDI beams, and beams 1 and 2 are recommended for further analysis. Overall, most beams overestimated the lake levels with a bias of 0.264 ± 0.357 m; (3) the long-time-series water levels showed a mean increasing trend of 0.243 m/yr from 2018 to 2021. The relatively high-water-level periods were distributed mostly in August and September, while the low-water-level periods were distributed mostly in February and March. The combined water levels were very correlated with the DAHITI and Hydroweb datasets, with R values larger than 0.8, and highly consistent with the observations from hydrological stations (the inter-year change range spanned from 0.015 m to 0.327 m, and the intra-year difference range varied from 0.03 m to 0.16 m); and (4) Integrating the GEDI and ICESat-2 missions allowed us to capture the monthly, seasonal and annual dynamics of the lake water level, and the results indicate that the combined dataset presents a valuable resource for hydrological and climatic change studies."}]}]}]}]}}