{"pii": "S0022000011001401", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "aep-abstract-id11"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id12"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Assurance networks are one of the essential technologies of New-generation Networks. Assurance is defined as the capability of guaranteeing functional and non-functional system properties such as dependability, security, timeliness and adaptability to heterogeneous and changing requirements. Assurance is essential for sustainable networks and this research focused specifically on providing assurance for WSNs. Node capture attacks are one prospective kind of attack on WSNs. To reduce negative effect of node capture attacks, we have previously proposed secure decentralized data transfer. In this proposed method, it was assumed that multiple paths were in place. In this paper as well, we again propose using the multipath routing method. To make multiple paths fit our previously proposed method, we have modified ATR (Augmented Tree Based Routing). We have conducted simulation experiments using our proposed method in a network simulator. The results show that our previously proposed method is effective in both cases in which the network size is small or large. In addition, we conducted other simulation experiments to measure several aspects of the assurance of our method. We measured in terms of varying parameters such as node densities, distance between the source and the destination nodes, and so on. Additionally, our method is more assured than the single path-based method."}]}]}, {"#name": "abstract", "$": {"class": "graphical", "id": "aep-abstract-id13"}, "$$": [{"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id14"}, "$$": [{"#name": "section-title", "_": "Highlights"}, {"#name": "simple-para", "$": {"id": "sp0020", "view": "all"}, "_": "► We propose a multipath routing method for Wireless Sensor Networks with assurance. ► Modified ATR is used to make multiple paths fit secure decentralized data transfer. ► We have conducted experiments on security and dependability of the assurance. ► Effects of varying parameters such as node densities are also measured. ► Our method has higher assurance than the single path-based method."}]}]}]}}