{"pii": "S0020025524001452", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0120", "view": "all"}, "_": "Human behavior may be one of the most challenging phenomena to model and validate. This paper proposes a method for automatically extracting and compiling evidence on human behavior determinants into a knowledge graph. The method (1) extracts associations of behavior determinants and choice options in relation to study groups and moderators from published studies using Natural Language Processing and Deep Learning, (2) synthesizes the extracted evidence into a knowledge graph, and (3) sub-selects the model components and relationships that are relevant and robust. The method can be used to either (4a) construct a structurally valid simulation model before proceeding with calibration or (4b) to validate the structure of existing simulation models. To demonstrate the feasibility of the method, we discuss an example implementation with mode of transport as behavior choice. We find that including non-frequently studied significant behavior determinants drastically improves the model's explanatory power in comparison to only including frequently studied variables. The paper serves as a proof-of-concept which can be reused, extended or adapted for various purposes."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "ab0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0130", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ls0010"}, "$$": [{"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0010", "view": "all"}, "_": "The structure of behavior models should be validated using existing evidence."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0020", "view": "all"}, "_": "Deep Learning can help automatize behavior evidence extraction and synthesis."}]}, {"#name": "list-item", "$": {"id": "li0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0030", "view": "all"}, "_": "Infrequently studied significant variables improve model performance drastically."}]}]}]}]}]}]}}