{"pii": "S0020748923000172", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "sp0040", "view": "all"}, "_": "Treatment for depression in people living with HIV has increasingly turned to non-pharmacological treatments due to the adverse reactions of pharmacotherapy. However, it remains unclear which non-pharmacological treatment is the most effective and acceptable for depression in people living with HIV."}]}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0015"}, "_": "Objective"}, {"#name": "simple-para", "$": {"id": "sp0045", "view": "all"}, "_": "To compare and rank the efficacy and acceptability of different non-pharmacological treatments for depression in people living with HIV."}]}, {"#name": "abstract-sec", "$": {"id": "as0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Design"}, {"#name": "simple-para", "$": {"id": "sp0050", "view": "all"}, "_": "A systematic review and Bayesian network meta-analysis."}]}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0025"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "sp0055", "view": "all"}, "$$": [{"#name": "__text__", "_": "We systematically searched PubMed, EMBASE, the Cochrane Central Register of Controlled Trials, PsycArticles, CINAHL, ProQuest, OpenGrey, and international trial registers for published and unpublished studies from their inception to September 1, 2022, and searched key conference proceedings from January 1, 2020, to September 25, 2022. We searched for randomized controlled trials of any non-pharmacological treatments for depression in adults living with HIV (≥"}, {"#name": "hsp", "$": {"sp": "0.10"}}, {"#name": "__text__", "_": "18 years old). Primary outcomes were efficacy (mean change scores in depression) and acceptability (all-cause discontinuation). We used a random-effects network meta-analysis model to synthesize all available evidence. The methodological quality of the included studies was assessed using the Cochrane Collaboration Risk of Bias Tool. We registered this study in PROSPERO, number CRD42021244230."}]}]}, {"#name": "abstract-sec", "$": {"id": "as0025", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0030"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "sp0060", "view": "all"}, "$$": [{"#name": "__text__", "_": "A total of 53 randomized controlled trials were included in this network meta-analysis involving seven non-pharmacological treatments for depression in people living with HIV. For efficacy, mind–body therapy, interpersonal psychotherapy, cognitive-behavioral therapy, supportive therapy, and education were significantly more effective than most control conditions (standardized mean differences ranged from −"}, {"#name": "hsp", "$": {"sp": "0.10"}}, {"#name": "__text__", "_": "0.96 to −"}, {"#name": "hsp", "$": {"sp": "0.10"}}, {"#name": "__text__", "_": "0.36). Rankings probabilities indicated that mind–body therapy (79%), interpersonal psychotherapy (71%), cognitive-behavioral therapy (62%), supportive therapy (57%), and education (57%) might be the top five most significantly effective treatments for depression in people living with HIV, in that order. For acceptability, only supportive therapy and interpersonal psychotherapy were significantly less acceptable than most control conditions (odds ratios ranged from 1.92 to 3.43). Rankings probabilities indicated that education might be the most acceptable treatment for people living with HIV (66%), while supportive therapy (26%) and interpersonal psychotherapy (10%) might rank the worst. The GRADE assessment results suggested that most results were rated as “moderate” to “very low” for the confidence of evidence."}]}]}, {"#name": "abstract-sec", "$": {"id": "as0030", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0035"}, "_": "Conclusions"}, {"#name": "simple-para", "$": {"id": "sp0065", "view": "all"}, "_": "Our study confirmed the efficacy and acceptability of several non-pharmacological treatments for depression in people living with HIV. These results should inform future guidelines and clinical decisions for depression treatment in people living with HIV."}]}]}]}}