{"pii": "S0022000011001139", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "aep-abstract-id5"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id6"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "The proliferation of blogs and social networks presents a new set of challenges and opportunities in the way information is searched and retrieved. Even though facts still play a very important role when information is sought on a topic, opinions have become increasingly important as well. Opinions expressed in blogs and social networks are playing an important role influencing everything from the products people buy to the presidential candidate they support. Thus, there is a need for a new type of search engine which will not only retrieve facts, but will also enable the retrieval of opinions. Such a search engine can be used in a number of diverse applications like product reviews to aggregating opinions on a political candidate or issue. Enterprises can also use such an engine to determine how users perceive their products and how they stand with respect to competition. This paper presents an algorithm which not only analyzes the overall sentiment of a document/review, but also identifies the semantic orientation of specific components of the review that lead to a particular sentiment. The algorithm is integrated in an opinion search engine which presents results to a query along with their overall tone and a summary of sentiments of the most important features."}]}]}, {"#name": "abstract", "$": {"class": "graphical", "id": "aep-abstract-id7"}, "$$": [{"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id8"}, "$$": [{"#name": "section-title", "_": "Highlights"}, {"#name": "simple-para", "$": {"id": "sp0020", "view": "all"}, "_": "► Search engine used to query reviews/opinions in social media or e-commerce sites. ► Algorithm mines semantic orientation of specific features and overall sentiment. ► Opinion search engine shows results, overall tone and sentiments of features. ► Algorithm accurately classifies a review as positive, negative, or neutral. ► Algorithm manages to identify successfully the most important features."}]}]}]}}