{"pii": "S0021925824001509", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Gum arabic (GA) is widely used as an emulsion stabilizer and edible coating and consists of a complex carbohydrate moiety with a rhamnosyl-glucuronate group capping the non-reducing ends. Enzymes that can specifically cleave the glycosidic chains of GA and modify their properties are valuable for structural analysis and industrial application. Cryogenic X-ray crystal structure of GA-specific "}, {"#name": "small-caps", "_": "L"}, {"#name": "__text__", "_": "-rhamnose-α-1,4-"}, {"#name": "small-caps", "_": "D"}, {"#name": "__text__", "_": "-glucuronate lyase from "}, {"#name": "italic", "_": "Fusarium oxysporum"}, {"#name": "__text__", "_": " (FoRham1), belonging to the polysaccharide lyase (PL) family 42, has been previously reported. To determine the specific reaction mechanism based on its hydrogen-containing enzyme structure, we performed joint X-ray/neutron crystallography of FoRham1. Large crystals were grown in the presence of "}, {"#name": "small-caps", "_": "L"}, {"#name": "__text__", "_": "-rhamnose (a reaction product), and neutron and X-ray diffraction datasets were collected at room temperature at 1.80 and 1.25 Å resolutions, respectively. The active site contained "}, {"#name": "small-caps", "_": "L"}, {"#name": "__text__", "_": "-rhamnose and acetate, the latter being a partial analog of glucuronate. Incomplete H/D exchange between Arg166 and acetate suggested that a strong salt-bridge interaction was maintained. Doubly deuterated His105 and deuterated Tyr150 supported the interaction between Arg166 and the acetate. The unique hydrogen-rich environment functions as a charge neutralizer for glucuronate and stabilizes the oxyanion intermediate. The NE2 atom of His85 was deprotonated and formed a hydrogen bond with the deuterated O1 hydroxy of "}, {"#name": "small-caps", "_": "L"}, {"#name": "__text__", "_": "-rhamnose, indicating the function of His85 as the base/acid catalyst for bond cleavage "}, {"#name": "italic", "_": "via"}, {"#name": "__text__", "_": " β-elimination. Asp83 functions as a pivot between the two catalytic histidine residues by bridging them. This His–His–Asp structural motif is conserved in the PL 24, 25, and 42 families."}]}]}]}]}}