{"pii": "S0021925820346421", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ceab10", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cestitle10"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara100", "view": "all"}, "_": "Single-molecule photobleaching has emerged as a powerful non-invasive approach to extract the stoichiometry of multimeric membrane proteins in their native cellular environment. However, this method has mainly been used to determine the subunit composition of ion channels and receptors at the plasma membrane. Here, we applied single-molecule photobleaching to analyze the oligomeric state of an endoplasmic reticulum (ER) resident candidate ceramide sensor protein, SMSr/SAMD8. Co-immunoprecipitation and chemical cross-linking studies previously revealed that the N-terminal sterile alpha motif (or SAM) domain of SMSr drives self-assembly of the protein into oligomers and that SMSr oligomerization is promoted by curcumin, a drug known to perturb ER ceramide and calcium homeostasis. Application of cell spreading surface-active coating materials in combination with total internal reflection fluorescence (TIRF) microscopy allowed us to image GFP-tagged SMSr proteins as single fluorescent spots in the ER of HeLa cells in which expression of endogenous SMSr was abolished. In line with our biochemical analysis, we find that the number of bleaching steps in SMSr-GFP-positive spots displays a substantial drop after removal of the SAM domain. In contrast, treatment of cells with curcumin increased the number of bleaching steps. Our results document the first successful application of single-molecule photobleaching to resolve drug-induced and domain-dependent changes in the oligomeric state of an ER-resident membrane protein, hence establishing a complementary method to unravel the mechanism by which SMSr controls ceramide levels in the ER."}]}]}]}}