{"pii": "S0021925823020999", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Paraspeckles (PS) are nuclear structures scaffolded by the long noncoding RNA NEAT1 and protein components such as NONO and SFPQ. We previously found that the upregulation of RNA N6-methyl-adenosine (m"}, {"#name": "sup", "$": {"loc": "post"}, "_": "6"}, {"#name": "__text__", "_": "A) demethylase ALKBH5 facilitates hypoxia-induced paraspeckle assembly through erasing m"}, {"#name": "sup", "$": {"loc": "post"}, "_": "6"}, {"#name": "__text__", "_": "A marks on NEAT1, thus stabilizing it. However, it remains unclear how these processes are spatiotemporally coordinated. Here we discover that ALKBH5 specifically binds to proteins in PS and forms phase-separated droplets that are incorporated into PS through its C-terminal intrinsically disordered region (cIDR). Upon exposure to hypoxia, rapid ALKBH5 condensation in PS induces m"}, {"#name": "sup", "$": {"loc": "post"}, "_": "6"}, {"#name": "__text__", "_": "A demethylation of NEAT1, which further facilitates PS formation before the upregulation of ALKBH5 expression. In cells expressing ALKBH5 lacking cIDR, PS fail to be formed in response to hypoxia, accompanied with insufficient m"}, {"#name": "sup", "$": {"loc": "post"}, "_": "6"}, {"#name": "__text__", "_": "A demethylation of NEAT1 and its destabilization. We also demonstrate that ALKBH5-cIDR is indispensable for hypoxia-induced effects such as cancer cell invasion. Therefore, our study has identified the role of ALKBH5 in phase separation as the molecular basis of the positive feedback loop for PS formation between ALKBH5 incorporation into PS and NEAT1 stabilization."}]}]}]}]}}