{"pii": "S0023683722003531", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "Abs1", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cestitle10"}, "_": "Abstract"}, {"#name": "simple-para", "$": {"id": "spara110", "view": "all"}, "_": "The assessment of programmed death 1 ligand 1 (PD-L1) expression by Immunohistochemistry (IHC) is the US Food and Drug Administration (FDA)-approved predictive marker to select responders to checkpoint blockade anti-PD-1/PD-L1 axis immunotherapies. Different PD-L1 immunohistochemistry (IHC) assays use different antibodies and different scoring methods in tumor cells and immune cells. Multiple studies have compared the performance of these assays with variable results. Here, we investigate an alternative method for assessment of PD-L1 using a new technology known as digital spatial profiling. We use a previously described standardization tissue microarray (TMA) to assess the accuracy of the method and compare digital spatial profiler (DSP) to each FDA-approved PD-L1 assays, one LDT assay and three quantitative fluorescence assays. The standardized cell line Index tissue microarray contains 10 isogenic cells lines in triplicates expressing various ranges of PD-L1. The dynamic range of PD-L1 digital counts was measured in the ten cell lines on the Index TMA using the GeoMx DSP assay and read on the nCounter platform. The digital method shows very high correlation with immunohistochemistry scored with quantitative software and with quantitative fluorescence. High correlation of PD-L1 digital DSP counts were seen between rows on the same Index TMA. Finally, experiments from two Index TMAs showed reproducibility of DSP counts were independent of variable slide storage time over a three-week period after antibody labeling but before collection of cleaved tags. In summary, DSP appears to have quantitative potential comparable to quantitative immunohistochemistry. It is possible that this technology could be used as a PD-L1 protein measurement system for companion diagnostic testing for immune therapy."}, {"#name": "simple-para", "$": {"id": "spara120", "view": "all"}, "_": "Digital spatial profiling is a new high-plex technology with potential to multiplex hundreds of proteins on a single slide. Here the authors validate the digital aspect of the technology on a control tissue microarray with known amounts of PD-L1 expression to show it has quantitative capacity comparable to quantitative immunofluorescence."}]}]}]}}