{"pii": "S0022169424001720", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Prediction of seasonal soil erosion using a storm-event 2D rainfall/runoff model."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Analysis of high-resolution DTMs of badland for periods of 4 months over two years."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Reliable prediction of erosion volumes using rainfall and runoff entrainment processes."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Further research is needed to accurately predict the spatial erosion patterns."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Badlands are often the source of a significant fraction of the sediment reaching the river network due to the exposure of the bare soil to the impact of rain drops and to the bed shear stress generated by the surface runoff. Hence, a correct understanding of the soil erosion and sediment transport processes inside badlands can help to a better characterisation of the suspended sediment production at the catchment scale. In this work we study the suitability of a two-dimensional (2D) physically-based event-scale erosion model as a tool to represent soil erosion and sediment transport in badlands at a seasonal scale. The model solves the 2D shallow water equations, including infiltration and rainfall, in order to compute the generation and routing of surface runoff within the badland. Coupled to the hydrodynamic equations, the model solves a 2D suspended sediment transport equation with source terms that account for rainfall- and runoff-driven erosion and sediment deposition. Based on this model, an overall procedure was developed and tested considering, as case study, a badland located in El Soto catchment (central Pyrenees, Iberian Peninsula). For the analysed badland, several high-resolution topography surveys were available, which allowed for the estimation of the soil loss and the spatial distribution of erosion patterns for periods of 3–4 months over two years. These data sets were used to calibrate and validate the proposed modelling approach, and to analyse its capabilities and limitations for the assessment of soil erosion at the seasonal scale."}]}]}]}}