{"pii": "S0021925822011693", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The characterization of protein–protein interactions (PPIs) is of high value for understanding protein function. Two strategies are popular for identification of PPIs direct from the cellular environment: affinity capture (pulldown) isolates the protein of interest with an immobilized matrix that specifically captures the target and potential partners, whereas in BioID, genetic fusion of biotin ligase facilitates proximity biotinylation, and labeled proteins are isolated with streptavidin. Whilst both methods provide valuable insights, they can reveal distinct PPIs, but the basis for these differences is less obvious. Here, we compare both methods using four different trypanosome proteins as baits: poly(A)-binding proteins PABP1 and PABP2, mRNA export receptor MEX67, and the nucleoporin NUP158. With BioID, we found that the population of candidate interacting proteins decreases with more confined bait protein localization, but the candidate population is less variable with affinity capture. BioID returned more likely false positives, in particular for proteins with less confined localization, and identified low molecular weight proteins less efficiently. Surprisingly, BioID for MEX67 identified exclusively proteins lining the inner channel of the nuclear pore complex (NPC), consistent with the function of MEX67, whereas the entire NPC was isolated by pulldown. Similarly, for NUP158, BioID returned surprisingly few PPIs within NPC outer rings that were by contrast detected with pulldown but instead returned a larger cohort of nuclear proteins. These rather significant differences highlight a clear issue with reliance on a single method to identify PPIs and suggest that BioID and affinity capture are complementary rather than alternative approaches."}]}]}]}}