{"pii": "S0021925820459538", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ceab10", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara170", "view": "all"}, "_": "NF-κB-controlled transcriptional regulation plays a central role in inflammatory and immune responses. Currently, understanding about NF-κB activation mechanism emphasizes IκB-tethered complex inactivation in the cytoplasm. In the case of NF-κB activation, IκB phosphorylation leads to its degradation, followed by NF-κB relocation to the nucleus and trans-activation of NF-κB-targeted genes. Pretranslational mechanism mediated NF-κB activation remains poorly understood. In this study, we investigated NF-κB pretranslational regulation by performing a series of database mining analyses and using six large national experimental databases (National Center of Biotechnology Information UniGene expressed sequence tag profile database, Gene Expression Omnibus database, Transcription Element Search System database, AceView database, and Epigenomics database) and TargetScan software. We reported the following findings: 1) NF-κB-signaling genes are differentially expressed in human and mouse tissues; 2) heart and vessels are the inflammation-privileged tissues and less easy to be inflamed because lacking in key NF-κB-signaling molecular expression; 3) NF-κB-signaling genes are induced by cardiovascular disease risk factors oxidized phospholipids and proinflammatory cytokines in endothelial cells; 4) transcription factors CCAAT/enhancer-binding proteins and NF-κB have higher binding site frequencies in the promoters of proinflammatory cytokine-induced NF-κB genes; 5) most NF-κB-signaling genes have multiple alternative promoters and alternatively spliced isoforms; 6) NF-κB family genes can be regulated by DNA methylation; and 7) 27 of 38 NF-κB-signaling genes can be regulated by microRNAs. Our findings provide important insight into the mechanism of NF-κB activation, which may contribute to cardiovascular disease, inflammatory diseases, and immunological disorders."}, {"#name": "simple-para", "$": {"id": "spara180", "view": "all"}, "$$": [{"#name": "bold", "_": "Background:"}, {"#name": "__text__", "_": " Thirty-eight NF-κB-signaling genes are analyzed for tissue expression profile and pretranscriptional mechanisms."}]}, {"#name": "simple-para", "$": {"id": "spara190", "view": "all"}, "$$": [{"#name": "bold", "_": "Results:"}, {"#name": "__text__", "_": " NF-κB-signaling genes are differentially expressed and can be regulated by specific transcription factors, multiple alternative promoters/spliced isoforms, DNA methylation, and microRNAs."}]}, {"#name": "simple-para", "$": {"id": "spara200", "view": "all"}, "$$": [{"#name": "bold", "_": "Conclusion:"}, {"#name": "__text__", "_": " Pretranslational regulatory mechanisms contribute to NF-κB activation and inflammatory diseases."}]}, {"#name": "simple-para", "$": {"id": "spara210", "view": "all"}, "$$": [{"#name": "bold", "_": "Significance:"}, {"#name": "__text__", "_": " Pretranslational regulatory mechanisms can be used as therapeutic targets."}]}]}]}]}}