{"pii": "S0021925819355346", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ceab10", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara130", "view": "all"}, "$$": [{"#name": "__text__", "_": "Regulation of the number of Ca"}, {"#name": "sup", "$": {"loc": "post"}, "_": "2+"}, {"#name": "__text__", "_": "-activated K"}, {"#name": "sup", "$": {"loc": "post"}, "_": "+"}, {"#name": "__text__", "_": " channels at the endothelial cell surface contributes to control of the endothelium-derived hyperpolarizing factor response, although this process is poorly understood. To address the fate of plasma membrane-localized KCa2.3, we utilized an extracellular epitope-tagged channel in combination with fluorescence and biotinylation techniques in both human embryonic kidney cells and the human microvascular endothelial cell line, HMEC-1. KCa2.3 was internalized from the plasma membrane and degraded with a time constant of 18 h. Cell surface biotinylation demonstrated that KCa2.3 was rapidly endocytosed and recycled back to the plasma membrane. Consistent with recycling, expression of a dominant negative (DN) RME-1 or Rab35 as well as wild type EPI64C, the Rab35 GTPase-activating protein, resulted in accumulation of KCa2.3 in an intracellular compartment. Expression of DN RME-1, DN Rab35, or wild type EPI64C resulted in a decrease in steady-state plasma membrane expression. Knockdown of EPI64C increased cell surface expression of KCa2.3. Furthermore, the effect of EPI64C was dependent upon its GTPase-activating proteins activity. Co-immunoprecipitation studies confirmed an association between KCa2.3 and both Rab35 and RME-1. In contrast to KCa2.3, KCa3.1 was rapidly endocytosed and degraded in an RME-1 and Rab35-independent manner. A series of N-terminal deletions identified a 12-amino acid region, Gly"}, {"#name": "sup", "$": {"loc": "post"}, "_": "206"}, {"#name": "__text__", "_": "–Pro"}, {"#name": "sup", "$": {"loc": "post"}, "_": "217"}, {"#name": "__text__", "_": ", as being required for the rapid recycling of KCa2.3. Deletion of Gly"}, {"#name": "sup", "$": {"loc": "post"}, "_": "206"}, {"#name": "__text__", "_": "–Pro"}, {"#name": "sup", "$": {"loc": "post"}, "_": "217"}, {"#name": "__text__", "_": " had no effect on the association of KCa2.3 with Rab35 but significantly decreased the association with RME-1. These represent the first studies elucidating the mechanisms by which KCa2.3 is maintained at the plasma membrane."}]}]}]}]}}