{"pii": "S002192582302389X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "In recent years, elegant glycomic and glycoproteomic approaches have revealed an intricate glycosylation profile of mammalian brain with enormous spatial and temporal diversities. Nevertheless, at a cellular level, it is unclear how these post-translational modifications affect various proteins to influence crucial neuronal properties. Here, we have investigated the impact of N-linked glycosylation on neuroligins (NLGNs), a class of cell-adhesion molecules that play instructive roles in synapse organization. We found that endogenous NLGN proteins are differentially glycosylated across several regions of murine brain in a sex-independent but isoform-dependent manner. In both rodent primary neurons derived from brain sections and human neurons differentiated from stem cells, all NLGN variants were highly enriched with multiple N-glycan subtypes, which cumulatively ensured their efficient trafficking to the cell surface. Removal of these N-glycosylation residues only had a moderate effect on NLGNs’ stability or expression levels but particularly enhanced their retention at the endoplasmic reticulum. As a result, the glycosylation-deficient NLGNs exhibited considerable impairments in their dendritic distribution and postsynaptic accumulation, which in turn, virtually eliminated their ability to recruit presynaptic terminals and significantly reduced NLGN overexpression–induced assemblies of both glutamatergic and GABAergic synapse structures. Therefore, our results highlight an essential mechanistic contribution of N-linked glycosylations in facilitating the appropriate secretory transport of a major synaptic cell-adhesion molecule and promoting its cellular function in neurons."}]}]}]}}