{"pii": "S0029801824030257", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "This study proposes a novel and feasible framework for assessing maritime traffic complexity, utilising historical Automatic Identification System data to extract dynamic traffic characteristics of sea waters and quantify the corresponding maritime traffic complexity. The processed historical statistics are initially segmented into subsets according to different geographic traffic cells based on traffic zones. Subsequently, a Radial Basis Function regression model with a Gaussian kernel is employed to extract dynamic traffic parameters at the central coordinates of each geographic traffic zone based on subsets. The dynamic parameters derived from nonlinear regression and complexity sub-models are ultimately applied in maritime traffic complexity identification. The effectiveness of the proposed framework is validated through complexity assessments in selected areas of Malacca Strait. Empirical results are significant for maritime shipping research on data-driven traffic complexity monitoring and digitalised decision support."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "A novel method to assess maritime traffic complexity, utilising historical AIS data is proposed."}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "The processed historical statistics are initially segmented into geographic traffic cells."}, {"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "A Radial Basis Function regression model with a Gaussian kernel are employed to extract dynamic traffic parameters."}, {"#name": "simple-para", "$": {"id": "abspara0030", "view": "all"}, "_": "The dynamic parameters are derived from nonlinear regression and complexity sub-models."}, {"#name": "simple-para", "$": {"id": "abspara0035", "view": "all"}, "_": "The effectiveness of the proposed framework is validated through complexity assessments in selected areas of Malacca Strait."}]}]}]}}