{"pii": "S0021925820471790", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ceab10", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara80", "view": "all"}, "$$": [{"#name": "__text__", "_": "The voltage-gated sodium channel (Na"}, {"#name": "inf", "$": {"loc": "post"}, "_": "v"}, {"#name": "__text__", "_": ") 1.8 contributes substantially to the rising phase of action potential in small dorsal root ganglion neurons. Na"}, {"#name": "inf", "$": {"loc": "post"}, "_": "v"}, {"#name": "__text__", "_": "1.8 is majorly localized intracellularly and its expression on the plasma membrane is regulated by exit from the endoplasmic reticulum (ER). Previous work has identified an ER-retention/retrieval motif in the first intracellular loop of Na"}, {"#name": "inf", "$": {"loc": "post"}, "_": "v"}, {"#name": "__text__", "_": "1.8, which prevents its surface expression. Here we report that the transmembrane segments of Na"}, {"#name": "inf", "$": {"loc": "post"}, "_": "v"}, {"#name": "__text__", "_": "1.8 also cause this channel retained in the ER. Using transferrin receptor and CD8α as model molecules, immunocytochemistry showed that the first, second, and third transmembrane segments in each domain of Na"}, {"#name": "inf", "$": {"loc": "post"}, "_": "v"}, {"#name": "__text__", "_": "1.8 reduced their surface expression. Alanine-scanning analysis revealed acidic amino acids as critical factors in the odd transmembrane segments. Furthermore, co-immunoprecipitation experiments showed that calnexin interacted with acidic amino acid-containing sequences through its transmembrane segment. Overexpression of calnexin resulted in increased degradation of those proteins through the ER-associated degradation pathway, whereas down-regulation of calnexin reversed the phenotype. Thus our results reveal a critical role and mechanism of transmembrane segments in surface expression and degradation of Na"}, {"#name": "inf", "$": {"loc": "post"}, "_": "v"}, {"#name": "__text__", "_": "1.8."}]}]}]}]}}