{"pii": "S0022000003000436", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "aep-abstract-id5"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id6"}, "$$": [{"#name": "simple-para", "$": {"view": "all"}, "$$": [{"#name": "__text__", "_": "This paper studies the multicast routing and admission control problem on unit-capacity tree and mesh topologies in the throughput model. The problem is a generalization of the edge-disjoint paths problem and is "}, {"#name": "italic", "_": "NP-hard"}, {"#name": "__text__", "_": " both on trees and meshes. We study both the offline and the online version of the problem: In the offline setting, we give the first constant-factor approximation algorithm for trees, and an "}, {"#name": "math", "$": {"xmlns": true, "altimg": "si1.gif"}, "$$": [{"#name": "__text__", "_": "O(("}, {"#name": "rm", "$$": [{"#name": "__text__", "_": "log"}, {"#name": "hsp", "$": {"xmlns": true, "sp": "0.16"}}, {"#name": "__text__", "_": "log"}]}, {"#name": "hsp", "$": {"xmlns": true, "sp": "0.16"}}, {"#name": "__text__", "_": "n)"}, {"#name": "sup", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": ")"}]}, {"#name": "__text__", "_": "-factor approximation algorithm for meshes. In the online setting, we give the first polylogarithmic competitive online algorithm for tree and mesh topologies. No polylogarithmic-competitive algorithm is possible on general network topologies (Lower bounds for on-line graph problems with application to on-line circuits and optical routing, in: Proceedings of the 28th ACM Symposium on Theory of Computing, 1996, pp. 531–540) and there exists a polylogarithmic lower bound on the competitive ratio of any online algorithm on tree topologies (Making commitments in the face of uncertainity: how to pick a winner almost every time, in: Proceedings of the 28th Annual ACM Symposium on Theory of Computing, 1996, pp. 519–530). We prove the same lower bound for meshes."}]}]}]}]}}