{"pii": "S0021925823022706", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Cystic fibrosis (CF) is one of the most prevalent lethal genetic diseases with over 2000 identified mutations in the cystic fibrosis transmembrane conductance regulator (CFTR) gene. Pharmacological chaperones such as lumacaftor (VX-809), tezacaftor (VX-661), and elexacaftor (VX-445) treat mutation-induced defects by stabilizing CFTR and are called correctors. These correctors improve proper folding and thus facilitate processing and trafficking to increase the amount of functional CFTR on the cell surface. Yet, CFTR variants display differential responses to each corrector. Here, we report that variants P67L and L206W respond similarly to VX-809 but divergently to VX-445 with P67L exhibiting little rescue when treated with VX-445. We investigate the underlying cellular mechanisms of how CFTR biogenesis is altered by correctors in these variants. Affinity purification-mass spectrometry multiplexed with isobaric tandem mass tags was used to quantify CFTR protein–protein interaction changes between variants P67L and L206W. VX-445 facilitates unique proteostasis factor interactions especially in translation, folding, and degradation pathways in a CFTR variant–dependent manner. A number of these interacting proteins knocked down by siRNA, such as ribosomal subunit proteins, moderately rescued fully glycosylated P67L. Importantly, these knockdowns sensitize P67L to VX-445 and further enhance the trafficking correction of this variant. Partial inhibition of protein translation also mildly sensitizes P67L CFTR to VX-445 correction, supporting a role for translational dynamics in the rescue mechanism of VX-445. Our results provide a better understanding of VX-445 biological mechanism of action and reveal cellular targets that may sensitize nonresponsive CFTR variants to known and available correctors."}]}]}]}}