{"pii": "S0028393220301627", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "abs0010", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Newly encoded memories are stabilized over time through a process or a set of processes termed consolidation, which happens preferentially during sleep. However, not all memories profit equally from this offline stabilization. Previous research suggested that one factor, which determines whether a memory will benefit from sleep consolidation, is future relevance. The aim of our current study was to replicate these findings and expand them to investigate their neural underpinnings."}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "In our experiment, 38 participants learned two sets of object-location associations. The two sets of stimuli were presented to each participant intermixed and in random order. After study, participants performed a baseline retention test and were thereafter instructed that, after a delay containing sleep, they would be tested and rewarded only on one of the two sets of stimuli. This relevance instruction was revoked, however, immediately before the test. Thus, this manipulation affected memory consolidation while having no influence on encoding and retrieval. This retention interval was monitored via actigraphy recordings."}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "While the study session was purely behavioral, the test session was conducted in an MRI scanner, thus we collected neuroimaging data at retrieval of relevant compared with non-relevant items."}, {"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "Behaviorally, we found no effect of the relevance manipulation on memory retention, confidence rating, or reaction time. At a neural level, no effect of relevance on memory retrieval-related brain operations was observed. Contrary to our expectations, the relevance manipulation did not result in improved consolidation, nor in improved subsequent performance at retrieval. These findings challenge previously published results and suggest that future relevance as manipulated here may not be sufficient to produce enhanced memory consolidation."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "abs0015", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0030", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Relevance instructions did not influence memory retention."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Relevance instructions did not influence confidence for items."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "FMRI at retrieval revealed no neural effect of relevance on memory consolidation."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Neural activity at retrieval scaled with memory confidence."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "Confidence elevated activity in hippocampal, cingulate, and angular regions."}]}]}]}]}]}]}}