{"pii": "S0021925823001734", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "The U2AF Homology Motif Kinase 1 (UHMK1) is the only kinase that contains the U2AF homology motif, a common protein interaction domain among splicing factors. Through this motif, UHMK1 interacts with the splicing factors SF1 and SF3B1, known to participate in the 3′ splice site recognition during the early steps of spliceosome assembly. Although UHMK1 phosphorylates these splicing factors "}, {"#name": "italic", "_": "in vitro"}, {"#name": "__text__", "_": ", the involvement of UHMK1 in RNA processing has not previously been demonstrated. Here, we identify novel putative substrates of this kinase and evaluate UHMK1 contribution to overall gene expression and splicing, by integrating global phosphoproteomics, RNA-seq, and bioinformatics approaches. Upon UHMK1 modulation, 163 unique phosphosites were differentially phosphorylated in 117 proteins, of which 106 are novel potential substrates of this kinase. Gene Ontology analysis showed enrichment of terms previously associated with UHMK1 function, such as mRNA splicing, cell cycle, cell division, and microtubule organization. The majority of the annotated RNA-related proteins are components of the spliceosome but are also involved in several steps of gene expression. Comprehensive analysis of splicing showed that UHMK1 affected over 270 alternative splicing events. Moreover, splicing reporter assay further supported UHMK1 function on splicing. Overall, RNA-seq data demonstrated that UHMK1 knockdown had a minor impact on transcript expression and pointed to UHMK1 function in epithelial-mesenchymal transition. Functional assays demonstrated that UHMK1 modulation affects proliferation, colony formation, and migration. Taken together, our data implicate UHMK1 as a splicing regulatory kinase, connecting protein regulation through phosphorylation and gene expression in key cellular processes."}]}]}]}]}}