{"pii": "S0021925822010158", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "The REGγ-20S proteasome is an ubiquitin- and ATP-independent degradation system, targeting selective substrates, possibly helping to regulate aging. The studies we report here demonstrate that aging-associated REGγ decline predisposes to decreasing tau turnover, as in a tauopathy. The REGγ proteasome promotes degradation of human and mouse tau, notably phosphorylated tau and toxic tau oligomers that shuttle between the cytoplasm and nuclei. REGγ-mediated proteasomal degradation of tau was validated in 3- to 12-month-old "}, {"#name": "italic", "_": "REGγ"}, {"#name": "__text__", "_": " KO mice, "}, {"#name": "italic", "_": "REGγ"}, {"#name": "__text__", "_": " KO;PS19 mice, and PS19 mice with forebrain conditional neuron-specific overexpression of REGγ ("}, {"#name": "italic", "_": "REGγ"}, {"#name": "__text__", "_": " OE) and behavioral abnormalities. Coupled with tau accumulation, we found with REGγ-deficiency, neuron loss, dendrite reduction, tau filament accumulation, and microglial activation are much more prominent in the "}, {"#name": "italic", "_": "REGγ"}, {"#name": "__text__", "_": " KO;PS19 than the PS19 model. Moreover, we observed that the degenerative neuronal lesions and aberrant behaviors were alleviated in "}, {"#name": "italic", "_": "REGγ"}, {"#name": "__text__", "_": " OE;PS19 mice. Memory and other behavior analysis substantiate the role of REGγ in prevention of tauopathy-like symptoms. In addition, we investigated the potential mechanism underlying aging-related REGγ decline. This study provides valuable insights into the novel regulatory mechanisms and potential therapeutic targets for tau-related neurodegenerative diseases."}]}]}]}]}}