{"pii": "S0021925823018574", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Hypoxia-inducible factor-1 (HIF-1) is a critical transcription factor that regulates the expression of genes involved in cellular adaptation to low oxygen levels. Aberrant regulation of the HIF-1 signaling pathway is linked to various human diseases. Previous studies have established that HIF-1α is rapidly degraded in a von Hippel-Lindau protein (pVHL)-dependent manner under normoxic conditions. In this study, we find that pVHL binding protein 1 (VBP1) is a negative regulator of HIF-1α but not HIF-2α using zebrafish as an "}, {"#name": "italic", "_": "in vivo"}, {"#name": "__text__", "_": " model and "}, {"#name": "italic", "_": "in vitro"}, {"#name": "__text__", "_": " cell culture models. Deletion of "}, {"#name": "italic", "_": "vbp1"}, {"#name": "__text__", "_": " in zebrafish caused Hif-1α accumulation and upregulation of Hif target genes. Moreover, "}, {"#name": "italic", "_": "vbp1"}, {"#name": "__text__", "_": " was involved in the induction of hematopoietic stem cells (HSCs) under hypoxic conditions. However, VBP1 interacted with and promoted the degradation of HIF-1α in a pVHL-independent manner. Mechanistically, we identify the ubiquitin ligase CHIP and HSP70 as new VBP1 binding partners and demonstrate that VBP1 negatively regulated CHIP and facilitated CHIP-mediated degradation of HIF-1α. In patients with clear cell renal cell carcinoma (ccRCC), lower VBP1 expression was associated with worse survival outcomes. In conclusion, our results link VBP1 with CHIP stability and provide insights into underlying molecular mechanisms of HIF-1α-driven pathological processes."}]}]}]}]}}