{"pii": "S0022169422012628", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0100", "view": "all"}, "_": "The random walk path method (RWP) is a stochastic model that transforms the solution of the unsteady open channel flow equations into a probability problem. In this paper, this method is introduced to solve the discretized Saint-Venant equations, with probabilistic representation of the water levels at junctions. Different boundary conditions, which specify either water levels or discharge hydrographs, can be implemented by specifying how walkers react when arriving at the boundaries. The pointwise solution at river junctions can be obtained via random walk simulations. The efficacy of the model was verified against the following test cases: (1) a real-world looped channel example documented in the manual of the software Hec-Ras and (2) a hypothetical channel system consisting of dendritic and divergent networks. The number of random simulations is an important aspect of the RWP method and needs to be chosen by considering the trade-off between precision and computational efficiency. The impact of the boundary water level or discharge on the water levels at internal nodes can be quantitatively evaluated by adopting the terminal weights, which present a distinct advantage of the RWP method. This assessment of water levels can serve as a guide in the operation of hydraulic controls, such as dams, sluices and pumps, to effectively regulate the flow in mitigating flood risks."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0105", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "A random walk path method is proposed to model unsteady flow in river networks."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Various boundary conditions, water-level and discharge conditions, are considered."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The impact of the boundary on the water levels at internal nodes can be evaluated."}]}]}]}]}]}]}}