{"pii": "S0031320324000542", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1942", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1943"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1945", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1946", "view": "all"}, "_": "The analysis of temporal data has gained increasing attention in recent years, aiming to identify patterns and trends that change over time. Temporal triclustering is a promising approach for this purpose, as it allows for the simultaneous clustering of three dimensions of data: objects, attributes, and time. In this work, we present a comparative study and experimental evaluation of state-of-the-art temporal triclustering algorithms. Our study provides a comprehensive quantitative assessment of several triclustering algorithms to unravel their strengths and limitations. To this end, we consider synthetic data with varying sizes and regularities, where true solutions are planted with different coherence and quality criteria, in order to assess the algorithms’ performance in datasets with diverse characteristics and assess their capacity to retrieve specific types of hidden patterns. This provides a more comprehensive evaluation of the algorithms and allows for a better understanding of their capabilities and limitations. This study is the first to compare state-of-the-art triclustering algorithms inherently prepared to deal with temporal data and provides new benchmark results for the Temporal Triclustering task. Our results on the algorithms’ performance can guide practitioners in selecting the most appropriate algorithm for their specific application."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1948", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1949"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1951", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1952", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1954"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1955"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1958", "view": "all"}, "_": "Comparison of state-of-the-art temporal triclustering algorithms."}]}, {"#name": "list-item", "$": {"id": "d1e1960"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1963", "view": "all"}, "_": "Evaluation of algorithms using synthetic datasets with hidden true solutions."}]}, {"#name": "list-item", "$": {"id": "d1e1965"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1968", "view": "all"}, "_": "A comprehensive explanation of the algorithms’ capabilities and limitations."}]}, {"#name": "list-item", "$": {"id": "d1e1970"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1973", "view": "all"}, "_": "Benchmark results to guide the choice of best-suited algorithm for a specific problem."}]}]}]}]}]}]}}