{"pii": "S0040162522005911", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0035", "view": "all"}, "_": "Digitalization and automation play essential roles in how companies create value for their customers in emerging industries, including autonomous vehicle solutions (AVSs) and automated driving. In this study, we explore digital servitization business models in the context of AVS ecosystems. We utilize publicly available company data to discuss cases that illustrate the emerging business models of AVSs in the business-to-business (B2B) context. We contribute to research on autonomous solutions by identifying four types of AVSs: (i) advanced-data-assisted solutions, (ii) semiautonomous platooning solutions, (iii) autonomous demarcated solutions, and (iv) autonomous swarmed solutions. We advance digital servitization and business model research by revealing business models associated with those AVSs, namely: (i) safety as a service, (ii) efficiency as a service, (iii) capacity as a service, and (iv) flexibility as a service. By combining these three fields of research, we enrich the digital servitization research and address the current gap in research on autonomous solutions by focusing on business models. Our analysis enables the development of novel conceptual tools for autonomous solutions and servitization driven by digitalization. Moreover, we suggest the concept of business model fluidity to explain rapid and autonomous business model changes and adaptation to different use contexts and customer contexts."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0040", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "This study explores four digital servitization business models in the context of AVSs."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Such archetypes advance AVSs in B2B context."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Digital servitization business models contribute servitization literature."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The study introduces a fluidity in digital servitization business models."}]}]}]}]}]}]}}