{"pii": "S0040162524002518", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0235", "view": "all"}, "_": "This study explores the potential for developing web-based environmental culture indicators by analyzing signals extracted from the homepages of company websites. The primary aim is to assess the proposed method's ability to generate indicators that can serve as proxies for real environmental measures by leveraging the homepage content. We performed a Zero-Shot Text Classification (ZSTC) using a BERT-type Natural Language Processing (NLP) model, followed by a regression analysis to test the ability of these web-based indicators to replicate the B-Lab environmental index and comprehend the dynamics behind the results. This pilot study explains 57 % of the variance of the B-Lab environmental index using the results of the ZSTC score and companies' characteristics. This research makes two significant contributions. First, the text content of a company's homepage seems to provide insights into its environmental performance. Second, it introduces a generalizable methodology for studying the performance of companies through their websites without the need for heavy pre-processing, significantly reducing the time and cost of research. Furthermore, the method could provide policymakers with a real-time landscape to create and finetune policies about specific topics, partially addressing the problems associated with questionnaire-based surveys."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0240", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0020"}, "$$": [{"#name": "list-item", "$": {"id": "li0160"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0160", "view": "all"}, "_": "Web-based sustainable innovation indicators are promising proxies for environmental performance measures."}]}, {"#name": "list-item", "$": {"id": "li0165"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0165", "view": "all"}, "_": "The Zero-Shot Text Classification method for companies environemntal performance via websites is impactful."}]}, {"#name": "list-item", "$": {"id": "li0170"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0170", "view": "all"}, "_": "Company's homepage content provides insights into environmental performances, contributing to Signal Theory literature."}]}, {"#name": "list-item", "$": {"id": "li0175"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0175", "view": "all"}, "_": "Geographical location(Canada or the US), does not affect how companies address environmental issues."}]}, {"#name": "list-item", "$": {"id": "li0180"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0180", "view": "all"}, "_": "Industry category moderately affects the relationship between web-based environmental indicators and the B-Lab index."}]}]}]}]}]}]}}