{"pii": "S0085253815509381", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0170", "view": "all"}, "_": "Podocyte involvement in human immune crescentic glomerulonephritis."}]}, {"#name": "abstract-sec", "$": {"id": "as0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "sp0175", "view": "all"}, "_": "The role of podocytes in human crescentic glomerulonephritis (GN) has been underestimated. This may be due to the confounding fact that “dysregulated” podocytes are able to proliferate, lose their markers, and acquire new epitopes. Moreover, in experimental anti glomerular basement membrane (GBM) crescentic GN, podocytes participate in the crescent formation. The aim of this study was to investigate the involvement of podocytes in human immune crescentic GN."}]}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0015"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "sp0180", "view": "all"}, "$$": [{"#name": "__text__", "_": "Renal biopsies from 12 patients with anti GBM disease and 14 with class IV lupus GN were studied by immunohistochemistry for the following markers: ("}, {"#name": "italic", "_": "1"}, {"#name": "__text__", "_": ") synaptopodin, GLEPP1, podocalyxin, podocin, α actinin 4, and vimentin for podocyte identification; ("}, {"#name": "italic", "_": "2"}, {"#name": "__text__", "_": ") PCNA, Ki 67, and p57 for cell cycle assessment; ("}, {"#name": "italic", "_": "3"}, {"#name": "__text__", "_": ") cytokeratins for identifying epithelial cells but not normal podocytes; ("}, {"#name": "italic", "_": "4"}, {"#name": "__text__", "_": ") CD68 for tagging a macrophagic epitope; ("}, {"#name": "italic", "_": "5"}, {"#name": "__text__", "_": ") alpha smooth muscle actin (α SMA), a phenotypic marker of myofibroblasts."}]}]}, {"#name": "abstract-sec", "$": {"id": "as0025", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "sp0185", "view": "all"}, "_": "“True” (capsular) crescents lining Bowman's capsule and (tuft) “pseudocrescents” covering the glomerular tuft with a persistent patent urinary space were present in the 2 types of crescentic GN in similar percentages. Several features indicated that podocytes were involved in the formation of the both crescent types. Identifiable podocytes expressed proliferation markers. Podocyte cytoplasmic expansions and racket like podocytes bridged between the tuft and Bowman's capsule. True and pseudocrescents contained labeled podocytes. In addition, podocytes located outside of the crescents had often lost their markers (dedifferentiation) and acquired new epitopes (cytokeratins and CD68)."}]}, {"#name": "abstract-sec", "$": {"id": "as0030", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0025"}, "_": "Conclusion"}, {"#name": "simple-para", "$": {"id": "sp0190", "view": "all"}, "_": "In human immune crescentic GN, podocytes undergo proliferation and dysregulation that are indicative of a podocytopathy. Podocytes contribute to crescent formation."}]}]}]}}