{"pii": "S0098300422001297", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1235", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1236"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1238", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1239", "view": "all"}, "_": "The stratospheric polar vortex is a cyclonic circulation that forms over the winter pole, whose edge is characterized by a strong westerly jet (also called polar night jet, PNJ). The PNJ plays a key role in processes such as the distribution of atmospheric constituents in the polar stratosphere or the wave propagation. Further, variations in PNJ can also affect the troposphere, being behind the occurrence of extreme events near the Earth’s surface. Thus, it is important to correctly characterize the mean state of the PNJ and its variability. Already existing algorithms, although working, may present several issues. The simplest ones, those based on zonal mean wind, can miss important information. In contrast, the 2-dimensional ones usually involve multiple calculations with several fields, some of them not always included in typical datasets."}, {"#name": "simple-para", "$": {"id": "d1e1241", "view": "all"}, "_": "In this study, we describe a new artificial intelligence technique to characterize the PNJ. The algorithm only requires data of zonal wind that is classified each time step with a decision trees algorithm with 95.5% accuracy, trained with images processed by a climate science researcher. The classifier is applied to JRA-55 reanalysis data and the output of simulations of three climate models and is found to perform reasonably well when validated against traditional zonal-mean methods. Indeed, it provides more information about the PNJ, as it offers in one step the PNJ region, averaged magnitudes and even identify if the PNJ is under perturbed conditions. We have explored two examples of potential applications of the classifier such as the study of the influence of climate change on the PNJ and the variability of the PNJ on monthly and daily scales. In both cases, our algorithm has produced coherent results with those produced with previous studies, but with more detail obtained at a single step."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1243", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1244"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1246", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1247", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1249"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1250"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1253", "view": "all"}, "_": "Artificial intelligence is applied to characterize stratospheric polar night jet (PNJ)."}]}, {"#name": "list-item", "$": {"id": "d1e1255"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1258", "view": "all"}, "_": "We use a novel semi-automatic semi-manual training process of region growing labeling."}]}, {"#name": "list-item", "$": {"id": "d1e1260"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1263", "view": "all"}, "_": "The algorithm involves a new classifier for stratospheric zonal wind images."}]}, {"#name": "list-item", "$": {"id": "d1e1265"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1268", "view": "all"}, "_": "Improvement of existing methods with precise location or intensity of PNJ."}]}, {"#name": "list-item", "$": {"id": "d1e1270"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1273", "view": "all"}, "_": "New method automatically identifies and classifies extreme weak PNJ events."}]}]}]}]}]}]}}