{"pii": "S0092867420301069", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "abs0010", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Despite advances in genetic and proteomic techniques, a complete portrait of the proteome and its complement of dynamic interactions and modifications remains a lofty, and as of yet, unrealized, objective. Specifically, traditional biological and analytical approaches have not been able to address key questions relating to the interactions of proteins with small molecules, including drugs, drug candidates, metabolites, or protein post-translational modifications (PTMs). Fortunately, chemists have bridged this experimental gap through the creation of bioorthogonal reactions. These reactions allow for the incorporation of chemical groups with highly selective reactivity into small molecules or protein modifications without perturbing their biological function, enabling the selective installation of an analysis tag for downstream investigations. The introduction of chemical strategies to parse and enrich subsets of the “functional” proteome has empowered mass spectrometry (MS)-based methods to delve more deeply and precisely into the biochemical state of cells and its perturbations by small molecules. In this Primer, we discuss how one of the most versatile bioorthogonal reactions, “click chemistry”, has been exploited to overcome limitations of biological approaches to enable the selective marking and functional investigation of critical protein-small-molecule interactions and PTMs in native biological environments."}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0015", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "In this Primer, Pratt & Parker overview the biological applications of “click chemistry,” a class of small-molecule reactions that can efficiently conjugate substrates to specific biomolecules. Focusing on proteomic investigations, they provide insight into the biological questions where it may be most useful, including studies of post-translational modifications and protein-protein, protein-drug, and protein-metabolite interactions."}]}]}]}}