{"pii": "S014036642200264X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e923"}, "$$": [{"#name": "section-title", "$": {"id": "d1e924"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e926"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e927"}, "_": "Wireless networking is expected to sustain the direct interaction between personal users’ devices, and to provide connectivity on large-scale resource-constrained devices. However, conventional networking protocols fail in large scale mobile wireless environments, due to node mobility, dynamic topologies, and intermittent connectivity. Information-Centric Networking (ICN) has been considered the most promising candidate to overcome the drawbacks of host-centric architectures where Named Data Networking (NDN) is one of the well-known and studied architectures within the ICN paradigm."}, {"#name": "simple-para", "$": {"view": "all", "id": "d1e929"}, "_": "The main objective of this work is to improve both content availability and network performance in mobile environments regarding the ICN paradigm. This is provided through a context-based approach for the caching admission policy providing in-network caching and content replication, facilitating the efficient and timely delivery of information. Content popularity, freshness, proximity, source mobility type and network density are some of the metrics considered in the caching decision. We conducted a comparative study between our proposal and the NDN caching strategy by using two different datasets with real mobility and connectivity traces, addressing intermittent communication. According to our results, we observed that using a multi-criteria context-based cache admission policy improves cache hits, cache evictions, and request satisfaction ratios in mobile environments, thus improving content delivery and network efficiency."}]}]}]}}