{"pii": "S0142061523007585", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "A multistage reliability-constrained stochastic planning model is established for the diamond distribution network(DDN)."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "The Markov decision process is used to model the multistage stochastic dynamic decision process."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "An approximate dynamic programming(ADP) algorithm is used to solve the model."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "In this paper, a multistage reliability-constrained stochastic planning model is established for the diamond distribution network, a new type of distribution system grid structure, with the goal of optimizing the total cost of investment and operation. The uncertainty of load growth is simulated by generating multiple load growth scenarios, and the power supply loss caused by the reliability of components in the system is also considered. The multistage stochastic dynamic decision process is modeled by The Markov decision process. In order to solve the “curse of dimensionality” problem in multi-stage stochastic planning model, the approximate dynamic programming algorithm is used to solve it. The case study is based on the typical structure of the diamond distribution network and realistic data of an actual district in Shanghai, China. The planning results verify the effectiveness of the model and the solution algorithm, and demonstrate the reliability and economy of the diamond distribution network are superior to the traditional double-ring network."}]}]}]}}