{"pii": "S014296122200103X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Micropatterned suspension culture creates consistently sized and shaped cell aggregates but has not produced organotypic structures from stable cells, thus restricting its use in accurate disease modeling. Here, we show that organotypic structure is achieved in hybrid suspension culture via supplementation of soluble extracellular matrix (ECM). We created a viable lung organoid from epithelial, endothelial, and fibroblast human stable cell lines in suspension culture. We demonstrate the importance of soluble ECM in organotypic patterning with the emergence of lumen-like structures with airspace showing feasible gas exchange units, formation of branching, perfusable vasculature, and long-term 70-day maintenance of lumen structure. Our results show a dependent relationship between enhanced fibronectin fibril assembly and the incorporation of ECM in the organoid. We successfully applied this technology in modeling lung fibrosis via bleomycin induction and test a potential antifibrotic drug "}, {"#name": "italic", "_": "in vitro"}, {"#name": "__text__", "_": " while maintaining fundamental cell-cell interactions in lung tissue. Our human fluorescent lung organoid (hFLO) model represents features of pulmonary fibrosis which were ameliorated by fasudil treatment. We also demonstrate a 3D culture method with potential of creating organoids from mature cells, thus opening avenues for disease modeling and regenerative medicine, enhancing understanding of lung cell biology in health and lung disease."}]}]}]}]}}