{"pii": "S014036642400327X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e2073", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e2074"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e2076", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e2077", "view": "all"}, "_": "The wide availability of the Wi-Fi infrastructure together with the recent integration of the IEEE 802.11mc capability in common-off-the-shelf (COTS) devices, have contributed to increasing the interest of the research community in the fine time measurement (FTM) technique, which allows two Wi-Fi devices to estimate distances between each other. However, one of the main issues yet to be solved is how it scales with an increasing number of Wi-Fi devices injecting location-specific traffic in the shared medium. While the recently released IEEE 802.11az standard will still take time before being integrated in COTS devices, this paper aims at assessing the impact of the burst size on the ranging performance of COTS Wi-Fi Android devices running release 12. While increasing the burst size is expected to bring higher stability in the observed distance, on the other hand a longer transmission period for location-only purposes may jeopardize the transmission of data traffic among Wi-Fi users. Several models of smartphones and APs, and different frequency bands, have been considered in order to evaluate the behavior of the FTM procedure in real devices, showing that not always the newest or most expensive ones perform better. Also, it is shown that using the minimum burst size significantly decreases the performance and it is thus not recommended. While bursts longer than 8 may no be always supported by all the models and/or frequency bands, the small improvements in ranging estimations obtained when they are used do not always justify the increased location traffic injected in the network."}]}]}]}}