{"pii": "S0140366423002694", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e366", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e367"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e369", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e370", "view": "all"}, "_": "We discuss how resilient satellite constellation networks are against attacks. Two types of robustness are focused in this paper. One is the topology-related network robustness, which mainly assesses the effect of attacks or faults on satellites and links. The other is the network function robustness related to routing mechanisms, which mainly assesses how resource allocation mechanisms affect network robustness. To this purpose, two satellite constellation network models based on physical network topology and traffic are proposed, along with a new satellite importance index and the robustness metrics. Based on the newly proposed satellite importance index, three different types of attacking strategies are implemented in this paper, i.e., random attacks, selective attacks based on the initial state of the network, and selective attacks based on the current state of the network. The routing methods involved in function robustness mainly include different local state routing algorithms, which we summarize into a brand-new routing model with tunable parameters. Simulation results show that the removals by the selective attacks based on the current state of the network are often more harmful than the other attack strategies. Constellation networks almost collapse for the above attack strategies as the attack ratio are nearly 0.6, 0.4, and 0.2 respectively. Meanwhile, the larger constellation is more robust than the smaller one against the attacks before collapses. However, the larger constellation collapses earlier for the selective attack strategies. In addition, local-state routing algorithms with a certain level of state awareness capability can be used to improve the network function robustness."}]}]}]}}