{"pii": "S0147651322000318", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0035", "view": "all"}, "$$": [{"#name": "__text__", "_": "Methylmercury (MeHg) is a hazardous substance that has unique neurodevelopmental toxic effects. However, its molecular alteration profile, sensitive response biomarkers, and mechanism of neuronal injury remain largely unknown. Here, the effects of intrauterine methylmercury chloride (low-, medium- and high-dose groups: 0.6 mg/kg/d, 1.2 mg/kg/d, 2.4 mg/ kg /d, respectively) exposure on learning and memory were assessed in offspring rats by behavioral tests, pathological analysis and hippocampal proteomic analysis. The results suggested that intrauterine MeHg exposure impairs spatial learning and memory and leads a significant reduction in the number and dispersion scattered arrangement in the hippocampus of offspring. Furthermore, in the tandem mass tag-based proteomics analysis, compared with the control group, a total of 74 differentially expressed proteins (DEPs) were found in the MeHg exposure groups; specifically, 32 down-regulated and 42 up-regulated proteins were identified. In addition, the pathways enrichment analysis indicated that these DEPs are implicated in several biological processes, such as synaptic plasticity and energy metabolism, as well as various molecular functional categories. Simultaneously, MeHg reduced the postsynaptic density, diminished the active zone, amplified the synaptic cleft and changed the synaptic interface of pyramidal cells. Western blot analysis further revealed that MeHg significantly reduced the levels of Forkhead box protein (FOXP2), Synaptophysin (SYP) and Postsynaptic density protein 95 (PSD-95), and down-regulated the N-methyl-"}, {"#name": "small-caps", "_": "D"}, {"#name": "__text__", "_": "-aspartate receptor 1 (NMDAR1), N-methyl-"}, {"#name": "small-caps", "_": "D"}, {"#name": "__text__", "_": "-aspartate receptor 2 A (NR2A) and N-methyl-"}, {"#name": "small-caps", "_": "D"}, {"#name": "__text__", "_": "-aspartate receptor 2B (NR2B). In general, from a functional perspective, most overlapping proteins were related to NMDA receptor-mediated glutamatergic signaling, which is an excitotoxicity mechanism known to influence learning and memory. These discoveries contribute to our understanding of the relationship between MeHg and cognitive deficits and provide insight into the protein mediators of this relationship and possible prospective early biomarkers."}]}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0040", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "The hippocampus of developing rats is a target of prenatal MeHg exposure."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Intrauterine MeHg exposure causes recognition deficits in offspring and alterations in their proteomic profiles."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Intrauterine MeHg exposure impairs the synaptic plasticity of the hippocampus in offspring."}]}]}]}]}]}]}}