{"pii": "S014206152300056X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e729", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e730"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e732", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e733", "view": "all"}, "_": "In response to extreme events, substantial research efforts have focused on developing load restoration strategies for networked microgrids (MGs). However, existing distributed control approaches only consider independent time periods, which cannot capture the time-coupled flexibility of storage units. Additionally, mobile energy storage systems (MESSs) have been deployed for resilience enhancement due to their advantages in mobility and flexibility. However, existing research on networked MGs utilizes simplistic energy management approaches for MG modeling without detailed network structures, which cannot capture the mobility of MESSs. To address these issues, this paper proposes a three-stage stochastic distributed control approach based on rolling optimization to enhance the resilience of networked MGs with MESSs. Specifically, a stochastic linearized OPF is formulated in the first stage to capture the flexibility of MESSs and uncertainties, while a consensus algorithm is utilized in the second stage to calculate the power exchange among MGs. Finally, a detailed non-linear AC OPF algorithm is employed in the third stage to capture technical constraints relating to stability properties towards accurate optimization results. Case studies considering load distinction, multiple line outages, and limited generation resources are developed to demonstrate the effectiveness of the proposed distributed control approach in accurate and timely decision-making."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e735", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e736"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e738", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e739", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e741"}, "$$": [{"#name": "list-item", "$": {"id": "d1e742"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e745", "view": "all"}, "_": "A three-stage distributed control method featuring rolling optimization is proposed."}]}, {"#name": "list-item", "$": {"id": "d1e747"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e750", "view": "all"}, "_": "Routing and scheduling behaviors of mobile energy storage units are captured."}]}, {"#name": "list-item", "$": {"id": "d1e752"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e755", "view": "all"}, "_": "A time-coupled AC OPF is utilized in the first stage to capture flexibilities."}]}, {"#name": "list-item", "$": {"id": "d1e757"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e760", "view": "all"}, "_": "A non-linear AC OPF is utilized in the third stage to capture technical constraints."}]}, {"#name": "list-item", "$": {"id": "d1e762"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e765", "view": "all"}, "_": "Uncertainties with renewable energy sources and load profiles are considered."}]}]}]}]}]}]}}