{"pii": "S0141933124000978", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e949", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e950"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e952", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e953", "view": "all"}, "_": "RED-SEA is a H2020 EuroHPC project, whose main objective is to prepare a new-generation European Interconnect, capable of powering the EU Exascale systems to come, through an economically viable and technologically efficient interconnect, leveraging European interconnect technology (BXI) associated with standard and mature technology (Ethernet), previous EU-funded initiatives, as well as open standards and compatible APIs."}, {"#name": "simple-para", "$": {"id": "d1e955", "view": "all"}, "_": "To achieve this objective, the RED-SEA project is being carried out around four key pillars: (i) network architecture and workload requirements-interconnects co-design – aiming at optimizing the fit with the other EuroHPC projects and with the EPI processors; (ii) development of a high-performance, low-latency, seamless bridge with Ethernet; (iii) efficient network resource management, including congestion and Quality-of-Service; and (iv) end-to-end functions implemented at the network edges."}, {"#name": "simple-para", "$": {"id": "d1e957", "view": "all"}, "_": "This paper presents key achievements and results at the midterm of the project for each key pillar in the way to reach the final project objective. In this regard we can highlight: (i) The definition of the network requirements and architecture as well as a list of benchmarks and applications; (ii) In addition to initially planned IPs progress, BXI3 architecture has evolved to support natively Ethernet at low level, resulting in reduced complexity, with advantages in terms of cost optimization, and power consumption; (iii) The congestion characterization of target applications and proposals to reduce this congestion by the optimization of collective communication primitives, injection throttling and adaptive routing; and (iv) the low-latency high-message rate endpoint functions and their connection with new open technologies."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e959", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e960"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e962", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e963", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e965"}, "$$": [{"#name": "list-item", "$": {"id": "d1e966"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e969", "view": "all"}, "_": "Future Exascale Systems and Beyond will require extreme scalable networks."}]}, {"#name": "list-item", "$": {"id": "d1e971"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e974", "view": "all"}, "_": "Design Process of BX3, the Next Generation of EU European Network Switch."}]}, {"#name": "list-item", "$": {"id": "d1e976"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e979", "view": "all"}, "_": "Network resource management."}]}]}]}]}]}]}}