{"pii": "S0142061523006944", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e376", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e377"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e379", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e380", "view": "all"}, "_": "This work presents the development of MatPDC, an IEEE Std. C37.118.2-2011 compliant Phasor Data Concentrator (PDC) implemented in the Matlab environment. MatPDC enables the integration of wide-area monitoring, protection and control system synchrophasor data into the Matlab platform, offering real-time access to synchronized data streams from multiple Phasor Measurement Units (PMUs). The key features of MatPDC include real-time data access, data integrity verification, data aggregation and alignment, compliant data communication, and latency calculation. These features facilitate efficient processing and analysis of synchronized data, reducing complexity and improving latency between data sources and applications. The development of MatPDC addresses the need for accessing and analyzing real-time synchrophasor data within the Matlab environment, providing researchers and engineers with a powerful tool for power system analysis and experimentation. By developing the PDC and synchrophasor applications on the same platform, MatPDC reduces complexity and latency between data sources and applications. It offers real-time access to synchronized data streams, ensuring data integrity through verification mechanisms and aggregating the data into a unified dataset based on time tags. The implementation of MatPDC opens up opportunities for researchers to work with real-time synchrophasor data. It facilitates the development of advanced algorithms, real-time simulations, and the verification of control strategies. The integration and evaluation of MatPDC demonstrate its effectiveness and potential in power system analysis, providing researchers and engineers with a valuable tool for their research and development activities."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e382", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e383"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e385", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e386", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e388"}, "$$": [{"#name": "list-item", "$": {"id": "d1e389"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e392", "view": "all"}, "_": "Real-time WAMPAC system data integration in Matlab."}]}, {"#name": "list-item", "$": {"id": "d1e394"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e397", "view": "all"}, "_": "Access synchronized PMU data for power system dynamic analysis."}]}, {"#name": "list-item", "$": {"id": "d1e399"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e402", "view": "all"}, "_": "Efficient power system monitoring and analysis with MatPDC."}]}, {"#name": "list-item", "$": {"id": "d1e404"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e407", "view": "all"}, "_": "Real-time access to synchronized data from multiple PMUs."}]}, {"#name": "list-item", "$": {"id": "d1e409"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e412", "view": "all"}, "_": "Compliant data communication to other PDCs."}]}]}]}]}]}]}}