{"pii": "S014036642400063X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1073", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1074"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1076", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1077", "view": "all"}, "_": "Driven by advancements in Industry 4.0, the Internet of Things (IoT), digital twins (DT), and cyber–physical systems (CPS), there is a growing interest in the digitalizing of asset integrity management. CPS, in particular, is a pivotal technology for the development of intelligent and interconnected systems. The design of a scalable, low-latency communication network with efficient data management is crucial for connecting physical and digital twins in heterogeneous robot fleets. This paper introduces a generalized cyber–physical architecture aimed at governing an autonomous multi-robot ecosystem via a scalable communication network. The objective is to ensure accurate and near-real-time perception of the remote environment by digital twins during robot missions. Our approach integrates techniques such as downsampling, compression, and dynamic bandwidth management to facilitate effective communication and cooperative inspection missions. This allow for efficient bi-directional data exchange between digital and physical twins, thereby enhancing the overall performance of the system."}, {"#name": "simple-para", "$": {"id": "d1e1079", "view": "all"}, "_": "This study contributes to the ongoing research on the deployment of cyber–physical systems for heterogeneous multi-robot fleets in remote inspection missions. The feasibility of the approach has been demonstrated through simulations in a representative environment. In these experiments, a fleet of robots is used to map an unknown building and generate a common 3D probabilistic voxel-grid map, while evaluating and managing bandwidth requirements. This study represents a step forward towards the practical implementation of continuous remote inspection with multi-robot systems through cyber–physical infrastructure. It offers potential improvements in scalability, interoperability, and performance for industrial asset monitoring."}]}]}]}}