{"pii": "S0142061523005252", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "A novel islanding detection in a low-voltage distribution grid is introduced."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "The ensemble bagged-trees algorithm is employed for island detection."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The discrimination between island and non-island events is performed efficiently."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "A comparative analysis is performed to demonstrate its effectiveness."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "The applications of distributed generators in distribution networks have proven to be highly reliable and cost-effective. Accidental islanding is currently regarded as an undesirable operational mode in utility practice because it can harm individuals and connected systems. Therefore, the occurrence of islanding must be detected, and then distributed generators must be disconnected from the main network. In this article, a fast and accurate island detection method is proposed for photovoltaic distributed generations with a near-zero non-detection zone. A new island detection approach is developed by combining signal processing and machine learning techniques. Variational mode decomposition is used as a signal processing technique. Whereas the ensemble bagged-trees method is used as a machine learning technique. Variational mode decomposition is used to process positive- and negative-sequence component voltage signals along with power signal measurements acquired from the point of common coupling in order to identify intrinsic-mode functions. Next, the ensemble bagged-trees method is utilized to detect islanding during active and reactive power mismatch events and inconvenient quality factors. The results demonstrate that the suggested technique is able to discriminate between islanding and non-islanding events such as capacitive switching, fault emulation, and distribution generation cut-off. Besides, it has a minimum non-detection zone of less than 4% and a 4.8 ms detection time. Therefore, it is a reliable and reasonable solution for the distribution grid."}]}]}]}}