{"pii": "S0141938223000240", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0530"}, "$$": [{"#name": "list-item", "$": {"id": "o0530"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p1075", "view": "all"}, "_": "This paper summarizes 181 studies on artificial intelligence used to help the visually impaired."}]}, {"#name": "list-item", "$": {"id": "o0535"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p1080", "view": "all"}, "_": "DL can help diagnose eye diseases, including cataracts, diabetic retinopathy, and glaucoma."}]}, {"#name": "list-item", "$": {"id": "o0540"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p1085", "view": "all"}, "_": "DL can help build assisted reading and obstacle avoidance systems."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "The eyes are an essential tool for human observation and perception of the world, helping people to perform their tasks. Visual impairment causes many inconveniences in the lives of visually impaired people. Therefore, it is necessary to focus on the needs of the visually impaired community. Researchers work from different angles to help visually impaired people live normal lives. The advent of the digital age has profoundly changed the lives of the visually impaired community, making life more convenient. Deep learning, as a promising technology, is also expected to improve the lives of visually impaired people. It is increasingly being used in the diagnosis of eye diseases and the development of visual aids. The earlier accurate diagnosis of the eye disease by the doctor, the sooner the patient can receive the appropriate treatment and the better chances of a cure. This paper summarises recent research on the development of artificial intelligence-based eye disease diagnosis and visual aids. The research is divided according to the purpose of the study into deep learning methods applied in diagnosing eye diseases and smart devices to help visually impaired people in their daily lives. Finally, a summary is given of the directions in which artificial intelligence may be able to assist the visually impaired in the future. In addition, this overview provides some knowledge about deep learning for beginners. We hope this paper will inspire future work on the subjects."}, {"#name": "simple-para", "$": {"id": "sp0015", "view": "all"}, "_": "."}]}]}]}}