{"pii": "S0141029622001638", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e763"}, "$$": [{"#name": "section-title", "$": {"id": "d1e764"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e766"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e767"}, "_": "This work proposes a supervised Deep Learning approach for damage identification in bridge structures. We employ a hybrid methodology that incorporates Finite Element simulations to enrich the training phase of a Deep Neural Network with synthetic damage scenarios. The neural network is based on autoencoders and its particular architecture allows to activate or deactivate nonlinear connections under need. The methodology intends to contribute to the progress towards the applicability of Structural Health Monitoring practices in full-scale bridge structures. The ultimate goal is to estimate the location and severity of damage from measurements of the dynamic response of the structure. The damages we seek to detect correspond to material degradations that affect wide areas of the structure by reducing its stiffness properties. Our method allows a feasible adaptation to large systems with complex parametrizations and structural particularities. We investigate the performance of the proposed method on two full-scale instrumented bridges, obtaining adequate results for the testing datasets even in presence of measurement uncertainty. Besides, the method successfully predicts the damage condition for two real damage scenarios of increasing severity available in one of the bridges."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e769"}, "$$": [{"#name": "section-title", "$": {"id": "d1e770"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e772"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e773"}, "$$": [{"#name": "list", "$": {"id": "d1e775"}, "$$": [{"#name": "list-item", "$": {"id": "d1e776"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e779"}, "_": "Combination of model-based and data-driven approaches for SHM."}]}, {"#name": "list-item", "$": {"id": "d1e781"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e784"}, "_": "Use of autoencoder-based Deep Neural Networks to map the relationship between dynamic response and structural damage."}]}, {"#name": "list-item", "$": {"id": "d1e786"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e789"}, "_": "Orientation of the methodology to complex full-scale bridge structures."}]}, {"#name": "list-item", "$": {"id": "d1e791"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e794"}, "_": "Application of the methodology to two real bridges."}]}]}]}]}]}]}}