{"pii": "S0142061524002795", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Fault Protection Strategies for VSC-Based Multi-Terminal HVDC Networks."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Time-Domain Transient Analysis of Power Using State-Space Calculations."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Interior-Angle Analysis of Power for Fault Identification in Meshed VSC-HVDC Grids."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Optimal DC Fault Detection in Terms of Speed, Selectivity, Reliability, Computational Burden, etc."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "The VSC-based HVDC networks have become a reliable candidate for integrating renewable energy resources over long distances. However, the development of these networks faces protection challenges against DC short-circuit faults, where fault detection in these networks is at top of the issues. This paper proposes a fast fault identification strategy based on the Interior-Angle analysis between the powers of the DC-link capacitor and the protected DC-line. In the proposed scheme, first, the time-domain mathematical expression of the power signals is extracted, and second, the angle analysis of the power signals through the normalized interior-product approach is carried out. Accordingly, a fast fault identification index is introduced that detects the fault conditions in about 1.0 msec. The presented strategy only relies on conventional voltage/current measurements and does not require any extra sensor. Moreover, it can discriminate the faulted branch from the healthy ones with a considerable safety margin. To validate the performance of the proposed method, a complete set of fault scenarios are investigated on a bipolar meshed multi-terminal VSC-HVDC network. It is shown that the proposed method appropriately detects the pole-to-ground and pole-to-pole DC faults at different locations with zero and high resistance faults."}]}]}]}}