{"pii": "S0141118724004309", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e3241", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e3242"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e3244", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e3245", "view": "all"}, "_": "This paper introduces a robust framework within the OpenFOAM® environment to model the complex case of floating Oscillating Water Column (OWC) systems. It integrates existing modules for wave generation and absorption, overset mesh for dynamic mesh motion, and the Moody mooring model. A significant novel contribution of this work is the incorporation of a movable porous medium zone, designed to emulate the damping effect of the Power Take-Off (PTO) turbine. The paper first presents a validation of the coupled framework, comprising the tailored version of the two-phase fluid dynamics solver with the porous medium zones, the Overset algorithm for mesh motion and the Moody model for mooring systems. The validated model is then used to demonstrate the capabilities of the porous media zone in replicating the PTO damping for a floating OWC under constant loadings and regular waves. It is observed that the presence of the PTO alters the natural frequency and maximum displacements of the floating body, but has very little influence in the main displacements. The different characterisations of the PTO influence the frictional forces. The air flow is modified in the vicinity of the PTO due to the frictional forces exerted by the porous zone."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e3247", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e3248"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e3250", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e3251", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e3253"}, "$$": [{"#name": "list-item", "$": {"id": "d1e3254"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e3257", "view": "all"}, "_": "A new OpenFOAM framework for CFD simulations of floating OWC is presented."}]}, {"#name": "list-item", "$": {"id": "d1e3259"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e3262", "view": "all"}, "_": "The framework combines wave generation, mesh motion and mooring model modules."}]}, {"#name": "list-item", "$": {"id": "d1e3264"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e3267", "view": "all"}, "_": "A movable porous zone is incorporated to model the damping effect of the PTO turbine."}]}]}]}]}]}]}}