{"pii": "S0164121224002747", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1057", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1058"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1060", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1061", "view": "all"}, "_": "Given the widespread popularity and increasing reliance on long-lived web applications (such as Netflix and Facebook), effective and efficient bug reproduction is essential to maintain functionality and user satisfaction throughout the application’s lifetime. Developers use bug reports to localize, reproduce, and eventually fix software bugs. However, the content of bug reports is not always helpful (e.g., due to incomplete or missing information). In this study, we explore what type of information is often missing in bug reports and how that information is presented in them. We manually analyzed the initial and final versions of 1000 bug reports from 10 popular open-source web-based applications. The analysis revealed that, regardless of the type of software (e.g., e-commerce software or personal tools), diagnostic suggestions from developers and end-user usage information are often missing in initial bug reports but only added later throughout the lifetime of a bug report. Also, textual descriptions and screenshots are used most to describe bugs, regardless of the type of bug (e.g., a functional or performance error). The study highlighted the need for improved bug reporting templates and tools to improve bug report quality and efficiency in web application development and maintenance."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1063", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1064"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1066", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1067", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1069"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1070"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1073", "view": "all"}, "_": "We manually analyzed 1000 bug reports from 10 popular open-source projects."}]}, {"#name": "list-item", "$": {"id": "d1e1075"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1078", "view": "all"}, "_": "We identify types of information commonly missing in bug reports."}]}, {"#name": "list-item", "$": {"id": "d1e1080"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1083", "view": "all"}, "_": "We outline directions toward systematic bug data collection."}]}, {"#name": "list-item", "$": {"id": "d1e1085"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1088", "view": "all"}, "_": "We highlight the importance of developer skills."}]}]}]}]}]}]}}