{"pii": "S0166432819317942", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0025", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "lis0005"}, "$$": [{"#name": "list-item", "$": {"id": "lsti0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "par0005", "view": "all"}, "_": "Non-genetic inheritance (NGI) and accumulation of behaviour is crucial for culture · the human behaviourome concept is introduced."}]}, {"#name": "list-item", "$": {"id": "lsti0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "par0010", "view": "all"}, "_": "Mechanisms of a near-orthogonal and ultra-fast NGI of the behaviourome are suggested."}]}, {"#name": "list-item", "$": {"id": "lsti0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "par0015", "view": "all"}, "_": "Behaviourome mutations can be target-directed."}]}, {"#name": "list-item", "$": {"id": "lsti0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "par0020", "view": "all"}, "_": "Ex-vivo storage and -accumulation of the behaviourome are pivotal for culture."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0030", "view": "all"}, "$$": [{"#name": "__text__", "_": "Current human culture is characterized by an increasing rate of accumulating potential and actually performed behaviours. The growth of behavioural complexity as well as the "}, {"#name": "italic", "_": "ex-vivo"}, {"#name": "__text__", "_": " accumulation of human behaviour, here identified as the non-genetically inherited (NGI) "}, {"#name": "italic", "_": "behaviourome"}, {"#name": "__text__", "_": ", cannot be explained by genetic/epigenetic mechanisms of inheritance. As human beings derive their socio-cultural identity predominantly from their behaviourome, mechanisms of heritability should predominantly consider inheritance and accumulation of the NGI behaviourome. Here we propose key mechanisms of a "}, {"#name": "italic", "_": "near-orthogonal"}, {"#name": "__text__", "_": " and "}, {"#name": "italic", "_": "ultra-fast"}, {"#name": "__text__", "_": " evolution of the NGI human behaviourome that provide a foundation not only of unique human culture development, but also of its recent acceleration. Thereby, the evolution of the human NGI behaviourome underlies similar features as genetically based evolution. However, specific mechanisms of mutation and selection work largely independent (orthogonal) from genetic/epigenetic mechanisms. We suggest a mechanism of how adaptive changes (mutations) in the NGI behaviourome work target-directed and how selection works on an ultra-fast time scale. Selection results are mostly not fatal for the individual which allows for a much increased mutation rate. For crucial accumulation of the NGI behaviourome, "}, {"#name": "italic", "_": "ex-vivo"}, {"#name": "__text__", "_": " storage and retrieval systems of virtually unlimited capacity are described. We discuss the great potential of the human NGI behaviourome in respect of speculative human super-reproduction and homosexual reproduction success, as well as a possible unique human way to avoid reproduction failure in childlessness. Altogether, this model of human behavioural reproduction and accumulation of behaviour may provide a base for better understanding and prediction of uniquely human cultural development."}]}]}]}]}}