{"pii": "S0167642316300314", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0100", "view": "all"}, "_": "Internet searches that occur in learning contexts are very different in nature from traditional “lookup” or “known item” searches: students usually perform searches to gather information about or master a certain topic, and the search engine is used as an aid in the exploration of a domain of knowledge. This paper presents SDE (Search Discover Explore), an exploratory search engine for educational resources that was built on top of the knowledge provided by Wikipedia: the set of its articles provides the search space (the set of topics that users can investigate), and the relationships between Wikipedia articles inform the suggestions that the search engine provides to students to go deeper in the exploration of a certain domain of knowledge. SDE indexes several hundreds of thousands of educational resources from high-quality Web sources, such as Project Gutenberg and Open Education Europe, among many others. This paper also reports the results of the evaluation of SDE by experts in Technology Enhanced Learning in several workshops that took place across Europe in the context of the European FP7 project iTEC. These results enable us to conclude that the exploratory search paradigm, making use of knowledge mined from Wikipedia, is a very promising approach for building information retrieval systems to be used in learning contexts."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "ab0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0110", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ls0010"}, "$$": [{"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "The research presented in this manuscript stems from the work we have done in the context of the European FP7 project iTEC (Innovative Technologies for an Engaging Classroom). We developed a conceptbased search engine for educational resources that leverages Wikipedia as background knowledge, and the evaluation of the system with end-users in pilots was very positive. We are aware of the huge potential of concept-based document representations for Information Retrieval, Classification, Clustering, and Recommendations, among other areas of application. The following URL provides more information on the conceptbased search engine, it is an iTEC research report: "}, {"#name": "inter-ref", "$": {"xmlns:xlink": true, "role": "http://www.elsevier.com/xml/linking-roles/text/html", "href": "http://files.eun.org/itec/del/ITECD10p4.pdf", "id": "inf0010", "type": "simple"}, "_": "http://files.eun.org/itec/del/ITECD10p4.pdf"}]}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0020", "view": "all"}, "_": "The manuscript that we are submitting for review aims at understanding the nature of concept-based representations, as opposed to Word-based ones."}]}]}]}]}]}]}}