{"pii": "S0166361522001750", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0045", "view": "all"}, "_": "Prolonging garment longevity is a well-recognized key strategy to reduce the overall environmental impact in the textile and clothing sector. In this context, change or degradation in esthetic or visual appeal of a garment with usage is an important factor that largely influence its longevity. Therefore, to engineer the garments for a required lifetime or prolong longevity, there is a need for predictive systems that can forecast the trajectory of visual degradation based on material/structural parameters or use conditions that can guide the practitioners for an optimal design. This paper develops a deep learning based predictive system for washing-induced visual change or degradation of selected garment areas. The study follows a systematic experimental design to generate and capture visual degradation in garment and equivalent fabric samples through 70 cycles in a controlled environment following guideline from relevant washing standards. Further, the generated data is utilized to train conditional Generative Adversarial Network-based deep learning model that learns the degradation pattern and links it to washing cycles and other seam properties. In addition, the predicted results are compared with experimental data using Frechet Inception Distance, to ascertain that the system prediction are visually similar to the experimental data and the prediction quality improves with training process."}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0050", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "A deep learning-based predictive system for garment visual degradation is developed."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "A dataset is developed that contains tagged garment and fabric images up to 70 washes."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "A conditional GAN is trained for generating the visual degradation of seam areas."}]}]}]}]}]}]}}