{"pii": "S0167739X21004702", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e488"}, "$$": [{"#name": "section-title", "$": {"id": "d1e489"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e491"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e492"}, "_": "In this paper we describe an architecture developed and prototyped in the course of the NSF-funded project called ImPACT—Infrastructure for Privacy-Assured CompuTations. This architecture addresses the common problems that arise from the need to securely store, control access to and process privacy-restricted data in a multi-institutional, multi-stakeholder setting. Specifically the architecture includes several components—a way to publicly advertise a limited set of data attributes without exposing the sensitive data itself; a set of mechanisms for a data owner to specify and automatically enforce complex data-access policies commonly expressed today as Data Use Agreements (DUAs); a way to securely collect digital attestations from multiple stakeholders to satisfy those policies; and a reproducible template to deploy secure processing enclaves in which groups of researchers can analyze the data in a way that complies with data owner policies using the tools of their choice. The paper describes the architecture and its instantiation in a prototype, providing a performance evaluation of several components."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e494"}, "$$": [{"#name": "section-title", "$": {"id": "d1e495"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e497"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e498"}, "$$": [{"#name": "list", "$": {"id": "d1e500"}, "$$": [{"#name": "list-item", "$": {"id": "d1e501"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e504"}, "_": "Analysis of sensitive data in multi-institutional setting is challenging."}]}, {"#name": "list-item", "$": {"id": "d1e506"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e509"}, "_": "Common solutions today are heavily centralized, reducing autonomy of decisions for stakeholders."}]}, {"#name": "list-item", "$": {"id": "d1e511"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e514"}, "_": "ImPACT is a distributed architecture addressing pain points in this problem space."}]}, {"#name": "list-item", "$": {"id": "d1e516"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e519"}, "_": "ImPACT prototype heavily leverages CILogon federated identity management mechanisms."}]}]}]}]}]}]}}