{"pii": "S0166361523000829", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e2520", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e2521"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e2523", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e2524", "view": "all"}, "_": "Sustainability among companies is a topic that has gained enormous attention in recent years. Nonetheless, not much is known about the distribution of sustainable companies in The Netherlands. This paper explores text mining techniques to identify whether a company is sustainable or not by means of the information the companies provide on their websites. In addition, this paper introduces seven novel neural network architectures to perform this task through supervised classification. These architectures make use of the hierarchical nature of Web domains, which are made up of layers of Web pages, sentences, and words. We either encode each of these layers by an attention mechanism, skip a layer, or use convolution layers. Among these models, the one that encodes pages, followed by a convolution layer appears to perform the best. This method also performs better than both logistic regression and support vector machine approaches as well as convolutional neural networks. The attention model is used to gain insight into the distribution of sustainable industrial companies. The most sustainable activities identified are (i) production of chemical products, (ii) production of leather, leather products, and shoes, and (iii) production of food, with the least sustainable activities being (i) production of computers, (ii) printing, and (iii) production of cars, trailers, and semitrailers."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e2526", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e2527"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e2529", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e2530", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e2532"}, "$$": [{"#name": "list-item", "$": {"id": "d1e2533"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e2536", "view": "all"}, "_": "We utilize text mining techniques to identify whether a company is sustainable."}]}, {"#name": "list-item", "$": {"id": "d1e2538"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e2541", "view": "all"}, "_": "For this, we use the information the companies provide on their websites."}]}, {"#name": "list-item", "$": {"id": "d1e2543"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e2546", "view": "all"}, "_": "We introduce 7 novel neural networks architectures to perform this task."}]}, {"#name": "list-item", "$": {"id": "d1e2548"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e2551", "view": "all"}, "_": "The model that encodes pages, followed by a convolution layer, performs the best."}]}]}]}]}]}]}}