{"pii": "S016636152200029X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0120", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Correlation-based feature extraction is applied to CAD model parameters."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "It is shown that CAD parameters as input, makes the problem high dimensional."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The volume simulation of a curtain airbag is used as a case study."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Using area, medial axis, etc., the concept of ‘Sleeping Parameters’ is introduced."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Sleeping parameters enables a real time prediction tool in early design phases."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0115", "view": "all"}, "$$": [{"#name": "__text__", "_": "Many high-level technical products are associated with changing requirements, drastic design changes, lack of design information, and uncertainties in input variables which makes their design process iterative and simulation-driven. Regression models have been proven to be useful tools during design, altering the resource-intensive finite element simulation models. However, building regression models from computer-aided design (CAD) parameters is associated with challenges such as dealing with too many parameters and their low or coupled impact on studied outputs which ultimately requires a large training dataset. As a solution, extraction of hidden features from CAD is presented on the application of volume simulation of curtain airbags concerning geometric changes in design loops. After creating a prototype that covers all aspects of a real curtain airbag, its CAD parameters have been analyzed to find out the correlation between design parameters and volume as output. Next, using the design of the experiment latin hypercube sampling method, 100 design samples are generated and the corresponding volume for each design sample was assessed. It was shown that selected CAD parameters are not highly correlated with the volume which consequently lowers the accuracy of prediction models. Various geometric entities, such as the medial axis, are used to extract several hidden features (referred to as "}, {"#name": "italic", "_": "sleeping parameters"}, {"#name": "__text__", "_": "). The correlation of the new features and their performance and precision through two regression analyses are studied. The result shows that choosing sleeping parameters as input reduces dimensionality and the need to use advanced regression algorithms, allowing designers to have more accurate predictions (in this case approximately 95%) with a reasonable number of samples. Furthermore, it was concluded that using sleeping parameters in regression-based tools creates real-time prediction ability in the early development stage of the design process which could contribute to lower development lead time by eliminating design iterations."}]}]}]}]}}