{"pii": "S0169260722003947", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "attachments"}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "absh001", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0001", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "lst0001"}, "$$": [{"#name": "list-item", "$": {"id": "lstitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0001", "view": "all"}, "_": "Colon and rectum histological images are used for the first time to develop an end-to-end automatic system able to predict ulcerative colitis activity based on neutrophil detection using WSI, which is a diagnostic challenge."}]}, {"#name": "list-item", "$": {"id": "lstitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0002", "view": "all"}, "_": "A novel constrained formulation for multiple instance learning (MIL) integrating an auxiliary term that focuses on the key features for the classification is proposed."}]}, {"#name": "list-item", "$": {"id": "lstitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0003", "view": "all"}, "_": "A new attention weight for embedding-level MIL, which enlarges the relevance of the positive instances is presented. With the use of these coefficients, the final representation of the bag is highly informative for the bag-level classifier."}]}, {"#name": "list-item", "$": {"id": "lstitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0004", "view": "all"}, "_": "We benchmark the proposed model against the relevant body of literature on PICASSO-MIL, a multi-center database composed of a large cohort of biopsies collected and digitalized in 7 centers in the UK, Germany, Belgium, Italy, Canada and USA."}]}, {"#name": "list-item", "$": {"id": "lstitem0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Comprehensive experiments demonstrate the superior performance of our model. By simply incorporating information about the neutrophil location during the training, we found improvements of nearly 10% for bag-level classification compared to the most relevant MIL methods."}]}, {"#name": "list-item", "$": {"id": "lstitem0006"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0006", "view": "all"}, "_": "The class activation maps extracted are directly in line with the clinician’s opinion since the highlighted regions of the histological images correspond to the interesting areas in which the experts focus for Ulcerative Colitis diagnosis."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0001", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0002", "view": "all"}, "$$": [{"#name": "italic", "_": "Background and Objective:"}, {"#name": "__text__", "_": " Ulcerative colitis (UC) is an inflammatory bowel disease (IBD) affecting the colon and the rectum characterized by a remitting-relapsing course. To detect mucosal inflammation associated with UC, histology is considered the most stringent criteria. In turn, histologic remission (HR) correlates with improved clinical outcomes and has been recently recognized as a desirable treatment target. The leading biomarker for assessing histologic remission is the presence or absence of neutrophils. Therefore, the finding of this cell in specific colon structures indicates that the patient has UC activity. However, no previous studies based on deep learning have been developed to identify UC based on neutrophils detection using whole-slide images (WSI)."}]}, {"#name": "simple-para", "$": {"id": "sp0003", "view": "all"}, "$$": [{"#name": "italic", "_": "Methods:"}, {"#name": "__text__", "_": " The methodological core of this work is a novel multiple instance learning (MIL) framework with location constraints able to determine the presence of UC activity using WSI. In particular, we put forward an effective way to introduce constraints about positive instances to effectively explore additional weakly supervised information that is easy to obtain and enjoy a significant boost to the learning process. In addition, we propose a new weighted embedding to enlarge the relevance of the positive instances."}]}, {"#name": "simple-para", "$": {"id": "sp0004", "view": "all"}, "$$": [{"#name": "italic", "_": "Results:"}, {"#name": "__text__", "_": " Extensive experiments on a multi-center dataset of colon and rectum WSIs, PICASSO-MIL, demonstrate that using the location information we can improve considerably the results at WSI-level. In comparison with prior MIL settings, our method allows for "}, {"#name": "math", "$": {"xmlns:mml": true, "altimg": "si4.svg"}, "$$": [{"#name": "mrow", "$$": [{"#name": "mn", "_": "10"}, {"#name": "mo", "_": "%"}]}]}, {"#name": "__text__", "_": " improvements in bag-level accuracy."}]}, {"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "italic", "_": "Conclusion"}, {"#name": "__text__", "_": ": Our model, which introduces a new form of constraints, surpass the results achieved from current state-of-the-art methods that focus on the MIL paradigm. Our method can be applied to other histological concerns where the morphological features determining a positive WSI are tiny and similar to others in the image."}]}]}]}]}}