{"pii": "S0167488922001100", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0030", "view": "all"}, "$$": [{"#name": "__text__", "_": "The development of cancer treatment has recently achieved a remarkable breakthrough, and checkpoint blockade immunotherapy has received much attention. To enhance the therapeutic efficacy of checkpoint blockade immunotherapy, recent studies have revealed the importance of activation of CD4"}, {"#name": "sup", "$": {"loc": "post"}, "_": "+"}, {"#name": "__text__", "_": " T cells via an increase in major histocompatibility complex (MHC) class II molecules in cancer cells. Here, we demonstrate that tripartite motif-containing (TRIM) 22, negatively regulates MHC-II expression. Gene knockout of TRIM22 using Cas9-sgRNAs led to an increase of MHC-II proteins, while TRIM22 overexpression remarkably decreased MHC-II proteins. mRNA levels of MHC-II and class II transactivator (CIITA), which plays an essential role in the regulation of MHC-II transcription, were not affected by TRIM22. Furthermore, TRIM22 knockout did not suppress the degradation of MHC-II protein but rather promoted it. These results suggest that TRIM22 decreases MHC-II protein levels through a combination of multiple mechanisms other than transcription or degradation. We showed that inhibition of TRIM22 can increase the amount of MHC-II expression in cancer cells, suggesting a possibility of providing the biological basis for a possible therapeutic target to potentiate checkpoint blockade immunotherapy."}]}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0035", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "TRIM22 gene is strongly induced by IFN-γ stimulation."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Gene knockout of TRIM22 leads to an increase of MHC-II proteins in U87MG cells."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "TRIM22 overexpression remarkably decreases MHC-II proteins in U87MG cell."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "TRIM22 may decrease MHC-II protein levels through a combination of multiple mechanisms other than transcription or degradation."}]}]}]}]}]}]}}