{"pii": "S0164121223003278", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e3052", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e3053"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e3055", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e3056", "view": "all"}, "_": "GUI-based test-cases generated by Capture and Replay tools suffer from the well-known fragility problem: they may break even if small layout changes are operated in a Web application, without modifying the app functionality. An approach based on the automatic injection of HTML tag attributes named hooks in the source code of Web templates has been recently proposed to solve this problem. Such hooks allow the unique identification of GUI items to be located during test case execution. This technique showed its effectiveness in a preliminary validation study, where it allowed to significantly reduce the number of test case locator breakages in regression testing of student-made Web applications. This paper presents a further validation study where we compared the robustness of hook-based test cases against state-of-the-art and state-of-the-practice techniques for locating GUI objects. We proposed a three dimensional model for classifying different types of layout changes and used it to define a benchmark of realistic changes. Thanks to the model, we systematically compared the robustness of test cases generated by different techniques with respect to specific types of changes and studied the relationship between fragility issues and types of changes in different test case generation techniques."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e3058", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e3059"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e3061", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e3062", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e3064"}, "$$": [{"#name": "list-item", "$": {"id": "d1e3065"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e3068", "view": "all"}, "_": "Locator Fragility may break GUI-based Test Cases in regression testing processes."}]}, {"#name": "list-item", "$": {"id": "d1e3070"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e3073", "view": "all"}, "_": "Robustness of locators is improved by artificial hooks in the source code."}]}, {"#name": "list-item", "$": {"id": "d1e3075"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e3078", "view": "all"}, "_": "Our layout change model is a benchmark for measuring GUI-based test case robustness."}]}]}]}]}]}]}}