{"pii": "S0164121222000905", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e971"}, "$$": [{"#name": "section-title", "$": {"id": "d1e972"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e974"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e975"}, "_": "Deep learning (DL) based software systems are difficult to develop and maintain in industrial settings due to several challenges. Data management is one of the most prominent challenges which complicates DL in industrial deployments. DL models are data-hungry and require high-quality data. Therefore, the volume, variety, velocity, and quality of data cannot be compromised. This study aims to explore the data management challenges encountered by practitioners developing systems with DL components, identify the potential solutions from the literature and validate the solutions through a multiple case study. We identified 20 data management challenges experienced by DL practitioners through a multiple interpretive case study. Further, we identified 48 articles through a systematic literature review that discuss the solutions for the data management challenges. With the second round of multiple case study, we show that many of these solutions have limitations and are not used in practice due to a combination of four factors: high cost, lack of skill-set and infrastructure, inability to solve the problem completely, and incompatibility with certain DL use cases. Thus, data management for data-intensive DL models in production is complicated. Although the DL technology has achieved very promising results, there is still a significant need for further research in the field of data management to build high-quality datasets and streams that can be used for building production-ready DL systems. Furthermore, we have classified the data management challenges into four categories based on the availability of the solutions."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e977"}, "$$": [{"#name": "section-title", "$": {"id": "d1e978"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e980"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e981"}, "$$": [{"#name": "list", "$": {"id": "d1e983"}, "$$": [{"#name": "list-item", "$": {"id": "d1e984"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e987"}, "_": "Identifies the data management challenges for deep learning."}]}, {"#name": "list-item", "$": {"id": "d1e989"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e992"}, "_": "Identifies the solutions to identified data management challenges from literature."}]}, {"#name": "list-item", "$": {"id": "d1e994"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e997"}, "_": "Analyze why data management for DL cannot be solved by existing solutions from other domains such as Big Data, data analytics, machine learning, and data mining."}]}, {"#name": "list-item", "$": {"id": "d1e999"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1002"}, "_": "Classify the data management challenges based on the availability of solutions."}]}, {"#name": "list-item", "$": {"id": "d1e1004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1007"}, "_": "Identify open research challenges in data management for DL and present them as future research directions."}]}]}]}]}]}]}}