{"pii": "S0167739X23004314", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e620", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e621"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e623", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e624", "view": "all"}, "_": "Metaverse is recently envisioned as the main driver for immersive multimedia in future networks. Light field video (LFV), considered an intermediate transition scheme towards the metaverse, is conducive to sensing and reconstructing realistic scenes in the digital twins. However, the research on LFV systems still lacks comprehensive investigation, impeding their practical application. This paper addresses major technical challenges involved in LFV delivery through mobile networks, showing a trade-off between equipment cost, calibration effort, and workflow simplicity. It also considers the balance of communications and computations latency when maintaining reconstruction performance. Leveraging edge and cloud infrastructure, a novel Mobile Edge Assisted Multi-view Light-field-video System (MEAMLS) is proposed, integrating LFV collection, volumetric video construction, and an immersive viewing scheme. A custom-made LFV capture array is designed to capture real-world scenes, while employing a learning method-integrated edge server to facilitate adaptive LFV coding. Moreover, a fast sparse reconstruction algorithm is established, leveraging edge–cloud collaboration to minimize computation latency during volumetric video construction. Intelligent service for users is deployed on edge to enable viewport-driven virtual reality viewing. By providing an immersive visual experience, the proposed MEAMLS bridges the physical world and its digital twins. The system is prototyped on a realistic 5G network to empirically validate the performance under static and dynamic circumstances. Experimental results yield fundamental insights for designing mobile edge networks-assisted LFV system from the perspective of transmission resource, adaptability, and deployment."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e626", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e627"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e629", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e630", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e632"}, "$$": [{"#name": "list-item", "$": {"id": "d1e633"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e636", "view": "all"}, "_": "A metaverse-oriented light field video prototype in IoT and 5G networks is presented, covering the entire service chain from data acquisition to playback."}]}, {"#name": "list-item", "$": {"id": "d1e638"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e641", "view": "all"}, "_": "A custom-made light field video capture array integrating computation and transmission modules is developed."}]}, {"#name": "list-item", "$": {"id": "d1e643"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e646", "view": "all"}, "_": "Generate digital twins content in volumetric video based on an edge- cloud collaboration scheme."}]}, {"#name": "list-item", "$": {"id": "d1e648"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e651", "view": "all"}, "_": "The end user of the system can have an immersive viewing experience with high quality in 6DoF metaverse."}]}]}]}]}]}]}}