{"pii": "S016816992400067X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e393", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e394"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e396", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e397", "view": "all"}, "$$": [{"#name": "__text__", "_": "Digital Twin technology has emerged to become a key enabling technology in the ongoing transition into Industry 4.0. A Digital Twin is in essence a digital representation of an asset that provides better insight into its dynamics by combining "}, {"#name": "italic", "_": "a priori"}, {"#name": "__text__", "_": " knowledge of the system through mathematical models with online data acquired from sensors and instruments deployed in or at the physical asset. While the technology is seeing increased use across several different industrial, governmental and research sectors, and across scientific disciplines, its application within aquaculture is still in its infancy. However, due to the rapid ongoing development in technological methods in aquaculture, an increasing number of the building blocks required to make a Digital Twin for aquaculture purposes are becoming available. We set out to explore these possibilities by first defining a Digital Twin — what components it should contain, how it should be constructed, and outlining the capability levels of a finished Digital Twin. Our next step was then to explore the state-of-the-art within the different required components and enabling technologies within aquaculture, thereby identifying the current foundation for developing Digital Twin technology in this sector. Following this, we developed concrete case studies that elaborate upon how we by combining existing and developing new technological tools could envision developing Digital Twins for three application areas of high industrial relevance, namely oxygen conditions in sea-cages, fish growth in sea-cages and in-cage robotics and vehicle operations. In conclusion, we present our thoughts on the potential of Digital Twin technology in being a key component in ushering in Industry 4.0 in aquaculture, and outline a pathway on the way onward towards achieving this goal."}]}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e402", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e403"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e405", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e406", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e408"}, "$$": [{"#name": "list-item", "$": {"id": "d1e409"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e412", "view": "all"}, "_": "Explored how digital twin technology could be adapted to the aquaculture domain."}]}, {"#name": "list-item", "$": {"id": "d1e414"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e417", "view": "all"}, "_": "Review of the work done so far within digital twins for aquaculture."}]}, {"#name": "list-item", "$": {"id": "d1e419"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e422", "view": "all"}, "_": "Reviewed state-of-the-art in components needed for digital twins in aquaculture."}]}, {"#name": "list-item", "$": {"id": "d1e424"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e427", "view": "all"}, "_": "Roadmap towards achieving benefits of digital twin technology in aquaculture."}]}, {"#name": "list-item", "$": {"id": "d1e429"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e432", "view": "all"}, "_": "Case studies describing possible digital twin developments for aquaculture."}]}]}]}]}]}]}}