{"pii": "S0167642317300813", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0190", "view": "all"}, "_": "Due to the huge amount of involved data and time-consuming process of join operations, the exact-match joins are rarely used for big data. The most common alternative for exact-match joins are similarity joins which find similar pairs of records. Set similarity join (SSJ) is defined as join of very large tables based on similarity of a set of their attributes, which is called join attributes. To operate the similarity join of two large tables based on their join attributes, the similarity of the values of the join attributes is specified using an appropriate similarity function, and then, the values pairs which their similarity is higher than a certain threshold, are selected as candidates for join in case of similarity."}, {"#name": "simple-para", "$": {"id": "sp0200", "view": "all"}, "_": "In this paper, a parallel set similarity join method is introduced using the MapReduce programming model. The proposed method uses Locality Sensitive Hashing (LSH) techniques to decrease the number of required comparisons for calculating the similarity of the sets. The performance of the proposed method has been compared with the best previous similarity join methods on real and synthetic datasets in terms of time. The experimental results show that the proposed method works faster than the former methods."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "ab0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0210", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ls0010"}, "$$": [{"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0010", "view": "all"}, "_": "We proposed a new method for set similarity join using the MapReduce framework."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0020", "view": "all"}, "_": "Our proposed method is based on LSH."}]}, {"#name": "list-item", "$": {"id": "li0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0030", "view": "all"}, "_": "The number of comparisons required to calculate similarity of the has been decreased through hashing."}]}, {"#name": "list-item", "$": {"id": "li0040"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0040", "view": "all"}, "_": "The proposed method is better than the similar methods in terms of time."}]}]}]}]}]}]}}