{"pii": "S0169555X23000594", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0115", "view": "all"}, "$$": [{"#name": "__text__", "_": "Over the last two centuries, rivers worldwide have been affected by human interventions, including dams, river training, and gravel mining. Such actions have often involved river fragmentation and sediment starvation. In this regard, gravel augmentation is an increasingly common restoration practice for mitigating sediment starvation in gravel-bed rivers. However, uncertainties remain on how to better implement and design such operations. This is the case for the Rhône River at Péage-de-Roussillon, France, where 6885 m"}, {"#name": "sup", "$": {"loc": "post"}, "_": "3"}, {"#name": "__text__", "_": " of gravels were augmented in 2017. This work raised some concerns from river managers about the potential threat posed to a downstream reservoir from the arrival of the sediment, and explains why they were interested in the timeframe of sediment propagation, and travel distances and velocities of the augmented sediment. To answer these questions, we propose a modelling framework for simulating the long-term downstream propagation of a pulse of augmented sediment, with this framework being based on a combination of particle tracking data collected in the field and bedload transport capacity estimates. This workflow allowed us to successfully model propagation of gravels along the study reach, and provided useful information on how the sediment wave would behave over the long term. We believe that the methodology proposed in this study has much potential for exploring and investigating the kinematics of sediment wave propagation in gravel-bed rivers."}]}]}]}]}}