{"pii": "S0167739X24001249", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e589", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e590"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e592", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e593", "view": "all"}, "_": "In the Industry 4.0 era, Digital Twins (DTs) serve as virtual representations of physical objects and intermediaries between the physical world and the digital realm. DTs require proper modeling, design, and development to ensure their seamless integration along the cloud-to-edge continuum. In particular, this work introduces a microservices-based and serverless-ready model for DTs, laying the foundation for cost-effective DT deployment and orchestration. The joint adoption of microservices and serverless computing offers significant potential to address various challenges, including accommodating variable application requirements, managing load imbalances, and mitigating network faults. The proposed DT model has been implemented in different flavors: two serverless implementations—one that relies on a serverless framework of a cloud provider and one running at the edge on-premises—and a microservices one. These implementations have been experimentally evaluated with particular emphasis on the quality of cyber–physical entanglement. This work not only discusses the advantages and drawbacks of different implementations from a qualitative perspective but also quantitatively evaluates them with the in-the-field collection of experimental performance results. Notably, we report that a serverless implementation typically performs an order of magnitude worse than a microservices one in terms of entanglement, i.e., hundreds vs. tens of milliseconds."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e595", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e596"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e598", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e599", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e601"}, "$$": [{"#name": "list-item", "$": {"id": "d1e602"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e605", "view": "all"}, "_": "We model DTs to ensure their integration in the cloud-to-edge continuum."}]}, {"#name": "list-item", "$": {"id": "d1e607"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e610", "view": "all"}, "_": "We propose a microservices-based and serverless-ready model for DTs."}]}, {"#name": "list-item", "$": {"id": "d1e612"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e615", "view": "all"}, "_": "We orchestrate and manage DTs driven by metrics designed for industrial environments."}]}]}]}]}]}]}}