{"pii": "S016578362400136X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0040", "view": "all"}, "$$": [{"#name": "__text__", "_": "Seismic studies are conducted to investigate subterranean structures for, among other things, indications of petroleum and mineral deposits. Within the marine environment, these studies use sub-surface airguns to create powerful sound waves that penetrate the substrate, with their variable reflection time and strength being used to model seabed densities, structure, and composition. There is a growing body of work examining the effects of seismic surveys on marine fauna, primarily marine mammals and to a lesser extent fishes and invertebrates. Recently published studies on the southern rock lobster have shown these intense sound waves can affect lobster physiology and short-term behaviour. Little is known, however, on how these impacts affect their medium to longer-term survival in the wild and thus the broader stock-level implications"}, {"#name": "bold", "_": "."}, {"#name": "__text__", "_": " To investigate this, resident western rock lobster ("}, {"#name": "italic", "_": "Panulirus cygnus"}, {"#name": "__text__", "_": ") within the centre of the western rock lobster fishery were subjected to a commercial application of seismic airguns. Spaghetti-tagged rock lobsters were deployed in cages along the airgun transects in ∼ 5 m (treatment) water depth, with an equal number of tagged lobsters also being deployed 10 km to the north of the seismic survey area in the same habitat and type of cages (control). Lobsters exposed to the airguns displayed short-term changes in behaviour associated with predator avoidance. In the medium term, although based on an overall low recapture rate (∼18 %), fewer exposed lobsters were recaught by commercial fishers, with this differential recapture rate persisting over the subsequent two years. This study has shown that the seismic survey conducted in this area would have impacted the catch rates and profitability of commercial fishers operating in this region."}]}]}]}]}}