{"pii": "S0161475414002668", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Objective"}, {"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The aim of this study was to construct PubMed search strings that could efficiently retrieve studies on manual therapy (MT), especially for time-constrained clinicians."}]}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0015"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Our experts chose 11 Medical Subject Heading terms describing MT along with 84 additional potential terms. For each term that was able to retrieve more than 100 abstracts, we systematically extracted a sample of abstracts from which we estimated the proportion of studies potentially relevant to MT. We then constructed 2 search strings: 1 narrow (threshold of pertinent articles ≥"}, {"#name": "hsp", "$": {"sp": "0.10"}}, {"#name": "__text__", "_": "40%) and 1 expanded (including all terms for which a proportion had been calculated). We tested these search strings against articles on 2 conditions relevant to MT (thoracic and temporomandibular pain). We calculated the number of abstracts needed to read (NNR) to identify 1 potentially pertinent article in the context of these conditions. Finally, we evaluated the efficiency of the proposed PubMed search strings to identify relevant articles included in a systematic review on spinal manipulative therapy for chronic low back pain."}]}]}, {"#name": "abstract-sec", "$": {"id": "as0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "sp0015", "view": "all"}, "_": "Fifty-five search terms were able to extract more than 100 citations. The NNR to find 1 potentially pertinent article using the narrow string was 1.2 for thoracic pain and 1.3 for temporomandibular pain, and the NNR for the expanded string was 1.9 and 1.6, respectively. The narrow search strategy retrieved all the randomized controlled trials included in the systematic review selected for comparison."}]}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0025"}, "_": "Conclusion"}, {"#name": "simple-para", "$": {"id": "sp0020", "view": "all"}, "_": "The proposed PubMed search strings may help health care professionals locate potentially pertinent articles and review a large number of MT studies efficiently to better implement evidence-based practice."}]}]}]}}