{"pii": "S016636152200094X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0060", "view": "all"}, "_": "While millions of scanned engineering drawings are received every year, the online quotation companies for custom mechanical parts have experienced a surging need to increase their processing efficiency by replacing the currently manual inspection process with an automatic system. Previous work has used traditional, and data-driven computer-vision approaches to detect symbols and text information from the drawings. However, there lacks a unified framework to determine the associated manufacturing processes as a critical step for realizing an automatic quoting system. In this paper, we propose a computational framework to automatically determine the manufacturing method appropriate to produce each queried engineering drawing, such as lathing, sheet metal bending, and milling. We present a data-driven framework that directly processes the raster images with a series of pre-processing steps and accurately determines the corresponding manufacturing methods for the queried part with a graph neural network. We propose a novel line tracing algorithm to transform complex geometries in engineering drawings into vectorized line segments with minimal information loss. To extract the shape contours, we use an efficient image segmentation network to remove the information tables, followed by a sequential graph neural network to detect and eliminate dimension lines. Finally, we propose a novel graph neural network with updated graph connections to hierarchically distill graph descriptors and classify the engineering drawing by its appropriate manufacturing method. Our framework has been validated on industry datasets. We verify that our framework can effectively classify the engineering drawings with an accuracy of 90.78%. We further assess our framework by comparing it against state-of-the-art image classification algorithms(+17.20%)."}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0065", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "The article presents a data-driven approach to sort engineering drawings by manufacturing process for e-commerce platforms."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "We propose a drawing vectorization scheme to tackle information sparsity problem inherent to engineering drawings."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "We used industry-sourced engineering drawings from rapid-prototyping firms."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "We used graph neural network to detect geometric relationships among the line segments."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "The results showed increased classification success rate."}]}]}]}]}]}]}}