{"pii": "S0167739X24005326", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e831", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e832"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e834", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e835", "view": "all"}, "_": "Web 3.0 is a grand design with intricate data interchange, implying the requirement of versatile network protocol to ensure its security. Attribute-based signature (ABS) allows a user, who is featured with a set of attributes, to sign messages under a predicate. The validity of the ABS signature demonstrates that this signature is generated by the user whose attributes satisfy the corresponding predicate, and thus flexibly achieves anonymous authentication. Similar to other digital signatures, the security of ABS is broken in case the private key of the user is leaked out. To address the threat brought by the key leakage, this paper proposes a puncturable attribute-based signature scheme that allows the private key generator to revoke the signing right associated with specific tags. This paper firstly elaborates the construction of the proposed ABS scheme with puncturable property, and then proves its security theoretically by reducing the involved security to the computational Diffie–Hellman assumption. This paper then experimentally shows that the suggested puncturable ABS scheme owns a more efficient storage cost and superior performance."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e837", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e838"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e840", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e841", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e843"}, "$$": [{"#name": "list-item", "$": {"id": "d1e844"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e847", "view": "all"}, "_": "We resolved the latent risks concerning security and privacy in Web 3.0."}]}, {"#name": "list-item", "$": {"id": "d1e849"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e852", "view": "all"}, "_": "A puncturable ABS scheme with privacy prevention and resilience to key leakage attack."}]}, {"#name": "list-item", "$": {"id": "d1e854"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e857", "view": "all"}, "_": "The scheme is based on Diffie Hellman assumption, and it has high efficiency."}]}]}]}]}]}]}}