{"pii": "S0167739X20304830", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e1078"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1079"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e1081"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e1082"}, "_": "Spatial clustering is a widely used data mining method for discovery of spatial aggregation pattern. However, existing methods often neglect scale dependence, impeding the full recognition of point patterns and the detection of hierarchical spatial structures. Spatial clustering is scale dependent and linked to the size of analysis unit as well as the hierarchy of visual cognition. Therefore, this paper proposes a novel multi-scale grid clustering (MSGC) algorithm, which fuses dual scale factors, i.e., analytical scale and visual scale that sequentially integrates multi-analytical-scale clustering (MASC) and multi-visual-scale clustering (MVSC). MASC generates multi-granularity grids to transform the analytical scales, and MVSC extracts multi-level clusters to express the hierarchy of visual cognition. Comparative experiments validated the proposed algorithm against the classical Density-based Spatial Clustering of Applications with Noise (DBSCAN) and WaveCluster algorithms on both synthetic and real-world geographic datasets. The results demonstrate that MSGC can generate multi-scale clusters for increased understanding of the spatial aggregation patterns and hierarchical structures of geographic entities. Moreover, it can eliminate noise adaptively and effectively identify clusters with arbitrary shapes. Due to the nature of grid clustering, the low computational complexity enables near real-time visual analytics and efficient point pattern mining on large spatial datasets."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e1086"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1087"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e1089"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e1090"}, "$$": [{"#name": "list", "$": {"id": "d1e1092"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1093"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1096"}, "_": "Proposed a dual scale driven grid-clustering algorithm to model the scale effects."}]}, {"#name": "list-item", "$": {"id": "d1e1098"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1101"}, "_": "Simulated the process of visual cognition when observing massive clusters."}]}, {"#name": "list-item", "$": {"id": "d1e1103"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1106"}, "_": "Designed a modified noise curve analytic method using a convexity index."}]}, {"#name": "list-item", "$": {"id": "d1e1108"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1111"}, "_": "Explored the spatial hierarchies of the experimental datasets."}]}, {"#name": "list-item", "$": {"id": "d1e1113"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1116"}, "_": "It can support efficient point pattern mining on large spatial datasets."}]}]}]}]}]}]}}