{"pii": "S0166361523000210", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0045", "view": "all"}, "_": "In the era of Industry 4.0 and digitalization, planning solutions need to co-exist with each other and be able to manage higher complexity and with a higher performance. As the concept smart production planning and control is a part of industry 4.0, it is highly relevant to study and is in this paper explored on the four elements of smart PPC (real-time data management, dynamic production planning and re-planning, autonomous production control, and continuous learning). This paper provides a framework for linking the four elements of smart PPC with data quality issues in state-of-the-art production planning and control environments. Maintaining a high standard of data quality in the business processes aids the organization to stay competitive in its market. Hence, our assumption is that a high level of data quality is needed in production planning and control for a high-performance outcome. The empirical part of our study results in a bar-chart of seven data quality problems and their occurrences together with their causes in PPC. According to the empirical data results, inaccurate data entries is the most common data quality problem related to PPC. The causes of the inaccurate data entries can be linked to human resources and organizational control. Future research should strengthen the validity of the proposed linkages between data quality problems and elements of smart PPC and implications on strategic, tactical, and operational planning levels."}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0050", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "A framework with proposed linkages between elements of smart PPC and data quality problems in PPC environments."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "A fish-bone diagram shows the causes of bad data quality."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "A bar-chart visualizing seven data quality problems and their occurrences in state-of-the-art PPC."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "“Inaccurate data entries” is the most common data quality problem related to state-of-the-art PPC."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Causes of inaccurate data entries can be linked to human resources and organizational control."}]}]}]}]}]}]}}