{"pii": "S0166361523001343", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e276", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e277"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e279", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e280", "view": "all"}, "_": "Nowadays, manufacturing systems are increasingly embracing the Industry 4.0 paradigm. Therefore, manual and low-standardized manufacturing environments are often digitized through Industrial Internet of Things technologies to quantitatively assess and investigate the role of the human factor from multiple points of view. This approach is commonly known as Operator 4.0. In such a scenario, this manuscript proposes an original digital architecture to monitor the efficiency and the social sustainability of labor-intensive manufacturing job shops. While the anonymous spatio-temporal trajectories of tagged workers are acquired through an ultrawide band radio network, machine learning algorithms autonomously detect the human-process interactions with strategic industrial entities upon developing industrial key performing indicators. The proposed architecture is tested and validated in a real manual manufacturing system. In detail, the performing accuracies of the machine learning-based software provide industrial plant supervisors with several production metrics to identify the hidden weaknesses and bottlenecks of the monitored manufacturing system. Such digital assessment may trigger a re-organization of the considered process to, for instance, enhance the allocation of the material in storage areas while fairly re-balancing the distances traveled by workers for picking activities."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e282", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e283"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e285", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e286", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e288"}, "$$": [{"#name": "list-item", "$": {"id": "d1e289"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e292", "view": "all"}, "_": "Original digital architecture to enhance efficiency of manual manufacturing job shop"}]}, {"#name": "list-item", "$": {"id": "d1e294"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e297", "view": "all"}, "_": "UWB indoor positioning system to anonymously acquire workers trajectories over shift"}]}, {"#name": "list-item", "$": {"id": "d1e299"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e302", "view": "all"}, "_": "Learning algorithms to detect human-process interactions with industrial entities"}]}, {"#name": "list-item", "$": {"id": "d1e304"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e307", "view": "all"}, "_": "Validation in a real and operating manufacturing job shop of a European company"}]}, {"#name": "list-item", "$": {"id": "d1e309"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e312", "view": "all"}, "_": "Industrial dashboard to assess efficiency and social sustainability of processes"}]}]}]}]}]}]}}