{"pii": "S0167639324001171", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e3551", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e3552"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e3554", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e3555", "view": "all"}, "_": "Speakers continuously monitor their own speech to optimize fluent production, but the precise timing and underlying variables influencing speech monitoring remain insufficiently understood. Through two EEG experiments, this study aimed to provide a comprehensive temporal map of monitoring processes ranging from speech planning to articulation."}, {"#name": "simple-para", "$": {"id": "d1e3557", "view": "all"}, "_": "In both experiments, participants were primed to switch the consonant onsets of target word pairs read aloud, eliciting speech errors of either lexical or articulatory-phonetic (AP) origin. Experiment I used pairs of the same stimuli words, creating lexical or non-lexical errors when switching initial consonants, with the degree of shared AP features not fully balanced but considered in the analysis. Experiment II followed a similar methodology but used different words in pairs for the lexical and non-lexical conditions, fully orthogonalizing the number of shared AP features."}, {"#name": "simple-para", "$": {"id": "d1e3559", "view": "all"}, "_": "As error probability is higher in trials primed to result in lexical versus non-lexical errors and AP-close compared to AP-distant errors, more monitoring is required for these conditions. Similarly, error trials require more monitoring compared to correct trials. We used high versus low error probability on correct trials and errors versus correct trials as indices of monitoring."}, {"#name": "simple-para", "$": {"id": "d1e3561", "view": "all"}, "_": "Across both experiments, we observed that on correct trials, lexical error probability effects were present during initial stages of speech planning, while AP error probability effects emerged during speech motor preparation. In contrast, error trials showed differences from correct utterances in both early and late speech motor preparation and during articulation. These findings suggest that (a) response conflict on ultimately correct trials does not persist during articulation; (b) the timecourse of response conflict is restricted to the time window during which a given linguistic level is task-relevant (early on for response appropriateness-related variables and later for articulation-relevant variables); and (c) monitoring during the response is primarily triggered by pre-response monitoring failure. These results support that monitoring in language production is temporally distributed and rely on multiple mechanisms."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e3563", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e3564"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e3566", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e3567", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e3569"}, "$$": [{"#name": "list-item", "$": {"id": "d1e3570"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e3573", "view": "all"}, "_": "Distinct EEG effects of lexical and articulatory-phonetic error probability were observed before articulation."}]}, {"#name": "list-item", "$": {"id": "d1e3575"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e3578", "view": "all"}, "_": "Processes linked to meaning surfaced earlier than those tied to form."}]}, {"#name": "list-item", "$": {"id": "d1e3580"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e3583", "view": "all"}, "_": "EEG effects of overt errors vs. correct trials were observed both before and after articulation."}]}, {"#name": "list-item", "$": {"id": "d1e3585"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e3588", "view": "all"}, "_": "Monitoring is temporally distributed and could involve multiple mechanisms."}]}]}]}]}]}]}}