{"pii": "S0167739X22003235", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e548"}, "$$": [{"#name": "section-title", "$": {"id": "d1e549"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e551"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e552"}, "_": "The advent of virtualization and cloud computing has fundamentally changed how distributed applications and services are deployed and managed. With the proliferation of IoT and mobile devices, virtualized systems akin to those offered by cloud providers are increasingly needed geographically near the network’s edge to perform processing tasks in proximity to the data sources and sinks. Latency-sensitive, bandwidth-intensive applications can be decomposed into workflows that leverage resources at the edge — a model referred to as fog computing. Not only is performance important, but a trustworthy network is fundamental to guaranteeing privacy and integrity at the network layer. This paper describes Bounded Flood, a novel technique that enables virtual private Ethernet networks that span edge and cloud resources — including those constrained by NAT and firewall middleboxes. Bounded Flood builds upon a scalable structured peer-to-peer overlay, and is novel in how it integrates overlay tunnels with SDN software switches to create a virtual network with dynamic membership — supporting unmodified Ethernet/IP stacks to facilitate the deployment of edge applications. Bounded Flood has been implemented as the core of the EdgeVPN open-source virtual private network software system for edge computing. Experiments with the software demonstrate its functionality and scalability — one of which includes Kubernetes with Flannel across Raspberry Pi 4 edge devices behind different NATs."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e554"}, "$$": [{"#name": "section-title", "$": {"id": "d1e555"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e557"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e558"}, "$$": [{"#name": "list", "$": {"id": "d1e560"}, "$$": [{"#name": "list-item", "$": {"id": "d1e561"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e564"}, "_": "Peer-to-peer overlay self-organizes Ethernet virtual private network"}]}, {"#name": "list-item", "$": {"id": "d1e566"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e569"}, "_": "Native edge-to-edge traversal of Network Address Translators (NATs)"}]}, {"#name": "list-item", "$": {"id": "d1e571"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e574"}, "_": "Bounded flood software-defined networking enables scalable broadcasting"}]}, {"#name": "list-item", "$": {"id": "d1e576"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e579"}, "_": "Virtual network supports unmodified Kubernetes Flannel edge/cloud middleware"}]}]}]}]}]}]}}