{"pii": "S0164121224001006", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1112", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1113"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1115", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1116", "view": "all"}, "_": "Microservices-based Architectures (MSAs) are gaining popularity since, among others, they enable rapid and independent delivery of software at scale, facilitating the delivery of business value. Additionally, there are attempts towards understanding practitioners’ roles and technical knowledge. MSAs call for affinity in several technologies as well as business domains. This diversity makes it challenging to scope and describe the roles of practitioners. In addition, practitioners often do not receive training and contents of MSA training remain largely undefined, even though there are challenges in finding or developing relevant technical expertise. In this research, we determine the different technical roles that are required in MSAs, along with their detailed competences. We use public online forums (e.g., StackOverflow), where developers share technical knowledge. We analyze 13,517 public profiles of software engineers, deriving their technical competences. Our taxonomy of technical competences in MSAs, contains 11 competences clusters, organized in 3 collections of competences — Web Technologies, DevOps, and Data Technologies. In addition, we derive the roles of microservice practitioners and the characteristics of their roles. Our findings organize the technical competences of MSAs practitioners and determine the training topics and combination of topics that can prepare engineers for MSAs."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1118", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1119"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1121", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1122", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1124"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1125"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1128", "view": "all"}, "_": "Identified 3 collections and 11 clusters of competences of microservice practitioners."}]}, {"#name": "list-item", "$": {"id": "d1e1130"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1133", "view": "all"}, "_": "Microservices require Web-based software, DevOps, and Data engineers."}]}, {"#name": "list-item", "$": {"id": "d1e1135"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1138", "view": "all"}, "_": "Enriching microservices research by understanding profiles of 13,517 practitioners."}]}, {"#name": "list-item", "$": {"id": "d1e1140"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1143", "view": "all"}, "_": "API, service integration, fullstack dev, monitoring & CI/CD are essential competences."}]}]}]}]}]}]}}