{"pii": "S0160412019337742", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "id": "ab005", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Increasingly, evidence suggests the Arctic is becoming a “sink” for microplastics and fibers."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Economic hardship is the primary challenge in managing waste plastics in Arctic communities."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Linear economic systems that move goods to the Arctic result in linear material flows and contribute to plastic leakage."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Plastic marine pollution in the Arctic today illustrates the global distribution of plastic waste of all sizes traveling by wind and waves, entering food chains, and presenting challenges to management and mitigation. While currents move plastics from lower latitudes into the Arctic, significant waste is also generated by remote communities, as well as maritime activities, such as shipping, fishing and tourism, which are increasing their activities as seasonal sea ice diminishes. Mitigation strategies may include monitoring programs of plastic waste abundance and distribution, improved waste management in Arctic communities, Extended Producer Responsibility (EPR) to reverse the transport of waste plastics and packaging from remote communities, incentivized gear recovery of abandoned, lost and discarded fishing gear (ALDFG), gear tagging and tracking, and restricting tourism and employing “leave no trace” policies. Here we report how these mitigation strategies are employed in the Arctic to minimize plastic waste impacts, and move Arctic communities toward better materials management and circular economic practices. The evidence of harm from waste plastics exacerbated by the ubiquity of plastic marine pollution in all biomes, and the rapid reporting of ecological and social costs, together suggest that we know enough to act quickly to manage and mitigate plastics from all sources to the Arctic."}]}]}]}}