{"pii": "S0160412022000320", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The carcinogenicity of radiofrequency electromagnetic fields (RF EMF) has been evaluated by the International Agency for Research on Cancer (IARC) in 2011. Based on limited evidence of carcinogenicity in humans and in animals, RF EMF were classified as possibly carcinogenic to humans (Group 2B). In 2018, based on a survey amongst RF experts, WHO prioritized six major topics of potential RF EMF related human health effects for systematic reviews. In the current manuscript, we present the protocol for the systematic review of experimental laboratory animal studies (cancer bioassays) on exposure to RF fields on the outcome of cancer in laboratory animals."}]}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st015"}, "_": "Objective"}, {"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "In the framework of WHO’s Radiation Program, the aim of this work is to systematically evaluate effects of RF EMF exposure on cancer in laboratory animals."}]}, {"#name": "abstract-sec", "$": {"id": "as015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st020"}, "_": "Study eligibility and criteria"}, {"#name": "simple-para", "$": {"id": "sp0015", "view": "all"}, "_": "WHO's Handbook (2014) for guideline development will be followed with appropriate adaptation. The selection of eligible studies will be based on Population, Exposures, Comparators, and Outcomes (PECO) criteria. We will include peer-reviewed articles and publicly available reports from government agencies reporting original data about animal cancer bioassays on exposure to RF EMF. The studies are identified by searching the following databases: MEDLINE (PubMed), Science Citation Index Expanded and Emerging Sources Citation Indes (Web of Science), Scopus, and the EMF Portal. No language or year-of-publication restrictions are applied. The methods and results of eligible studies will be presented in accordance with the PRISMA 2020 guidelines."}]}, {"#name": "abstract-sec", "$": {"id": "as020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st025"}, "_": "Study appraisal method"}, {"#name": "simple-para", "$": {"id": "sp0020", "view": "all"}, "$$": [{"#name": "__text__", "_": "Study evaluation of individual studies will be assessed using a risk of bias (RoB) tool developed by the Office of Health Assessment and Translation (OHAT) with appropriate considerations including sensitivity for evaluating RF EMF exposure in animal cancer bioassays. The final evaluation on the certainty of the evidence on a carcinogenic risk of RF EMF exposure in experimental animals will be performed using the OHAT "}, {"#name": "italic", "_": "Grading of Recommendations Assessment, Development and Evaluation"}, {"#name": "__text__", "_": " (GRADE) approach with appropriate considerations."}]}, {"#name": "simple-para", "$": {"id": "sp0025", "view": "all"}, "_": "The protocol has been registered in an open-source repository (PROSPERO)."}]}, {"#name": "abstract-sec", "$": {"id": "as025", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st030"}, "_": "Funding"}, {"#name": "simple-para", "$": {"id": "sp0030", "view": "all"}, "_": "The study is partly financially supported by the World Health Organization. No additional funding was provided outside author salaries through their places of employment."}]}]}]}}