{"pii": "S0167739X24000013", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1739", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1740"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1742", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1743", "view": "all"}, "_": "Modeling and predicting the behavior of nodes and users in blockchains provide opportunities for business strategy optimization. Indeed, the number of interactions of a node is strictly related to its balance and its prediction may be used for analytics purposes and investment strategies. However, the amount and diversity of information stored on the blockchain demand advanced tools for the modeling and analysis of blockchain data. Such tools should be able to capture the dynamicity and interaction of multiple independent actors, considering a large number of variables and dynamic interaction graph topologies. This is exacerbated by the use of smart contracts, programs stored in blockchain blocks that bring automation to blockchain’s operations and thus increasing the variability of the resulting interaction graphs. Existing modeling methodologies are unable to keep track of all these details, as they are not able to capture the temporal variability of the network."}, {"#name": "simple-para", "$": {"id": "d1e1745", "view": "all"}, "_": "In this paper, we propose a novel framework for modeling and predicting the behavior of smart contracts on a blockchain. We propose the concept of temporal smart contracts networks, i.e., graphs representing the temporal evolution of interactions and data flow. Our framework allows the creation of temporal smart contract networks with different granularity levels by considering different interaction patterns between smart contracts, externally owned accounts, and internal transactions. Thanks to these graphs, we are able to model features such as the node in degree and amount of ether received by a smart contract, which are directly related to its behavior. We incorporate our modeling approach in Ethereum Data Inspection Tool (EDIT), a novel tool able to model interactions and predict them based on historical data. We test different machine learning models to predict features extracted by EDIT, hence allowing for the prediction of the overall behavior of the smart contract. We test EDIT on the Ethereum blockchain and model several temporal smart contracts networks, which represent the interactions and the data flow resulting from about 4 000 000 consecutive blocks. The evaluation of different real case studies shows that the proposed framework is able to predict, with a mean absolute error close to 1%, the evolution of several interesting properties (e.g., amount of received ether) related to both accounts and smart contracts."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1747", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1748"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1750", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1751", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1753"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1754"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1757", "view": "all"}, "_": "A general framework for the modeling of the blockchain data is provided."}]}, {"#name": "list-item", "$": {"id": "d1e1759"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1762", "view": "all"}, "_": "The framework combines both flow of the interactions and temporal information."}]}, {"#name": "list-item", "$": {"id": "d1e1764"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1767", "view": "all"}, "_": "An Ethereum implementation is developed to validate the framework."}]}, {"#name": "list-item", "$": {"id": "d1e1769"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1772", "view": "all"}, "_": "The accuracy in predicting blockchain properties is measured on real use-cases."}]}]}]}]}]}]}}