{"pii": "S0167739X22001996", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e758"}, "$$": [{"#name": "section-title", "$": {"id": "d1e759"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e761"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e762"}, "_": "Wireless communications for IoT in smart cities may be affected by Non-Line-of-Sight (NLOS) propagation conditions due to obstacles such as buildings, trees, and others. LoRaWAN technology transmits information through several kilometers in one hop, from a source node to a gateway. However, packet reception decreases when the link has NLOS conditions and there are no alternative routes for packet delivery. This paper presents a LoRa implementation of MACGSP6, a Gossip-based routing algorithm, to improve communications in a LoRaWAN network where all nodes have NLOS conditions. The paper compares the packet delivery ratio of LoRaWAN and MACGSP6. Results show that packet delivery to the gateway increased from 0% with LoRaWAN to a minimum of 53% with the routing algorithm. Additionally, most packets were delivered using the shortest path available, even when the algorithm does not explicitly compute the routes, decreasing the delay associated with this process. Thus, the proposed solution is useful for IoT applications in smart cities, such as smart metering and structural health monitoring, where one relay node can forward the information of many other nodes."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e764"}, "$$": [{"#name": "section-title", "$": {"id": "d1e765"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e767"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e768"}, "$$": [{"#name": "list", "$": {"id": "d1e770"}, "$$": [{"#name": "list-item", "$": {"id": "d1e771"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e774"}, "_": "A communication system for smart city applications."}]}, {"#name": "list-item", "$": {"id": "d1e776"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e779"}, "_": "Nodes send information periodically to a LoRa gateway."}]}, {"#name": "list-item", "$": {"id": "d1e781"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e784"}, "_": "Implemented in a university campus with Non-Line-of-Sight conditions."}]}, {"#name": "list-item", "$": {"id": "d1e786"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e789"}, "_": "Results show that a Gossip-based protocol improves LoRaWAN performance."}]}]}]}]}]}]}}