{"pii": "S0168169924007762", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Recent application of soil and plant sensors."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Manufacturing of sensors for agriculture sector."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Nano-biotechnology-based sensors implement optical, wireless, or electrical signals for soil and plant development."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Advancement of smart/intelligent soil and plant sensors."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Sensors implemented in agriculture play a significant role in soil and plant growth and enable real-time physical and chemical interactions in the environment, such as temperature, moisture/humidity, pH, and contaminant levels. Additionally, these sensors provide essential data that can enhance crop growth scenarios, resist biotic and abiotic stresses, and improve crop production. This article provides a thorough examination of the evolving landscape of agricultural sensor technologies, perspectives, and challenges in the field. Currently, some of the key soil sensors used in agricultural programs, include those that measure moisture, temperatures, pH, organic matter components, insects, and soil pollutants. On the other hand, nanobiotechnology sensors implement optical, wireless, or electrical signals to provide information about plant signaling molecules related to the conditions of agronomic equipment. We shed more light on the use of nanomaterial-facilitated transport of genetically encoded sensors as devices for the investigation and advancement of advanced plant sensors. Innovative technologies, including wireless sensor networks and plant wearables, are also addressed with regard to their potential for precision agriculture. The paper concludes by presenting future perspectives and difficulties in the fields of soil sensors and intelligent agriculture. In summary, we provide a comprehensive and forward-looking perspective on the potential of nanotechnology to facilitate the development of intelligent plant sensors. These sensors are capable of communicating with and controlling electrical equipment, with the aim of tracking and improving the output and resources applied to individual plants."}]}]}]}}