{"pii": "S0167739X23000183", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e386"}, "$$": [{"#name": "section-title", "$": {"id": "d1e387"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e389"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e390"}, "$$": [{"#name": "__text__", "_": "Research process automation–the reliable, efficient, and reproducible execution of linked sets of actions on scientific instruments, computers, data stores, and other resources–has emerged as an essential element of modern science. We report here on new services within the Globus research data management platform that enable the specification of diverse research processes as reusable sets of actions, "}, {"#name": "italic", "_": "flows"}, {"#name": "__text__", "_": ", and the execution of such flows in heterogeneous research environments. To support flows with broad spatial extent (e.g., from scientific instrument to remote data center) and temporal extent (from seconds to weeks), these "}, {"#name": "italic", "_": "Globus automation services"}, {"#name": "__text__", "_": " feature: (1) cloud hosting for reliable execution of even long-lived flows despite sporadic failures; (2) a simple specification and extensible asynchronous action provider API, for defining and executing a wide variety of actions and flows involving heterogeneous resources; (3) an event-driven execution model for automating execution of flows in response to arbitrary events; and (4) a rich security model enabling authorization delegation mechanisms for secure execution of long-running actions across distributed resources. These services permit researchers to outsource and automate the management of a broad range of research tasks to a reliable, scalable, and secure cloud platform. We present use cases for Globus automation services, describe their design and implementation, present microbenchmark studies, and review experiences applying the services in a range of applications."}]}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e398"}, "$$": [{"#name": "section-title", "$": {"id": "d1e399"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e401"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e402"}, "$$": [{"#name": "list", "$": {"id": "d1e404"}, "$$": [{"#name": "list-item", "$": {"id": "d1e405"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e408"}, "_": "The research process automation problem, fundamental to modern science, is defined."}]}, {"#name": "list-item", "$": {"id": "d1e410"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e413"}, "_": "A research process automation approach based on cloud-hosted services is proposed."}]}, {"#name": "list-item", "$": {"id": "d1e415"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e418"}, "_": "New Globus automation services are described that implement this approach"}]}, {"#name": "list-item", "$": {"id": "d1e420"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e423"}, "_": "Benchmark results and experiences at large scientific instruments are reported."}]}]}]}]}]}]}}