{"pii": "S0167739X24000980", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e512", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e513"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e515", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e516", "view": "all"}, "_": "We introduce Fluidity, a framework enabling the flexible and adaptive deployment of serverless and modular applications in systems comprising cloud, edge, and mobile nodes. Based on a declarative description of application requirements, a custom placement policy, and a formal system infrastructure description, Fluidity plans and executes an initial deployment of application components in the cloud–edge–mobile continuum. Furthermore, at runtime, Fluidity monitors resource availability and the position of mobile nodes, and adapts the deployment of the application accordingly, without any manual intervention from the application owner or system administrator. These characteristics render Fluidity an enabler for serverless applications, allowing the application developers to focus on the application code itself while abstracting out the infrastructure management. Notably, Fluidity permits developers to provide their own deployment and adaptation policies as well as to switch between different policies while the application is running. We discuss the design and implementation of Fluidity in detail and provide a realistic evaluation using a lab testbed in which the mobile node is represented as a simulated drone. In addition, we evaluate the scalability of the proposed mechanisms. Our results show that the core mechanisms of Fluidity can support flexible application execution at a reasonable overhead and experimentation with different deployment policies with minimal effort."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e518", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e519"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e521", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e522", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e524"}, "$$": [{"#name": "list-item", "$": {"id": "d1e525"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e528", "view": "all"}, "_": "Flexible deployment of serverless applications in the cloud–edge–IoT continuum."}]}, {"#name": "list-item", "$": {"id": "d1e530"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e533", "view": "all"}, "_": "Formal infrastructure and application descriptions."}]}, {"#name": "list-item", "$": {"id": "d1e535"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e538", "view": "all"}, "_": "Structured API to separate the deployment mechanism from the adaptation policies."}]}, {"#name": "list-item", "$": {"id": "d1e540"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e543", "view": "all"}, "_": "Plug-in and switch between different policies at runtime."}]}, {"#name": "list-item", "$": {"id": "d1e545"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e548", "view": "all"}, "_": "Scalability evaluation of the core Fluidity deployment and telemetry mechanisms."}]}]}]}]}]}]}}