{"pii": "S0167739X22000590", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e639"}, "$$": [{"#name": "section-title", "$": {"id": "d1e640"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e642"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e643"}, "_": "Peer-to-peer networks offer a solid foundation for wide-scale resource sharing, collaborative computing, and data distribution. Such networks have been commonly used for group communication by overlaying a publish/subscribe service atop their routing substrate. In this work, we focus on offering a group communication service that targets unstructured content such as images and videos for dissemination at internet scale. The decoupled nature of publish/subscribe systems exacerbated by the decentralized and large-scale nature of peer-to-peer networks brings about a semantic boundary between publishers and subscribers. More precisely, the large semantic space of human-level recognition creates a very large content space of object labels, attributes, and relationships. The scale of the content space makes it nearly impossible for participants to agree on a bounded set of terms for subscribers to express their exact interests. We identify an inherent limitation of peer-to-peer networks lying in the exact-match property of their key-based routing primitives. We propose an approximate matching model where participants agree on a distributional model of word meaning that maps terms to a vector space. We overcome the exact-match limitation by proposing a novel distributed lookup protocol and algorithm to construct a peer-to-peer network and route content. We replace conventional logical key spaces with a high-dimensional vector space that preserves the semantic properties of the data being mapped. Experiments show that the proposed model achieves more than 97% recall in routing accuracy, that is, locating a node responsible for storing a data item in a few routing hops. Furthermore, results also show that the network achieves over 90% recall in approximately matching two semantically related terms via rendezvous routing."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e645"}, "$$": [{"#name": "section-title", "$": {"id": "d1e646"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e648"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e649"}, "$$": [{"#name": "list", "$": {"id": "d1e651"}, "$$": [{"#name": "list-item", "$": {"id": "d1e652"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e655"}, "_": "We acheive loose semantic coupling in structured peer-to-peer networks based on DHTs."}]}, {"#name": "list-item", "$": {"id": "d1e657"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e660"}, "_": "We construct a semantic DHT where peers organize over a high-dimensional vector space."}]}, {"#name": "list-item", "$": {"id": "d1e662"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e665"}, "_": "The space is constructured via learning methods based on distributional semantics."}]}, {"#name": "list-item", "$": {"id": "d1e667"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e670"}, "_": "The space is partitioned into a traversable Dendrogram structure via hierarchical clustering."}]}]}]}]}]}]}}