{"pii": "S0167488921002391", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0075", "view": "all"}, "$$": [{"#name": "__text__", "_": "Emerging evidences suggest abundant expression of Carboxy terminus of Hsc70 Interacting Protein or CHIP (alias STIP1 Homology and U–box Containing Protein 1 or "}, {"#name": "italic", "_": "STUB1"}, {"#name": "__text__", "_": ") in colorectal carcinoma, but the mechanistic detail of this augmented expression pattern is unclear. The signature driver of canonical Wnt pathway, β-catenin, and its co-activator RNA helicase p68, are also overexpressed in colorectal carcinoma. In this study, we describe a novel mechanism of Wnt/β-catenin and p68 mediated transcriptional activation of CHIP gene leading to enhanced proliferation of colorectal carcinoma cells. Bioinformatic analyses reconfirmed an elevated CHIP expression level in colorectal carcinoma datasets. Wnt3A treatment and pharmacological activation of canonical Wnt signaling pathway resulted in increased nuclear translocation of β-catenin, augmenting CHIP expression. Likewise, immunoblotting and Real time PCR following overexpression and knockdown of β-catenin and p68 demonstrated upregulated and downregulated CHIP expression, respectively, at both mRNA and protein levels. p68 along with β-catenin were found to occupy Transcription Factor 4 (TCF4) binding sites on endogenous CHIP promoter and regulate its transcription. After cloning CHIP promoter, the increased and decreased promoter activities of CHIP induced by overexpression and knockdown of either β-catenin or p68 further confirmed transcriptional regulation of CHIP gene by Wnt/β-catenin signaling cascade. Finally, enhanced cellular propagation and migration of colorectal carcinoma cells induced by ‘Wnt/β-catenin-p68-CHIP’ axis established the significance of this pathway in oncogenesis. To the best of our knowledge, this is the first report elucidating the mechanistic details of transcriptional regulation of CHIP ("}, {"#name": "italic", "_": "STUB1"}, {"#name": "__text__", "_": ") gene expression."}]}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0080", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Wnt/β-catenin and p68 elevate CHIP mRNA and protein level in colorectal carcinoma cells."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "CHIP (STUB1) promoter cloned for promoter study."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "β-catenin and p68 occupy CHIP promoter and increase its transcription."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Wnt/β-catenin-p68–CHIP axis increases oncogenicity in colorectal carcinoma cells."}]}]}]}]}]}]}}