{"pii": "S0164121223002157", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e307"}, "$$": [{"#name": "section-title", "$": {"id": "d1e308"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e310"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e311"}, "_": "Computer-based visual recognition technology combined with deep learning enables accurate image matching through interactive, multi-level comparison. Currently, popular search methods such as RNN, Faster RNN, etc. are used in computer vision to compute image information by performing hierarchical comparison of image objects. In today’s machine learning is used to construct training curves to predict corresponding results, but the accuracy rate will cause some data distortion due to overformation. Therefore, to solve the problem of interference is now physical, the abandonment method is developed to extract certain neurons and reduce the number of feature values. In this study, a visual image recognition framework is designed that uses advanced computer technology to mark and compare images, and to mark and eliminate blurred images. The experimental method successfully improves the prediction of accuracy after a judgment error by comparing the results of training with the results of deep learning verification. The accuracy of matrix formation and result prediction can reach 0.9812 without eliminating the image produced by the light-emitting elements. We remove noisy images based on the same sampling information. After re-training and re-predicting, the accuracy can reach 0.9847."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e313"}, "$$": [{"#name": "section-title", "$": {"id": "d1e314"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e316"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e317"}, "$$": [{"#name": "list", "$": {"id": "d1e319"}, "$$": [{"#name": "list-item", "$": {"id": "d1e320"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e323"}, "_": "Improving visual arithmetic discrimination of ambiguous LED matrixed numbers."}]}, {"#name": "list-item", "$": {"id": "d1e325"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e328"}, "_": "Eliminate noise and improve clarity before visual recognition."}]}, {"#name": "list-item", "$": {"id": "d1e330"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e333"}, "_": "Improving the blurred image and causing the predicted dilemma to distort."}]}, {"#name": "list-item", "$": {"id": "d1e335"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e338"}, "_": "The accuracy of image analysis can reach 0.9847 after retraining and re-prediction."}]}]}]}]}]}]}}