{"pii": "S0165783623000309", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0080", "view": "all"}, "$$": [{"#name": "__text__", "_": "Sea trout (anadromous brown trout, "}, {"#name": "italic", "_": "Salmo trutta"}, {"#name": "__text__", "_": " L.) is a popular recreational angling target species in the Baltic Sea region and beyond. Across countries, a substantial part of angled sea trout is released after capture either due to management regulations or due to voluntary decisions by the anglers. However, information about post-release impacts of catch and release (C&R) on survival and growth in saline waters is largely missing. We used a flow-through seawater raceway (4–10 °C) to investigate impacts on survival and growth of angled and released sea trout (< 40 cm) up to 29 days post release. Bleeding was common among angled sea trout, but differed between angling treatments, i.e., lure fishing with treble hook (size 4), lure fishing with single hook (size 1/0) and fly fishing with single hook (size 12). However, no mortality and no significant differences in growth were found after a 26–29 days monitoring period among a control group and the three treatment groups, but a small subset (6%) of the angled fish caught on lure had unhealed/infected hooking wounds at the end of the experiment. The results infer that adverse effects of C&R on coastal sea trout due to high post-release mortality or reduced growth can be limited and may not pose a significant problem for sea trout stocks. Nevertheless, further studies are required to corroborate these results under more natural field conditions and at higher water temperatures. In addition, further studies on long-term sublethal impacts of C&R on sea trout are needed."}]}]}]}]}}