{"pii": "S0167923620300932", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0030", "view": "all"}, "_": "When an aircraft experiences an unexpected issue during flight operations, a technician determines whether the aircraft can safely perform the next flight. This operational decision process - known as dispatch assessment - has to happen within limited available time between aircraft arrival and departure. Currently, technicians face two main problems during the assessment: lack of access to decision support information and a time-consuming process for finding relevant information in extensive maintenance manuals. These issues often lead to delays and additional costs and are indicative of three larger challenges in the decision support domain: 1) a paucity of decision support models and applications for operational processes in maintenance; 2) relatively few efforts in applying and evaluating artifacts in experimental and real-life operational settings; and 3) a lack of systematic development, application and evaluation of digitization and automation efforts of complex decision processes in maintenance. This paper applies a design science research approach to address these challenges and introduces two novel artifacts: a decision support framework for real-time decision making in aircraft dispatch, and a web-based prototype tool accessible through mobile solutions. The practical relevance of the framework and prototype is validated through two representative application and evaluation studies, one in an experimental setting and one in an operational environment. Results show significant time savings and strong qualitative indications towards a higher incentive to use documentation and reducing human risk factors that lead to maintenance error."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0035", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Introduces a framework for real-time aircraft dispatch decision support."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Automates maintenance alternative identification, filtering and ranking."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "A web-based, mobile prototype evaluated in an operational environment."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Can reduce dispatch decision time by over 90% compared to the current process."}]}]}]}]}]}]}}