{"pii": "S0167404824003778", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "attachments", "$$": [{"#name": "attachment", "$": {"xmlns:xocs": true}, "$$": [{"#name": "attachment-eid", "_": "1-s2.0-S0167404824003778-si1.svg"}, {"#name": "ucs-locator", "_": "https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0167404824003778/image/svg+xml/c1f050342e1b5321bf4f801ad0953128/si1.svg"}, {"#name": "file-basename", "_": "si1"}, {"#name": "abstract-attachment", "_": "true"}, {"#name": "filename", "_": "si1.svg"}, {"#name": "extension", "_": "svg"}, {"#name": "filesize", "_": "3523"}, {"#name": "attachment-type", "_": "ALTIMG"}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "d1e251", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e252"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e254", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e255", "view": "all"}, "$$": [{"#name": "__text__", "_": "Vulnerabilities and Trojans in hardware design may cause sensitive data to be leaked and tampered. Information flow tracking technology can effectively verify the confidentiality and integrity of hardware design. Currently, this technology mainly analyzes the reachability of information flow and lacks fine-grained analysis of information flow paths. It is difficult to find structural defects in information flow paths and malicious sensitive information processes in hardware design. To solve above problem, we propose Path-aware Dynamic Information Flow Tracking (PDIFT) technology, which performs taint tracking and path tracking while sensitive information is propagated. It analyzes the propagation of sensitive information in hardware design with fine-grained taint label propagation logic and inserts path label propagation logic only on basic blocks divided by branch nodes, which greatly simplifies the path tracing overhead compared to the full node sequence tracing on the path. Experiments have shown that compared to CellIFT, PDIFT has a 12.1% increase in static analysis time and a 0.1% increase in dynamic validation time. The average instrumentation area cost of each basic block has increased by 16.4 "}, {"#name": "math", "$": {"xmlns:mml": true, "altimg": "si1.svg", "display": "inline", "id": "d1e258"}, "$$": [{"#name": "msup", "$$": [{"#name": "mrow", "$$": [{"#name": "mi", "$": {"mathvariant": "normal"}, "_": "um"}]}, {"#name": "mrow", "$$": [{"#name": "mn", "_": "2"}]}]}]}, {"#name": "__text__", "_": ". In terms of detection capability, PDIFT makes up for the limitation of false negatives in traditional taint tracking technology through joint analysis of path labels and taint labels, then detect problems such as insufficient iterations of encryption components and malicious processing of important assets, thereby improving the accuracy of hardware security verification."}]}]}]}]}}