{"pii": "S0167739X24000967", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1724", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1725"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1727", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1728", "view": "all"}, "_": "The dark web has become notorious for its association with illicit activities and there is a growing need for systems to automate the monitoring of this space. This paper proposes an end-to-end scalable architecture for the continuous early identification of new Tor sites and the daily analysis of their content. The solution is built using an Open Source Big Data stack for data serving with Kubernetes, Kafka, Kubeflow, and MinIO, continuously discovering onion addresses in different sources (threat intelligence, code repositories, web-Tor gateways, and Tor repositories), downloading the HTML from Tor and deduplicating the content using MinHash LSH, and categorizing with the BERTopic modeling (SBERT embedding, UMAP dimensionality reduction, HDBSCAN document clustering and c-TF-IDF topic keywords). In 93 days, the system identified 80,049 onion services and characterized 90% of them, addressing the challenge of Tor volatility. A disproportionate amount of repeated content is found, with only 6.1% unique sites. From the HTML files of the dark sites, 31 different low-topics are extracted, manually labeled, and grouped into 11 high-level topics. The five most popular included sexual and violent content, repositories and search engines, carding, cryptocurrencies, and marketplaces. During the experiments, we identified 14 sites with 13,946 clones that shared a suspiciously similar mirroring rate per day, suggesting an extensive common phishing network. Among the related works, this study is the most representative characterization of onion services based on topics to date."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1730", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1731"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1733", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1734", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1736"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1737"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1740", "view": "all"}, "_": "Developed an Open Source Big Data architecture for analyzing Tor onion services."}]}, {"#name": "list-item", "$": {"id": "d1e1742"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1745", "view": "all"}, "_": "Used near real-time ingestion to extract onion addresses from four types of sources."}]}, {"#name": "list-item", "$": {"id": "d1e1747"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1750", "view": "all"}, "_": "Deployed a daily batch pipeline to preprocess, deduplicate and categorize Tor pages."}]}, {"#name": "list-item", "$": {"id": "d1e1752"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1755", "view": "all"}, "_": "Employed BERTopic modeling to classify 72,045 onion services."}]}, {"#name": "list-item", "$": {"id": "d1e1757"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1760", "view": "all"}, "_": "Most representative categorization of Tor sites in the literature."}]}]}]}]}]}]}}