{"pii": "S0167923623002245", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0080", "view": "all"}, "_": "Travel location recommendation systems have long been used by travellers for their ability to suggest destinations and potential travel experiences that match travellers' desires. Recently, a new type of domestic travel has emerged, namely domestic overseas-like travel experiences. These experiences are attractive to travellers who have a preference for exotic locations but no desire to travel internationally. Existing travel recommendation systems were not designed for such applications, nor do they have the relevant ability to recommend domestic overseas-like travel experiences to support travel decision making. To address this challenge, this paper focuses on the development of a recommendation model based on the visual content of photos for domestic overseas-like travel experiences and a prototype application. The application uses the latest advancement in computer vision — the concept model — to learn high-level concepts in an overseas travel destination photo collection to identify similar domestic travel experiences. We demonstrate the usability of the prototype application with a large-scale data set of approximately 479,000 travel photos taken in several countries and evaluate its utility and efficacy through four focus groups with target users."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0085", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Travel recommendation systems can suggest destinations to meet travellers' desires."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Current recommendation models mainly rely on travellers' past travel behaviours."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Domestic overseas-like travel experiences were not supported by any recommendation models."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "We built a recommendation model to support travel decision-making."}]}, {"#name": "list-item", "$": {"id": "li0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "We used a computer vision-based concept model to suggest domestic overseas-like travel experiences."}]}]}]}]}]}]}}