{"pii": "S0164121223002509", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e944", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e945"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e947", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e948", "view": "all"}, "_": "Data pipelines are an integral part of various modern data-driven systems. However, despite their importance, they are often unreliable and deliver poor-quality data. A critical step toward improving this situation is a solid understanding of the aspects contributing to the quality of data pipelines. Therefore, this article first introduces a taxonomy of 41 factors that influence the ability of data pipelines to provide quality data. The taxonomy is based on a multivocal literature review and validated by eight interviews with experts from the data engineering domain. Data, infrastructure, life cycle management, development & deployment, and processing were found to be the main influencing themes. Second, we investigate the root causes of data-related issues, their location in data pipelines, and the main topics of data pipeline processing issues for developers by mining GitHub projects and Stack Overflow posts. We found data-related issues to be primarily caused by incorrect data types (33%), mainly occurring in the data cleaning stage of pipelines (35%). Data integration and ingestion tasks were found to be the most asked topics of developers, accounting for nearly half (47%) of all questions. Compatibility issues were found to be a separate problem area in addition to issues corresponding to the usual data pipeline processing areas (i.e., data loading, ingestion, integration, cleaning, and transformation). These findings suggest that future research efforts should focus on analyzing compatibility and data type issues in more depth and assisting developers in data integration and ingestion tasks. The proposed taxonomy is valuable to practitioners in the context of quality assurance activities and fosters future research into data pipeline quality."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e950", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e951"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e953", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e954", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e956"}, "$$": [{"#name": "list-item", "$": {"id": "d1e957"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e960", "view": "all"}, "_": "41 factors influencing the quality of data pipelines were identified."}]}, {"#name": "list-item", "$": {"id": "d1e962"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e965", "view": "all"}, "_": "Data-related issues mainly occur in the data cleaning stage of pipelines."}]}, {"#name": "list-item", "$": {"id": "d1e967"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e970", "view": "all"}, "_": "Data-related issues are mainly caused by incorrect data types."}]}, {"#name": "list-item", "$": {"id": "d1e972"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e975", "view": "all"}, "_": "Data integration and ingestion are the most challenging topics for developers."}]}, {"#name": "list-item", "$": {"id": "d1e977"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e980", "view": "all"}, "_": "Compatibility issues are a of concern in all data pipeline stages."}]}]}]}]}]}]}}