{"pii": "S0187358X16300636", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "ABSTRACT"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "With the development of Web 2.0 and information technologies, new models of production, distribution and consumption of information have emerged. This study examines the changes undergone in information access for both general users and information professionals. The study's approach is informed by Kuhn's contention regarding the priority of paradigms, in which neophyte professionals will adopt emerging practices without questioning their causes or origins. This hypothesis is tested by way of Rifkin's postulates on the network economy and those proffered by Vargas Llosa regarding the metamorphosis of written culture for the network. The results presented are derived from the project "}, {"#name": "small-caps", "_": "papiit it"}, {"#name": "__text__", "_": " 312 400 Digital Library in library science and information studies."}]}]}]}, {"#name": "abstract", "$": {"id": "abs0010", "lang": "es", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "RESUMEN"}, {"#name": "abstract-sec", "$": {"id": "abst0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "El título del estudio sugiere que con el desarrollo de la Web 2.0 y las tecnologías de la información han surgido nuevos modelos de producción, distribución y consumo de información. De ahí que el propósito del trabajo sea examinar los cambios que se han suscitado en el acceso a la información tanto para usuarios como para profesionales de la información. La tesis del estudio centra su atención en los señalamientos de Kuhn respecto a la prioridad de los paradigmas, la cual refiere que los nuevos profesionales adoptarán las prácticas emergentes sin cuestionar las causas que le dieron origen. La comprobación se hace por medio de los postulados de Rifkin sobre la economía-red y los vertidos por Vargas Llosa con relación a la metamorfosis de la cultura escrita para la red. Los resultados que se presentan en el estudio se derivan del proyecto "}, {"#name": "small-caps", "_": "papiit it"}, {"#name": "__text__", "_": " 400 312 Biblioteca Digital en Bibliotecología y Estudios de la Información."}]}]}]}]}}