{"pii": "S0198971523001229", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0050", "view": "all"}, "_": "Bicycling can improve the sustainability and liveability of cities, many of which desperately require better active transport infrastructure. Urban and transport planners need to examine how improvements in infrastructure change bicyclists' behaviour. With this knowledge, investment in bicycling networks can be more efficient and encourage the use of bicycling for transportation. This study developed a simple Agent-Based Model (ABM) to simulate bicyclists' movements in response to the built environment and road network characteristics in the City of Penrith, in the Greater Sydney Area, Australia. In this case study, the GAMA platform was used to build the ABM and Strava and Riderlog data were used to calibrate and validate the model. The model outputs give insights into bicyclist movements through the road network. The incorporated built environment characteristics include the type of bicycling infrastructure, tree canopy, slope, land use mix, and vehicle traffic. These choice factors also allowed the computation of rider levels of comfort and safety on each trip. Potential refinements of the model include additional bicycling behaviour factors (such as aesthetic preferences), and bicyclists' interactions with each other and other modes of transport."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0055", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Developing an Agent-Based Model (ABM) as a digital tool to support planning bicycling infrastructure networks."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Extensive literature review of built environment factors affecting bicycling movement."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Developing methods to validate and calibrate ABM using crowdsourced data like STRAVA and Riderlog."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Calibrating the model factors and equations using bicyclists' movement in Sydney's urban context."}]}]}]}]}]}]}}