{"pii": "S0191261524000122", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e877", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e878"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e880", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e881", "view": "all"}, "_": "In dynamic traffic assignment problems, travelers choose routes that minimize their cost of traveling to their destination. In traditional continuum models, travelers have a global perception of traffic; in this study, two novel reactive route-choice strategies are devised in which travelers have a local perception of traffic. In Strategy A, travelers identify a set of feasible temporary destinations that are equidistant from their final destination, and then choose an optimal path within the local perception region that minimizes their cost of traveling to the temporary destination set. In Strategy B, travelers identify a direct path that they can follow to move closer to their final destination within a short, fixed time. These route-choice strategies are used to formulate complete continuum dynamic models for traffic flows in an urban city that consist of a conservation law and a set of eikonal equations or optimization problems involving ordinary differential equations. High-order numerical schemes and suitable solution algorithms are applied to solve these equations on unstructured triangular meshes. Numerical examples are also presented to compare the novel local route-choice strategies with traditional global strategies."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e883", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e884"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e886", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e887", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e889"}, "$$": [{"#name": "list-item", "$": {"id": "d1e890"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e893", "view": "all"}, "_": "Two novel local route-choice strategies are devised to study travelers’ behavior."}]}, {"#name": "list-item", "$": {"id": "d1e895"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e898", "view": "all"}, "_": "Complete continuum dynamic models are formulated for traffic flows in a city."}]}, {"#name": "list-item", "$": {"id": "d1e900"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e903", "view": "all"}, "_": "High-order numerical schemes on unstructured triangular meshes are designed."}]}, {"#name": "list-item", "$": {"id": "d1e905"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e908", "view": "all"}, "_": "Some individuals under local strategies may perform better."}]}, {"#name": "list-item", "$": {"id": "d1e910"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e913", "view": "all"}, "_": "Increasing the distance horizon enhances overall traffic efficiency."}]}]}]}]}]}]}}