{"pii": "S0198971523000418", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0070", "view": "all"}, "_": "Fracking has proven to be a contentious issue in Great Britain, receiving wide press coverage from the initial sale of exploration and development licences, to the current moratorium. This research tracks the public activity online related to this ‘fracking’ journey by analysing over 317 million geolocated tweets from 2015 to 2020, mapping their location to compare the spatial distribution against the shale gas exploration sites. To spatially normalise the results for population density a χ-squared expectation surface was generated revealing higher than expected levels of interest near the previously active fracking site of Preston New Road and licenced extraction blocks in Lancashire. The data granularity allows for peaks of activity to be identified and topics analysed at higher temporal and spatial resolution than previously possible with more traditional surveys. The paper demonstrates the use of χ-squared expectation surfaces for normalising geotweets and the value of social media spatial-temporal analysis for monitoring local involvement in environmental issues, and for monitoring the changing level of interest across different regions in reaction to political decisions."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0075", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "This research investigates the ways that fracking social media discourse has evolved over time and across space in Great Britain"}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Spatial-temporal analysis of 5 years of fracking related geo-located tweets from Great Britain (317 million tweets)"}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Chi-squared expectation surfaces were used to find regions of greater online level of activity than would be expected"}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Time-sliced chi-squared expectation surfaces were used to monitor the level of sustained high/low activity over the 5 years"}]}, {"#name": "list-item", "$": {"id": "li0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Named Entity Recognition was used to identify place names mentioned in tweets and used to create heat maps"}]}]}]}]}]}]}}