{"pii": "S0263224123001987", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0080", "view": "all"}, "_": "Due to the problem of complex aggregate stacking and adhesion, current construction site aggregate grade detection relies on traditional screening methods and single digital image processing technology, which causes inefficiency and segmentation identification difficulties. This problem has become a technical bottleneck in achieving automatic construction site mixed aggregate grade detection. This study constructs a noncontact testing platform for aggregate gradation based on a self-developed sampling and testing device for mixed aggregate gradation and improved deep learning algorithms, which enables rapid testing of mixed aggregate gradation. Based on the principle of instance segmentation, each aggregate in the stacked mixed aggregates collected based on hardware observation is used as an instance to detect independent aggregate targets in the mixed aggregate images with different moisture contents, sand contents and cohesive stacking. An improved aggregate segmentation convolutional neural network model (AS Mask RCNN: Aggregate Segmentation Mask RCNN) is used to achieve the gradation detection of mixed aggregates. This study employed three different types of experiments, and the results showed that the AS Mask RCNN network model achieved an accuracy of over 89.13% in the three experimental situations, and compared the results with those of the Faster RCNN and Mask R-CNN models, with an accuracy improvement of 8.85% and a reduction of 1.29 s in the processing time of a single image segmentation, which can meet the field near real-time detection requirements. The self-developed noncontact testing platform for aggregate grading can adapt to practical applications in complex environments, enabling digital, automated and intelligent noncontact rapid testing of mixed aggregate grading, further improving the accuracy of aggregate grading testing and serving the high-quality development of reservoir dam construction in China."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0085", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Aggregate stacking and adhesion affect the intelligent detection of particle size."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "A noncontact inspection platform for aggregate grading based on deep learning."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Three different types of comparative experiments were used in this study."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "An improved aggregate segmentation convolutional neural network model is proposed."}]}, {"#name": "list-item", "$": {"id": "li0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "The study can be applied to actual engineering rockfill material gradation testing."}]}]}]}]}]}]}}