{"pii": "S026382232200112X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "An investigation was made into a method for Structural Health Monitoring (SHM) of a composite wing using Convolutional Neural Network (CNN) model. In this method, various aerodynamic loads of an aircraft during flight and corresponding strain data were used for CNN model training. The proposed method was demonstrated by numerical simulation using vortex lattice method for aerodynamic loads of an A350-type aircraft in over a thousand flight conditions and a Finite Element (FE) model as a digital twin of the full-scale composite wing. To represent the measurement of 324 sensors mounted in the 18 skin-rib joints of the inboard wing, strain data from the 18 × 18 elements of the FE model in the sensor locations were calculated corresponding to the flight loadings. The strain data from the original structure FE model were employed to train a CNN model that was classified as healthy samples. Damaged elements were then introduced in random locations to produce data samples corresponding to the same set of flight loads for the CNN model training. In the subsequent damage detection process using the trained CNN model, confusion matrix, uncertainty and sensitivity analysis were evaluated. The study results show that robust damage detection results can be obtained with 99% accuracy without noise and 97% accuracy with 2% Gaussian noise. In the damage localization process, threshold value was set at 1.5, 2 or 2.5, and 83% overall accuracy was achieved using the CNN model when the threshold value was 1.5. The study demonstrated that the proposed method is efficient, accurate and robust."}]}]}]}}