{"pii": "S0268401222001293", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0050", "view": "all"}, "_": "Data-driven innovation has received increasing attention, which explores big data technologies to gain more insights and advantages for product design. In user experience (UX) based design innovation, user-generated data and archived design documents are two valuable resources for various design activities such as identifying opportunities and generating design ideas. However, these two resources are usually isolated in different systems. Additionally, design information typically represented based on functional aspects is limited for UX-oriented design. To facilitate experience-oriented design activities, we propose a twin data-driven approach to integrate UX data and archived design documents. In particular, we aim to extract UX concepts from product reviews and design concepts from patents respectively and to discover associations between the extracted concepts. First, a UX-integrated design information representation model is proposed to associate capabilities with key elements of UX at the concept, category, and aspect levels of information. Based on this model, a twin data-driven approach is developed to bridge experience information and design information. It contains three steps: experience aspect identification using an attention-based LSTM (Long short-term memory) network, design information categorization based on topic clustering using BERT (Bidirectional Encoder Representations from Transformers) and LAD (Latent Dirichlet allocation) model, and experience needs and design information integration by leveraging word embedding techniques to measure concept similarity. A case study using healthcare-related experience and design information has demonstrated the feasibility and effectiveness of this approach."}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0055", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Research and propose a UX-integrated design information representation for design innovation."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Establish a twin data-driven approach to integrate user-generated data and design data."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Explore an ML approach to integrate product reviews and achieved design documents."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Associate UX with design information at the concept, category, and aspect levels."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Case studies are reported to showcase twin data associations for UX-based design."}]}]}]}]}]}]}}