{"pii": "S0263224121014536", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "A hybrid algorithm for creating pixel-by-pixel tomographic spatial reconstructions."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Tomographic method that optimizes the detection of moisture in masonry walls."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Simultaneous use of several machine learning models in electrical tomography."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Optimizing the selection of a method for a particular pixel of a tomographic image."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "This paper presents the results of research on identifying moisture inside the walls of buildings with the use of electrical impedance tomography (EIT). The original, complex pixel-oriented ensemble method (POE) was used to solve the inverse, ill-posed problem transforming the input measurements into the tomographic output image pixels. The task of POE is to guarantee reconstructions of a quality that exceeds homogeneous algorithmic methods, no matter what other approaches are used. The presented research used four known, homogeneous machine learning methods: elastic net, linear regression with the least-squares learner (LR-LS), linear regression with SVM learner (LR-SVM) and artificial neural networks (ANN), which were trained to generate output images. All algorithms create pixel-by-pixel reconstructions, meaning that a separate predictive model is trained for each pixel. Then, using the POE algorithm, the best of the four reconstruction methods was adjusted to each pixel of the output image, taking into account the given measurement case. Each measurement results in a different assignment of reconstructive methods to pixels. Since POE can optimise the selection of a method for a given pixel taking into account a specific measurement vector, regardless of how many homogeneous methods will be included in the POE algorithm, the results obtained with POE will always exceed any of the homogeneous methods used. There is the fundamental novelty and original contribution of this research to the general state of knowledge."}]}]}]}}