{"pii": "S0263224124012120", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "A LarkMNet is proposed for weak-feature crack recognition in high-resolution images."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "A Perception Large Kernel Convolutional Network is designed to expand the sensory field."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "LarkMNet’s accuracy in detecting weak feature cracks exceeds existing methods."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Experiments and applications demonstrate the effectiveness and robustness of LarkMNet."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Weak feature crack detection is crucial for dam structural health. Existing methods for detecting weak feature cracks in high-resolution images continue to pose challenges. This paper proposes a Perception Large Kernel-based Multi-level Gather-and-Distribute Network (LarkMNet) for weak-feature crack detection in high-resolution images. The construction of a Perception Large-Kernel ConvNet (LarkNet) enables feature extraction and expansion of the receptive field in high-resolution images. The design of the Multi-level Gather-and-Distribute Network (MGDNet) aims to enhance the critical characteristics of weak cracks. Introducing a Shared Detection Head and an Inner-SCYLLA-Intersection over Union further enhances the model’s detection accuracy. Experimental results demonstrate that LarkMNet’s detection accuracy in high-resolution image datasets surpasses that of mainstream detection models, achieving an F1 score and mAP of 89.4% and 93.3%, respectively. Furthermore, the method’s validity has been confirmed through high-resolution image testing and UAV on-site inspections, efficiently and accurately detecting weak feature cracks in high-resolution images."}]}]}]}}