{"pii": "S0273117723008025", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "Heliophysics and space weather research encompass the effects of solar output on practically the entire Solar System and are fundamentally cross-disciplinary. Cross-domain science investigations, such as in Sun-heliosphere interactions, solar wind-magnetosphere interactions, or magnetosphere-ionosphere coupling, often require the use of data, models, and other digital resources pertaining to different heliophysical domains: the Sun, the solar wind, the magnetosphere, the ionosphere, the thermosphere and the mesosphere. Due to differences in measurement platforms, techniques and instruments, heliophysics data obtained from different domains are diverse and complex, making the resource landscape difficult for untrained users to navigate. Without proper and adequate guidance from domain experts, it is often difficult for early-career scientists and non-domain experts to discover useful datasets and to know from where and how to obtain and understand the data they need to support their research. This paper describes the roles of metadata in providing the identification, location, access protocol, and detailed content description of a digital resource. More specifically, we point out that metadata written according to the Space Physics Archive Search and Extract (SPASE) metadata model are fully compatible with the FAIR principles so that digital resources described using the SPASE model can be uniformly Findable, Accessible, Interoperable, and Reusable. SPASE metadata can thus be the key element, the lingua franca so to speak, that enables unfettered information flow between data systems and services throughout the heliophysics data environment and lowers the understandability barrier of the resources to ensure their independent usability. After describing various components of the heliophysics data environment, their metadata requirements for effective operations, and some essential features of the SPASE metadata model, we then illustrate how metadata in SPASE can enable or facilitate the performance of different science tasks. The current status and future outlook of SPASE are also presented."}]}]}]}}