{"pii": "S027861252400205X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e898", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e899"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e901", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e902", "view": "all"}, "_": "The emergence of Industry 5.0 promotes the creation of human-centric values. To fulfill this objective, Internet of Things (IoT) technologies are increasingly being exploited to digitize the human factor and monitor the ergonomics of manual manufacturing systems. These digital assessments, combined with computational algorithms, contribute to the establishment of socially inclusive workplaces while offering detailed insights to safeguard the health of the aging workforce. In this scenario, this study proposes a digital architecture for evaluating the European Assembly Worksheet (EAWS) in human-centric manufacturing systems. Three distinct enabling technologies are leveraged to acquire heterogeneous data streams. A radio-frequency-based smart glove detects the operator’s interactions with the surrounding environment, while a network of marker-less cameras and a four-channel surface Electromyography (sEMG) system capture body joint movements and muscular contractions of the upper limbs, respectively. The acquired data are processed by computational algorithms to define an EAWS-driven set of Key Risk Indicators (KRIs), embedded in an ergonomic decision support system. These risk metrics highlight operator-driven process weaknesses in musculoskeletal, muscular, and material handling dimensions. Finally, the validity of the proposed digital architecture is demonstrated in an industrial-related pilot environment, where an operator assembles a piece of home furniture."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e904", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e905"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e907", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e908", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e910"}, "$$": [{"#name": "list-item", "$": {"id": "d1e911"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e914", "view": "all"}, "_": "Digital architecture to assess the physical resilience of operators in human-centric manufacturing systems."}]}, {"#name": "list-item", "$": {"id": "d1e916"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e919", "view": "all"}, "_": "Multiple Internet of Things technologies to acquire physical and process data."}]}, {"#name": "list-item", "$": {"id": "d1e921"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e924", "view": "all"}, "_": "Computational algorithms to digitize the Ergonomic Assessment Worksheet index."}]}, {"#name": "list-item", "$": {"id": "d1e926"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e929", "view": "all"}, "_": "Decision support system and key risk indicators to foster the operators’ well-being."}]}, {"#name": "list-item", "$": {"id": "d1e931"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e934", "view": "all"}, "_": "Architecture validation in industrial-like environment."}]}]}]}]}]}]}}