{"pii": "S0278434322001492", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "CoastSnap is a low-cost community beach monitoring program that turns everyday smartphones into devices to measure coastal response to storms, sea-level rise, human modifications and other factors. Underpinning CoastSnap is a stainless-steel smartphone cradle that is installed overlooking a beach in a location easily accessible to the public. Using the cradle for image positioning, passers-by simply take a photo of the coast and upload it to a centralized database, which in turn provides a crowd-sourced record of coastline change over time. Behind this simple idea are advanced image processing algorithms that then enable the shoreline position (and other coastal features) to be mapped from the community snapshots in a scientifically rigorous manner. First established in Sydney, Australia in 2017, the network of CoastSnap stations has grown rapidly over the past five years to now encompass 200 monitoring locations in 21 countries. Analysis of the 44 Australian stations managed by the Authors indicates strong community participation, with over 10,000 images and 4000 community participants to date and an image submission frequency ranging from approximately weekly to daily (average = 2.6 images/station/week). Example practical applications of CoastSnap include: as a tool to monitor high-frequency shoreline change and coastal inlet dynamics; to support conservation efforts on protected coastlines; and to directly inform the timing of dredging and beach nourishment activities. This paper describes the background and evolution of the project and discusses its successes, challenges as well as future directions."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "CoastSnap demonstrates how community smartphone images can accurately monitor coastal change."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Global CoastSnap network now comprises 200 stations in 21 countries."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Participation statistics in Australia indicate strong community uptake (weekly to sub-daily imagery)."}]}]}]}]}]}]}}