{"pii": "S0308597X23002877", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0050", "view": "all"}, "_": "Research on evidence-based marine policymaking is still immature, especially regarding the utilization of text data. This study visualized the transition of ocean policy in Japan using text mining technique applied to the text data of three annual reports: the Fishery white paper from 2007 to 2020, Environmental white paper from 2008 to 2020, and Ocean white paper from 2004 to 2020. The results of the analysis were compared with the expert interviews on each subject. Based on latent Dirichlet allocation (LDA) topic model analysis, significant differences in topics were observed among these white papers, while they all clearly responded to the Great East Japan Earthquake occurred in 2011 with their unique topics. Major transitions in topics occurred several times over the years for all white papers. For the Fishery white paper and Environmental white paper issued by the government agencies, notable transitions occurred in 2011, 2013, 2017 and 2012, 2018, respectively, which were mainly caused by the revisions of relevant laws; while for the Ocean white paper issued by non-government organization, transitions occurred in 2009 and 2016, which were closely related to the development of worldwide ocean initiatives. The expert interviews revealed that the experts’ views on the topics and the transitions of policy focuses were generally consistent with the unsupervised analysis results. Automated visualization of policy transition in each organization accelerates the extraction of their directions and roles in policymaking which will help provide scientific evidence for identifying future opportunities for inter-organizational collaboration."}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0055", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Three types of ocean-related white papers in Japan were analyzed using topic model."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Significant differences in topics were observed among these white papers."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Chronological transition in topics occurred for all white papers over time."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Topic transition mainly caused by the Great East Japan Earthquake and related laws."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Expert interviews validated the plausibility of the analysis results."}]}]}]}]}]}]}}