{"pii": "S0303243422000770", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "The multi-neighborhood analysis reduced effects of hard boundaries;"}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Hierarchical aggregation of small sample categories ensured balanced data distributions of POIs;"}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The hierarchical neural network model resulted in higher accuracy."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "The point of interest (POI) is a critical part of spatial database, which has been widely used in many fields, such as navigation, mapping and urban planning. The data quality of POIs (e.g., missing and incorrect labels) has a large impact on the effectiveness of geospatial applications, especially regarding the non-professional collection characteristics of OpenStreetMap (OSM) data. The conventional neural network model predicted multi-category data labels directly from a single level, and did not consider the uneven distribution of data among POI categories. The predicted labels tended to be the types with larger data volume, and it is difficult to generalize the small-scale samples. Taking into account the large difference in the data volume among POI categories, this paper proposes a neural network prediction method based on multi-level POI category organization. Through the hierarchical aggregation of small sample categories, we established a POI category tree structure, which achieved a relatively balanced division of data volume at different levels of the tree structure. Specifically, the proposed method first roughly classified the POIs at an abstraction level and then inferred the detailed labels according to the hierarchy of the tree structure. We conducted extensive experiments on two datasets and the results demonstrated that our method outperformed traditional methods by a large margin."}]}]}]}}