{"pii": "S0304397599000250", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab1", "class": "author", "lang": "en"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id4"}, "$$": [{"#name": "simple-para", "$": {"id": "SP0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "The paper deals with "}, {"#name": "italic", "_": "ondashline"}, {"#name": "__text__", "_": " routing in wavelength division multiplexing (WDM) optical networks. A sequence of requests arrives over time, each is a pair of nodes to be connected by a path. The problem is to assign a "}, {"#name": "italic", "_": "wavelength"}, {"#name": "__text__", "_": " and a "}, {"#name": "italic", "_": "path"}, {"#name": "__text__", "_": " to each pair, so that no two paths sharing a link are assigned the same wavelength. The goal is to minimize the number of wavelengths used to establish all connections. Raghavan and Upfal (Proc. 26th Annual Symp. on Theory of Computing, 1994, pp. 133–143) considered the off-line version of the problem, which was further studied in Aumann and Rabani (Proc. 6th ACM-SIAM Symp. on Discrete Algorithms, 1995, pp. 567–576), Kaklamanis and Persiano (Proc. 4th Annual European Symp. on Algorithms, Lecture Notes in Computer Science, vol. 1136, Springer, Berlin, 1996, pp. 460–470), Mihail et al. (Proc. 36th IEEE Annual Symp. on Foundations of Computer Science, 1995, pp. 548–557), Rabani, (Proc. 37th Annual Symp. on Foundations of Computer Science, 1996, pp. 400–409). For a line topology, the problem is the well-studied interval graph coloring problem. Ondashline algorithms for this problem have been analyzed in Kierstead and Trotter (Congr. Numer. 33 (1981) 143–153). We consider trees, trees of rings, and meshes topologies, previously studied in the off-line case. We give ondashline algorithms with competitive ratio O(log "}, {"#name": "italic", "_": "n"}, {"#name": "__text__", "_": ") for all these topologies. We give a matching Ω(log "}, {"#name": "italic", "_": "n"}, {"#name": "__text__", "_": ") lower bound for meshes. We also prove that any algorithm for trees cannot have competitive ratio better than Ω(log "}, {"#name": "italic", "_": "n"}, {"#name": "__text__", "_": "/log log "}, {"#name": "italic", "_": "n"}, {"#name": "__text__", "_": "). We also consider the problem where every edge is associated with parallel links. While in WDM technology, a fiber link requires different wavelengths for every transmission, space division multiplexing technology allows parallel links for a single wavelength, at an additional cost. Thus, it may be beneficial in terms of network economics to combine between the two technologies (this is indeed done in practice). For "}, {"#name": "italic", "_": "arbitrary"}, {"#name": "__text__", "_": " networks with Ω(log "}, {"#name": "italic", "_": "n"}, {"#name": "__text__", "_": ") parallel links we give an ondashline algorithm with competitive ratio O(log "}, {"#name": "italic", "_": "n"}, {"#name": "__text__", "_": ")."}]}]}]}]}}