{"pii": "S0304397512007864", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "class": "author", "id": "aep-abstract-id4"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id5"}, "$$": [{"#name": "simple-para", "$": {"id": "sp000005", "view": "all"}, "$$": [{"#name": "__text__", "_": "We introduce a state-based model that can be used in specifying and verifying the desired properties of sensor network protocols. This model accommodates several characteristics that are common in sensor networks. Examples of these characteristics are unavoidable local broadcast, probabilistic message transmission, asymmetric communication, message collision, and timeout actions and randomization steps. We also propose three methods for analyzing a sensor network protocol specified in the model. In the first method, called "}, {"#name": "italic", "_": "nondeterministic analysis"}, {"#name": "__text__", "_": ", a specified sensor network protocol is shown to be “nondeterministically correct” under the assumption that message delivery is assured and message collision is guaranteed not to occur. In the second method, called "}, {"#name": "italic", "_": "probabilistic analysis"}, {"#name": "__text__", "_": ", the protocol is shown to be “probabilistically correct” under the assumption that message delivery is probabilistic but message collision is guaranteed not to occur. In the third method, called "}, {"#name": "italic", "_": "collision analysis"}, {"#name": "__text__", "_": ", the effect of message collision and probabilistic message delivery on the correctness of the protocol is analyzed. To demonstrate the utility of our model, we discuss an example protocol that can be used by a sensor to identify its strong neighbors in the network, and apply the analysis methods to the protocol. Using our model, we also show that the protocol satisfies a desirable property, called self-stabilization property."}]}]}]}]}}