{"pii": "S0306437924000796", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e915", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e916"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e918", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e919", "view": "all"}, "_": "Graph entity dependencies (GEDs) are novel graph constraints, unifying keys and functional dependencies, for property graphs. They have been found useful in many real-world data quality and data management tasks, including fact checking on social media networks and entity resolution. In this paper, we study the discovery problem of GEDs—finding a minimal cover of valid GEDs in a given graph data. We formalise the problem, and propose an effective and efficient approach to overcome major bottlenecks in GED discovery. In particular, we leverage existing graph partitioning algorithms to enable fast GED-scope discovery, and employ effective pruning strategies over the prohibitively large space of candidate dependencies. Furthermore, we define an interestingness measure for GEDs based on the minimum description length principle, to score and rank the mined cover set of GEDs. Finally, we demonstrate the scalability and effectiveness of our GED discovery approach through extensive experiments on real-world benchmark graph data sets; and present the usefulness of the discovered rules in different downstream data quality management applications."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e921", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e922"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e924", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e925", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e927"}, "$$": [{"#name": "list-item", "$": {"id": "d1e928"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e931", "view": "all"}, "_": "A study of the discovery problem of Graph Entity Dependencies (GEDs)."}]}, {"#name": "list-item", "$": {"id": "d1e933"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e936", "view": "all"}, "_": "A new and efficient approach for the discovery of GEDs in property graphs."}]}, {"#name": "list-item", "$": {"id": "d1e938"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e941", "view": "all"}, "_": "A minimum description length inspired definition of interestingness of GEDs to rank discovered rules."}]}, {"#name": "list-item", "$": {"id": "d1e943"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e946", "view": "all"}, "_": "A thorough empirical evaluation of the proposed technique, with examples of useful rules (mined) that are relevant in data quality/management applications."}]}]}]}]}]}]}}