{"pii": "S0306261915015718", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Two control modes were developed for a B2B VSCs based SOP."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "The SOP operating principle was investigated under various network conditions."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The performance of the SOP using two control modes was analyzed."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Soft Open Points (SOPs) are power electronic devices installed in place of normally-open points in electrical power distribution networks. They are able to provide active power flow control, reactive power compensation and voltage regulation under normal network operating conditions, as well as fast fault isolation and supply restoration under abnormal conditions. Two control modes were developed for the operation of an SOP, using back-to-back voltage-source converters (VSCs). A power flow control mode with current control provides independent control of real and reactive power. A supply restoration mode with a voltage controller enables power supply to isolated loads due to network faults. The operating principle of the back-to-back VSCs based SOP was investigated under both normal and abnormal network operating conditions. Studies on a two-feeder medium-voltage distribution network showed the performance of the SOP under different network-operating conditions: normal, during a fault and post-fault supply restoration. During the change of network operating conditions, a mode switch method based on the phase locked loop controller was used to achieve the transitions between the two control modes. Hard transitions by a direct mode switching were noticed unfavourable, but seamless transitions were obtained by deploying a soft cold load pickup and voltage synchronization process."}]}]}]}}