{"pii": "S0301479724023302", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Urban pluvial floods pose a significant risk to cities, occurring when precipitation exceeds the carrying capacity of the urban drainage network. Coupled green-grey infrastructure has emerged as a sustainable solution for mitigating urban pluvial floods. This study aims to explore best practices in the network configuration of urban drainage systems coupled with low-impact development (LID) to enhance flow distribution and stormwater infiltration. To do so, we focused on two competing key concepts in network analysis: (1) Centralization and (2) Decentralization. We integrated a one-dimensional stormwater model with a rapid flood spreading model to assess the flood mitigation performance of various centralized and decentralized network configurations in the Gangnam region of Seoul, South Korea. To further assess the combined effects of green and grey infrastructure, we compared the performance of each drainage network configuration with and without identical mixed LID practices. Here we show that the centralized drainage network scenario performed best in reducing flood volume by 40.3%, the decentralized drainage network scenario performed best in shortening flood duration by 47.8%, and the LID practices scenario performed best in mitigating peak flooding rates by 4.2%, each as independent scenarios. When all three scenarios were coupled together, flood volume could be reduced by 73.5%, flood duration by 54.7%, and peak flooding rates by 19.8% in the study area. This exploratory study underscores the potential of network analysis in urban flood research, particularly the effectiveness of loosely-connected network topology. Our findings contribute to the development of best practices for coupled green-grey infrastructure, facilitating sustainable stormwater management and urban flood resilience."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "We coupled 1D-RFSM (sewer-surface) flood model, network analysis, and SWMM-LID module."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Network analysis aids hydrodynamic models by identifying potential bottleneck sections."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Centralized drainage network scenario most effectively minimized flood volume."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Decentralized drainage network scenario most effectively shortened flood duration."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "LID practices scenario most effectively reduced peak flooding rates."}]}]}]}]}]}]}}