{"pii": "S0301479723007235", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Mesh tracks on peatlands are often granted permits on a temporary basis under the presumption that the tracks are either removed at the end of their permitted use or remain unused in situ. However, the fragility of peatland habitats and poor resilience of the specialist plant communities within them, mean that these linear disturbances may persist post-abandonment or post-removal. We removed sections of mesh track, abandoned five years earlier, from a blanket peatland using two different removal treatment methods (mown and unprepared) and studied a third treatment with sections left in place over a period of 19 months. On abandoned tracks, invasive species including "}, {"#name": "italic", "_": "Campylopus introflexus"}, {"#name": "__text__", "_": " and "}, {"#name": "italic", "_": "Deschampsia flexulosa"}, {"#name": "__text__", "_": " had established, while track removal led to extensive loss of "}, {"#name": "italic", "_": "Sphagnum"}, {"#name": "__text__", "_": " species. Loss of surficial nanotopographic vegetation structures during track removal was extensive, and micro-erosion features were prevalent in both removal treatments. Abandoned sections of track performed comparably better across all metrics than removed sections. However, similarity between the vegetation assemblage of the abandoned track and the controls was <40% at the study outset, with NMDS (Non-metric Multidimensional Scaling) highlighting divergences. There was a mean species loss of 5 per quadrat for the removed sections. Bare peat was present in 52% of all track quadrats by the finish of the study. Our findings suggest that mesh tracks left in situ and track removal both present significant barriers to recovery and additional conservation interventions may be required after peatland tracks are abandoned."}]}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Access tracks both surfaced and unsurfaced are a growing problem in peatlands globally."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Temporary tracks are designed to attenuate negative impacts of vehicular passage over peatlands."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "We studied changes in the vegetation community after a temporary track is removed."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Track abandonment and removal both led to significant alterations to the vegetation."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "Removal led to extensive bare peat areas which are vulnerable to erosion."}]}]}]}]}]}]}}