{"pii": "S0304380016305063", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0045", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "lis0005"}, "$$": [{"#name": "list-item", "$": {"id": "lsti0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "par0005", "view": "all"}, "_": "Simulating habitat connectivity in coupled habitat and human networks."}]}, {"#name": "list-item", "$": {"id": "lsti0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "par0010", "view": "all"}, "_": "Habitat connectivity is negatively correlated to the number of settlements."}]}, {"#name": "list-item", "$": {"id": "lsti0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "par0015", "view": "all"}, "_": "In highly settled landscapes, connectivity benefits from concentrating settlements."}]}, {"#name": "list-item", "$": {"id": "lsti0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "par0020", "view": "all"}, "_": "In some cases, habitat connectivity is higher in dense than in sparse road networks."}]}, {"#name": "list-item", "$": {"id": "lsti0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "par0025", "view": "all"}, "_": "Considering regional networks is necessary for effective conservation planning."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0050", "view": "all"}, "_": "Habitat connectivity is important for species’ survival and can be maintained in landscapes with well-connected habitat networks. The integrity of these habitat networks, however, is often threatened by “human networks” consisting of settlements connected by roads with traffic. Both settlement and road network changes can decrease habitat connectivity, either directly or indirectly through changes in traffic flows. Due to these complex interactions, it remains unclear how habitat connectivity in habitat networks is affected by settlement or road network configurations in human networks. To address this issue we develop a new spatially explicit simulation model coupling habitat and human networks. In binary landscape rasters, consisting of settlement patches surrounded by a continuous matrix through which animals could move, we varied the number, the size and the proportion of settlements. Settlements were connected with either dense or sparse road networks. On all roads connecting settlements, we estimated traffic volume based on settlement sizes and topology. Traffic volumes were then used to parameterize landscape resistance networks that quantify the probability of movement for animals throughout the landscape. From these resistance networks, we calculated average habitat connectivity for several animal species (i.e. tree frog, hedgehog and badger). In this innovative model setup, habitat connectivity was thus influenced by a combination of settlement patterns and traffic volumes. For all species, we found a negative correlation between habitat connectivity and the number of settlement patches. Furthermore, in landscapes with a high proportion of settlement, highest habitat connectivity was found when most settlement cells were concentrated in large patches. Surprisingly, in some cases, we found higher habitat connectivity for dense road networks than for sparse road networks. Results from this study can increase our understanding of habitat connectivity in heterogeneous landscapes and lead to recommendations for conservation planning. With this study we demonstrate the importance of considering interactions between spatial networks in ecological analyses."}]}]}]}}