{"pii": "S0308597X21002529", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0035", "view": "all"}, "$$": [{"#name": "__text__", "_": "Deep-sea hydrothermal vent fields are globally rare (abundant in numbers, but extremely small in area) and are rich in extraordinary life based on chemosynthesis rather than photosynthesis. Vent fields are also sources of polymetallic sulfides rich in copper and other metals. Mineral resources of the international seabed beyond national jurisdictions (referred to as the “"}, {"#name": "italic", "_": "Area"}, {"#name": "__text__", "_": "”) are administered by the International Seabed Authority (ISA), which has the mandate to organize and control mineral resource-related activities and to ensure effective protection of the marine environment from harmful effects which may arise from such activities. To date, the ISA has approved 3 contracts for mineral exploration on the northern Mid-Atlantic Ridge (nMAR) and is developing a Regional Environmental Management Plan (REMPs) for polymetallic sulfide resources in the Area of northern MAR, including the application of area-based management tools to address the potential impacts of mining activities. Several intergovernmental organizations have developed suites of criteria to identify vulnerable, sensitive, and ecologically or biologically significant ecosystems in need of protection. In this case study, we combine criteria developed by FAO for VMEs (Vulnerable Marine Ecosystems), by CBD for EBSAs (Ecologically or Biologically Significant Areas), and by IMO for PSSAs (Particularly Sensitive Sea Areas) to assess whether the 11 confirmed vent fields on the nMAR may meet these criteria. Our assessment indicates that all vent fields meet multiple criteria for vulnerability, sensitivity, and ecological or biological significance, and 10 of 11 vent fields meet all criteria for ecosystems in need of protection."}]}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0040", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Criteria exist to assess vulnerability, sensitivity, and ecological or biological significance of marine ecosystems."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Nine criteria were applied to 11 hydrothermal vents on the Northern Mid-Atlantic Ridge."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Suites of physico-chemical and biological attributes are unique at each vent field."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "All vent fields meet multiple or all criteria for vulnerability, sensitivity, and ecological or biological significance."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Networks of protected vents fields are essential for connectivity and resilience."}]}]}]}]}]}]}}