{"pii": "S0308597X23000441", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0045", "view": "all"}, "_": "Innovation in seafood marketing has multiplied, resulting in a constellation of emerging marketing initiatives from the fishing sector and seafood distributors to cope with resources scarcity, uncertainty, and climate change. Wholesalers, and retailers drawn on Social Network Sites (Facebook, Instagram, Whatsapp, Twitter, Youtube, TikTok) to disseminate the values associated with fish products. This study analyses the distribution network channels of the cuttlefish market in Catalonia (Spain) and the social media users. The methodology combines social network analysis, digital ethnography, and qualitative analysis based on structured, semi-structured, in-depth interviews and images. Results suggest the existence of a paradox between the values of seafood products associated with \"proximity,\" \"local,\" and \"seasonal products\" cohabiting with market values adapted to the contemporary lifestyle of \"convenience\" and accessibility. The spread of gastronomic culture has popularised the demand for cuttlefish, increasing market diversification and growing competition between the buying and selling network actors. While distributors can obtain resources from different sources, fishers must cope with the limitations of natural resources. We conclude that management plans should consider the integration of fishers in marketing channels and media discourses to improve the marketing of seafood products in pursuit of sustainability."}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0050", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Seafood-added values must consider local indicators of sustainability."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Seafood value preferences posted on Social Media help to define consumer attitudes."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The plurality of seafood values should be revised according to sustainability"}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Digital ethnography may inform seafood policy for sustainability."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Integrating fishers into marketing networks may promote positive environmental values."}]}]}]}]}]}]}}