{"pii": "S0306437921001009", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e157"}, "$$": [{"#name": "section-title", "$": {"id": "d1e158"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e160"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e161"}, "_": "The General Data Protection Regulation (GDPR) came into force in 2018. After this enforcement, many fines have already been imposed by national data protection authorities in Europe. This paper examines the individual GDPR articles referenced in the enforcement decisions, as well as predicts the amount of enforcement fines with available meta-data and text mining features extracted from the enforcement decision documents. According to the results, three articles related to the general principles, lawfulness, and information security have been the most frequently referenced ones. Although the amount of fines imposed vary across the articles referenced, these three particular articles do not stand out. Furthermore, a better statistical evidence is available with other meta-data features, including information about the particular European countries in which the enforcements were made. Accurate predictions are attainable even with simple machine learning techniques for regression analysis. Basic text mining features outperform the meta-data features in this regard. In addition to these results, the paper reflects the GDPR’s enforcement against public administration obstacles in the European Union (EU), as well as discusses the use of automatic decision-making systems in judiciary."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e163"}, "$$": [{"#name": "section-title", "$": {"id": "d1e164"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e166"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e167"}, "$$": [{"#name": "list", "$": {"id": "d1e169"}, "$$": [{"#name": "list-item", "$": {"id": "d1e170"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e173"}, "_": "The General Data Protection Regulation (GDPR) came into force in 2018."}]}, {"#name": "list-item", "$": {"id": "d1e175"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e178"}, "_": "This paper examines the recent GDPR enforcement fines."}]}, {"#name": "list-item", "$": {"id": "d1e180"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e183"}, "_": "Principles, lawfulness, and security justify the majority of enforcements."}]}, {"#name": "list-item", "$": {"id": "d1e185"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e188"}, "_": "The fines imposed vary across the articles referenced in the enforcements."}]}, {"#name": "list-item", "$": {"id": "d1e190"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e193"}, "_": "The enforcement fines can be predicted accurately with text mining features."}]}]}]}]}]}]}}