{"pii": "S030147972302265X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Information about a company's environmental, social and governance (ESG) performance has become increasingly important in the decision-making process of financial institutions. The financial implications of environmental challenges (e.g. water stress), negative social impacts (e.g. health impacts in local communities) or poor corporate governance (e.g. breaching legislation) all continue to increase. Accordingly, there is a need for financial institutions to incorporate information on ESG risks, opportunities and impacts in decisions that relate to risk management, investments, credit, strategy, and reporting. ESG information is typically disseminated through ESG ratings, which combine the three constituents into a single rating, or ascribe them separate scores. The compilation of ESG ratings and the identification of appropriate data sources is an inherently complex process; as such, there is no single standard for data collection or reporting. This has led to a divergence in the underlying data sources used by different rating providers, as well as in the determination of factors that are deemed worthy of measurement in the first place. For example, when assessing a company's environmental impact, one rating provider may rely on company-provided data, while another may incorporate independent third-party assessments. Unfortunately, there is currently no clear mechanism for effectively resolving such disagreements to establish a standardised approach to ESG rating assessments. However, geospatial data and analyses offer several key advantages for ESG assessments, including consistency, the potential for enhanced accuracy, and the ability to identify and assess environmental impacts at a detailed physical asset level, in addition to evaluating the broader spatial context. By incorporating geospatial information (obtained through manually processing remotely sensed data, or by using existing products) rating methodologies can be improved, and disparities can be addressed more effectively. This would enable a more comprehensive understanding of the environmental considerations of ESG assessments, promoting a more informed and precise decision-making process. Within this context, a few institutions (e.g. the University of Oxford, the WWF, and a few others) are pioneering thought leadership around spatial finance, including the assessment of ESG issues utilising geospatial intelligence, but there are no consistent frameworks for incorporating geospatial data into ESG ratings and analysis. This paper explores the opportunity for such a geospatial environmental scoring framework, defining a variety of methods in which open data with broad geographic coverage could be incorporated into ESG analysis, generalisable to a range of assets and sectors. The proposed framework is organised into two categories: localised effects, which directly impact the immediate vicinity of an asset, and delocalised effects, which contribute to global climate change and atmospheric pollution. Sub-scores are defined within these categories, which capture both the localised effects on land use, biodiversity, soils, and hydrology, and the global impacts resulting from atmospheric emissions. The approaches for handling geospatial data to generate both these sub-scores and the final "}, {"#name": "italic", "_": "E-score"}, {"#name": "__text__", "_": " are presented, including a test case, and the complete methodology is made available in open repositories."}]}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "First geospatial framework for corporates and investors to assess environmental impacts of a study area."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Transparent and accessible framework, making use of open access data and tools."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Practical description of the framework with an industrial test case."}]}]}]}]}]}]}}