{"pii": "S0306453022002530", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0035", "view": "all"}, "$$": [{"#name": "__text__", "_": "Resilience to consequences of trauma exposure contains relevant information about the processes that contribute to the maintenance of mental health in the face of adversity; information that is essential to improve treatment success of stress-related mental diseases. Prior literature has implicated aberrant amygdala (re)activity as potential factor contributing to trauma susceptibility. However, it remains to be resolved which amygdalar subregions and neuronal subclasses are involved, and when – i.e., pre-, peri- or post-trauma exposure – and under what conditions changes in amygdala (re)activity manifest themselves. Here, we implemented a preclinical rodent model for PTSD that entailed exposure to a traumatic event (severe, unpredictable foot shock) followed by a trigger (mild, predictable foot shock). Using behavioral phenotyping, trauma susceptible vs. resilient mice were identified and pre-, peri- or post-trauma amygdala activity was compared. Neuronal activity was tagged in living mice by the use of the ArcTRAP transgenic mouse line, labeling all activated (i.e., "}, {"#name": "italic", "_": "Arc"}, {"#name": "__text__", "_": "-expressing) neurons by a systemic injection of tamoxifen. Furthermore, we assessed amygdala responses during fear memory recall, induced by either (re-)exposure to the trauma, trigger, or a novel, yet similar context, and analyzed behavioral fear responses under these conditions, as well as basal anxiety in the mice. Results revealed no major differences dissociating susceptible vs. resilient mice prior to trauma exposure, but exaggerated activity in specifically the basolateral amygdala (BLA) peri-trauma that predicted susceptibility to later PTSD-like symptoms. Post-trauma, susceptible mice did not display altered basal amygdala activity, but BLA hyperreactivity in response to trigger context re-exposure, and BLA hyporesponsivity in response to the trauma context. Exposure to the novel, similar context evoked a differential temporal pattern of freezing behavior in susceptible mice and an increased activity of amygdalar somatostatin-expressing neurons specifically. As such, these results for the first time show that deviant BLA activity during fear learning predicts susceptibility to its long-term consequences and that aberrant subsequent BLA responses to stressful contexts depend on the exact context."}]}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0040", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Activity of the basolateral amygdala (BLA) during trauma encoding codes susceptibility to later behavioral PTSD-like symptomatology."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "BLA activity is bidirectionally modulated by trauma susceptibility depending on the contextual reminder of fear."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Susceptibility to trauma is not associated with differential basal activity in the amygdala pre- or post-trauma exposure."}]}]}]}]}]}]}}