{"pii": "S0306457324000670", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara008", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "Papers’ scientific commentaries, though a subset of citations, represent a distinct category."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "The rate of commented papers has remained stable at around 4 % for 30 years."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "Scientific commentaries prefer to target uncertain and complex issues."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "Commented studies and their accompanying comments, construct an ideal corpus for argument mining."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara009", "view": "all"}, "_": "Authors tend to cite scientific knowledge with higher certainty and lower complexity. Scientific comments, such as editorials and letters to the editor, may signify a distinction by offering constructive compliments or criticism on prior work. This study aims to understand why certain papers receive formal comments and their applications. We find that the rate of commented papers has remained stable at around 4 % for 30 years. Next, to explore the characteristics attracting formal comments, we designed a comparative study between over 0.8 million commented biomedical papers (study group) and the entire over 30 million PubMed records (baseline control group). First, based on citation sentiments of over 17.7 million documents from Scite.ai, we find that commented papers tend to be highly cited, whereas strongly contradicted and intensely disputing (i.e., receive both positive and contradicted citations), with a rate ratio of 2.2 times of baseline. This reflected the inherent controversy of content in triggering extensive argumentative discussion. Second, by mapping descriptors and qualifiers of Medical Subject Headings between the commented group and the baseline group, we observe that the prominence level for commented papers ranked from the social-related to biological-related fields and from applied to basic research topics. The observed spectrum aligns with the “hierarchy of sciences” model, in which the “hardness” of science decreases, and its complexity increases. Commented papers and their accompanying comments may provide a corpus for argument mining on uncertain and complex topics to support more informed and unbiased decision-making."}]}]}]}}