{"pii": "S0305900622000666", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0115", "view": "all"}, "_": "Recent decades have seen the emergence of hybrid models of living and working associated typologies. These developments have been analysed from the perspective of different disciplines, each with their own interpretation of this phenomenon. Planning and architecture have addressed hybridization as a specific form of interaction between spatio-functional features (such as mixed use, multi-functionality and flexibility) and social features (such as formal and informal interactions and the spontaneous appropriation of spaces) or have sometimes simply focused on the spatio-functional dimension in urban spaces. Studies from other disciplines (e.g. mobility networks, transportation, sociology and information technology) have shown that hybrid spaces cannot exist without access to digitalization technologies. Such technologies are accelerating hybridization processes. This study examines the complex and layered phenomenon of hybridization as a possible combination of (or interaction between) spatio-functional, social and digital features within the planning debate and related fields. Most of the case studies explored by scholars so far have focused on interactions occurring between residential, social and recreational functions, but working functions are playing an increasingly important role. Furthermore, the COVID-19 pandemic has accelerated the development of new forms of hybridity in cities. As a consequence, the rising use of hybrid (on-site and on-line) working practices, planners, policy makers and stakeholders, as well as scholars, have increasingly discussed the concept of hybridization. In this context, various hybrid typologies of urban spaces have materialized in forms such as new working spaces (NWS) which include co-working spaces, incubators, as well as some cafés and multi-functional public libraries, which have recently provided working spaces. This paper focuses on the evolving concept of hybridity from the planning perspective. Based on five hybrid NWS including their surrounding neighbourhoods in Oslo, it provides empirical evidence for an understanding of the phenomenon that may support the development of hybrid spaces and buildings and develops suggestions for planning strategies."}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0120", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0030"}, "$$": [{"#name": "list-item", "$": {"id": "u0060"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0060", "view": "all"}, "_": "New theoretical and empirical knowledge is needed for understanding the hybridization in cities and urban spaces."}]}, {"#name": "list-item", "$": {"id": "u0065"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0065", "view": "all"}, "_": "Hybrid new working spaces are emerging in contemporary cities and planning environments."}]}, {"#name": "list-item", "$": {"id": "u0070"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0070", "view": "all"}, "_": "Hybridity reflects the combintation of spatio-functional, social and digital features."}]}, {"#name": "list-item", "$": {"id": "u0075"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0075", "view": "all"}, "_": "Optimal conditions for hybridity involve various levels of planning (city, neighborhood and urban spaces)"}]}, {"#name": "list-item", "$": {"id": "u0080"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0080", "view": "all"}, "_": "Hybrid new working spaces are linked with neighborhoods by providing amenities and services to users and local community."}]}]}]}]}]}]}}