{"pii": "S0306437924000449", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1375", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1376"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1378", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1379", "view": "all"}, "_": "User interaction (UI) logs are high-resolution event logs that record low-level activities performed by a user during the execution of a task in an information system. Each event in such a log represents an interaction between the user and the interface, such as clicking a button, ticking a checkbox, or typing into a text field. UI logs are used in many different application contexts for purposes such as usability analysis, task mining, or robotic process automation (RPA). However, UI logs suffer from a lack of standardization. Each research study and processing tool relies on a different conceptualization and implementation of the elements and attributes of user interactions. This exacerbates or even prohibits the integration of UI logs from different sources or the combination of UI data collection tools with downstream analytics or automation solutions. In this paper, our objective is to address this issue and facilitate the exchange and analysis of UI logs in research and practice. Therefore, we first review process-related UI logs in scientific publications and industry tools to determine commonalities and differences between them. Based on our findings, we propose a universally applicable reference data model for process-related UI logs, which includes all core attributes but remains flexible regarding the scope, level of abstraction, and case notion. Finally, we provide exemplary implementations of the reference model in XES and OCED."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1381", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1382"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1384", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1385", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1387"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1388"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1391", "view": "all"}, "_": "We review existing user interaction logs to find common attributes and differences."}]}, {"#name": "list-item", "$": {"id": "d1e1393"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1396", "view": "all"}, "_": "We develop a reference data model that includes the core attributes of UI logs."}]}, {"#name": "list-item", "$": {"id": "d1e1398"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1401", "view": "all"}, "_": "We provide implementations in XES and two Object-Centric Event Data formats."}]}]}]}]}]}]}}