{"pii": "S0360544224016451", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e792", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e793"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e795", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e796", "view": "all"}, "_": "Integrating sustainable heat sources into district heating systems is crucial to reduce the mainly fossil-based heat supply in the building sector. However, integrating a heat source into an existing district heating system can be challenging due to non-matching temperature levels or unfavourable availability of the heat source intended for utilisation. To avoid the problems associated with heat source integration, i.e. utilisation in an existing district heating system, an alternative approach is to separate the district heating network into two independent networks. Thus, the separated network forms a standalone district heating system, which is supplied by the utilised heat source and can be individually transformed depending on the characteristics of the utilised heat source and the supplied buildings. In this way, complex design and control adaptions for the entire district heating system are avoided."}, {"#name": "simple-para", "$": {"id": "d1e798", "view": "all"}, "_": "This work presents a method for the automatic determination of optimal district heating separation depending on the given district heating network structure and the heat source that should be utilised. For this purpose, an optimisation model determines the separation based on predefined coherent areas in the network, while considering the potential of the heat source and the heat requirements of the buildings. The application of the presented method shows various network separations depending on the heat source conditions and the focused optimisation objectives. The subsequent network simulation identifies critical areas for insufficient heat supply from which various necessary measures could be derived."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e800", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e801"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e803", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e804", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e806"}, "$$": [{"#name": "list-item", "$": {"id": "d1e807"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e810", "view": "all"}, "_": "Separating district heating networks facilitates the utilisation of heat sources."}]}, {"#name": "list-item", "$": {"id": "d1e812"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e815", "view": "all"}, "_": "An optimisation model reveals the optimal separation of district heating networks."}]}, {"#name": "list-item", "$": {"id": "d1e817"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e820", "view": "all"}, "_": "The network separation considers available heat capacity and temperature level."}]}, {"#name": "list-item", "$": {"id": "d1e822"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e825", "view": "all"}, "_": "Heat pumps are installed in the separated network to utilise low-temperature heat."}]}, {"#name": "list-item", "$": {"id": "d1e827"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e830", "view": "all"}, "_": "A subsequent simulation evaluates the separated district heating networks."}]}]}]}]}]}]}}