{"pii": "S0360131524001805", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Educational data mining (EDM) applied to the wealth of data generated from international large-scale assessments (ILSAs) shows potential for identifying successful educational initiatives. Despite limited research on clustering methods in ILSAs, leveraging these methods to uncover student profiles can help decision-making in designing tailored programs. This study aims to identify and characterize 15-year-old student profiles using PISA 2022 data and reveal insights into the relationship between these profiles and factors such as ICT availability and use, gender, academic performance, and educational expectations. We analyzed PISA 2022 Spanish student data (n = 30,800) with a selection of 74 contextual variables, applying an end-to-end explainable cluster analysis methodology that integrates different machine learning (ML) and explainable artificial intelligence (XAI) techniques. This methodology covered data pre-processing, dimensionality reduction, clustering, and classification to ensure data quality and result explainability. We obtained 16 derived variables, 7 student clusters, and an optimal XGBoost classifier with a global accuracy of 0.8643. Using local and global SHAP values, we interpreted clusters, finding that socio-economic status and ICT availability and use at home are the most important factors differentiating student profiles. Our findings suggest the need to emphasize (i) proper ICT accessibility and use, as well as student support networks to improve academic performance, (ii) gender-specific well-being programs, and (iii) the encouragement of educational expectations tailored to students’ gender and their exposure to higher education. These results pave the way for personalized academic policies and programs through ML-based tools for uncovering student profiles."}]}]}]}}