{"pii": "S0360132319305347", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "abs0010", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Radiofrequency radiation (RFR), used for wireless communications and “smart” building technologies, including the “Internet of Things,” is increasing rapidly. As both RFR exposures and scientific evidence of harmful effects increase apace, it is timely to heed calls to include low RFR levels as a performance indicator for the health, safety and well-being of occupants and the environment."}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "Adverse biochemical and biological effects at commonly experienced RFR levels indicate that exposure guidelines for the U.S., Canada and other countries are inadequate to protect public health and the environment."}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "Some industry liability insurance providers do not offer coverage against adverse health effects from radiation emitted by wireless technologies, and insurance authorities deem potential liability as “high.” Internationally, governments have enacted laws, and medical and public health authorities have issued recommendations, to reduce and limit exposure to RFR."}, {"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "There is an urgent need to implement strategies for no- or low-RFR emitting technologies, and shielding, in building design and retrofitting. These strategies include installing wired (not wireless) Internet networks, corded rather than cordless phones, and cable or wired connections in building systems (e.g., mechanical, lighting, security). Building science can profit from decades of work to institute performance parameters, operationalizing prudent guidelines and best practices. The goal is to achieve RFR exposures that are ALARA, “As Low As Reasonably Achievable.”"}, {"#name": "simple-para", "$": {"id": "abspara0030", "view": "all"}, "_": "We also challenge the business case of wireless systems, because wired or cabled connections are faster, more reliable and secure, emit substantially less RFR, and consume less energy in a sector with rapidly escalating greenhouse gas emissions."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "abs0015", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0035", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Wireless systems increase radiofrequency radiation (RFR) in buildings."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Scientific evidence identifies adverse effects from RFR below regulatory limits."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Globally, some governments and public health agencies are reducing RFR exposures."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Low RFR best practices include wired technology instead of Wi-Fi, and corded phones."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "Safer, sustainable strategies and solutions for “smart” buildings are feasible."}]}]}]}]}]}]}}