{"pii": "S0360835224003899", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e698", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e699"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e701", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e702", "view": "all"}, "_": "Geohazard prediction is one of the most important and challenging tasks in underground mining. It still remains difficult to improve the prediction accuracy and make it compatible with the ever-increasing data in mining, especially when the data are sparsely allocated in a large-scale mining environment. This study introduces an innovative multimodal data fusion approach for geohazard prediction in underground mining to address this challenge. By incorporating visual model data as a novel modality and using interpolated rock mass rating data as a cross-complementary factor, the framework enhances the effectiveness of data fusion. Specific machine learning models were used and validated (e.g., neural networks, SVM, KNN, etc.) for proposed multimodal data fusion, addressing challenges posed by sparsely scattered multidimensional data, which generally have weak spatial connections across diverse datasets. In detail, to enhance spatial connection among diverse datasets, this paper leverage digitalised and gridded CAD file-based visual model data as a foundational carrier, the new modality, to facilitate the establishment of robust internal connections with routine data. Additionally, rock mass rating data is interpolated and aligned with visual model data to enhance spatial connections, improving spatial information-orientated data fusion. Then, to validate the accuracy and efficiency of the novel multimodal data fusion framework, we process and integrate two different routine data from a case study mine. Performance is tested by nine different data combinations, originating from two routine datasets, visual model data, and rock mass rating data. Finally, through comprehensive cross-validation, the proposed multimodal data fusion framework significantly improves the stability of prediction models at a comprehensive mine site scale, with high accuracy and low False-Negative rate."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e704", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e705"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e707", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e708", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e710"}, "$$": [{"#name": "list-item", "$": {"id": "d1e711"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e714", "view": "all"}, "_": "Visual model data digitalisation and visual analytics in mining engineering."}]}, {"#name": "list-item", "$": {"id": "d1e716"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e719", "view": "all"}, "_": "Data fusion with visual model data and routine data."}]}, {"#name": "list-item", "$": {"id": "d1e721"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e724", "view": "all"}, "_": "Data interpolation-based ML model fine-tuning regarding underground mining application."}]}, {"#name": "list-item", "$": {"id": "d1e726"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e729", "view": "all"}, "_": "Multimodal data fusion for geohazard prediction."}]}]}]}]}]}]}}