{"pii": "S0360132324007947", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Using human location data from mobile phones, we developed a method to detail transportation modes around Shinagawa Station in Tokyo and analyzed the impact of hot weather conditions on traffic behavior. Each user's movement history was collected based on the global positioning system (GPS) communication of applications. We estimated the modes of transportation (train, car, walking, and stationary) for each user. By conducting route searches based on each user's data, we calculated the traffic volume for each mode of transportation, linking the estimated population data to network data and confirming accuracy against official census data. In August 2019, we examined the relationship between the estimated transportation modes and the hourly wet-bulb globe temperature (WBGT), which was calculated by the Ministry of the Environment using values measured by the Tokyo Regional Meteorological Observatory. The results indicated that as WBGT increases, fewer pedestrians walk and more remain stationary. Sensitivity to WBGT was four times greater at 20:00 p.m. than at 08:00 a.m., despite similar WBGT levels. This may be because fewer people go out during the hottest part of the day, and the sum of those who go out during the day, i.e., those who return home, is greatly reduced. However, this trend was not observed on weekdays. The results suggest that the impact of summer heat is latent during weekdays due to the demands of work and errands but becomes more pronounced during free time, such as holidays and nighttime."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Proposed methodology can extract highly detailed modes of human transportation."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Pedestrian responses to weather based on land use and time of day were estimated."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "High WBGT leads to decreased walking activity, especially on holidays."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Reduction in pedestrian numbers due to WBGT rise is greater at night than in morning."}]}]}]}]}]}]}}