{"pii": "S0360544224033632", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Since the 1990s, there has been a noticeable increase in the establishment of local district heating networks in Germany, coinciding with the use of thermal energy from biogas and biomass facilities. Historically, the prioritization of economically efficient heat utilization was subdued due to favorable electricity feed-in tariffs. However, with the expiration of Renewable Energy Sources Act subsidies, operators shifted focus to the operational costs of district heating networks. This study aims to examine the effects of optimizing controllers and valves at district heating substations in single-family homes, utilizing two local district heating networks. The emphasis is on evaluating impacts on operating costs and determining whether the economic and energetic benefits justify implementation. Simulation studies in MATLAB/Simulink Simscape depict both consumers and district heating networks individually, without aggregation. In the most favorable scenario, investing in enhancing substation controllers in single-family homes is projected to yield returns after 13 years. Comprehensive optimization of all substation controls in single-family homes can potentially result in up to 9 % savings in thermal energy demand due to reduced heat losses and a corresponding 9 % reduction in electrical power consumption for the main pump."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Self-operated substations were upgraded with digital controllers."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The investigation was conducted on two typical demonstration cases."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "A physical model of the DHN without aggregation of consumers was developed."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "All critical models were validated using measurement data."}]}]}]}]}]}]}}