{"pii": "S0360544221011579", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The consumption of buildings for the production of heat is expected to decrease in Switzerland in the coming years, in particular following policies encouraging the refurbishment of buildings. This will notably have an impact on the natural gas network, in parallel with the penetration of electric-driven heat pumps. Through a detailed optimization scheme, the evolution of the natural gas (NG) distribution network is studied over a future period of forty years, i.e. up to 2050, on the territory of a large Swiss canton. By way of installing large shares of co-generation units, it is shown that the NG network does not lose its meshed structure, while continuing to play a central role in the production of heat and the generation of part of the additional electricity demand associated with the concomitant penetration of heat pumps. As a novel result, the developed optimization framework allows a detailed, geographically precise view of both the evolution of the NG network, as well as of the optimal location of selected technologies. The adoption of energy networks convergence in urban zones therefore can lead to relevant synergies, avoiding over-investments, increasing system resilience and fostering the use of efficient technologies."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "abs0015", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Natural gas distribution grids can play a crucial role despite decrease of heat demand."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Substitution of boilers with CHP units facilitates massive penetration of heat pumps."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Increasing share of renewable methane will lead to substantial GHG emissions reduction."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Spatially resolved optimization of a regional grid is numerically tractable."}]}]}]}]}]}]}}