{"pii": "S0360132323003220", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1384", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1385"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1387", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1388", "view": "all"}, "_": "Geospatial data of the building stock is essential in many domains pertaining to the built environment. These datasets are often provided by governments, but crowdsourcing them has surged in the last decade. Nowadays, OpenStreetMap (OSM) – the most popular Volunteered Geographic Information (VGI) platform – contains geospatial and descriptive data on more than 500 million buildings worldwide collected by millions of contributors, and it is increasingly used in studies ranging from energy and microclimate to urban planning and life cycle assessment. However, large-scale understanding on their quality remains limited, which may hinder their use and management. In this paper, we seek to understand the state of building information in OSM and whether it is a reliable source of such data. We provide a comprehensive study to assess the quality of attribute (descriptive) data of the building stock mapped globally, e.g. building function, which are key ingredients in many analyses and simulations in the built environment. We examine three aspects: completeness, consistency, and accuracy. In this assessment, the first at such scale and the most comprehensive available hitherto, we find that quality continues to be highly heterogeneous — from poor quality in some, to very high completeness in other areas, potentially benefiting a range of application domains, e.g. we estimate that 3D building models of 443 administrative units (mostly cities and municipalities) around the world can be generated from OSM, underpinning the generation of digital twins. The number of floors and building type are the most frequent properties that contributors record, and in most cases are highly accurate, while mapping the interior of buildings did not gain momentum."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1390", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1391"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1393", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1394", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1396"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1397"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1400", "view": "all"}, "_": "OpenStreetMap is the principal global crowdsourced geospatial dataset."}]}, {"#name": "list-item", "$": {"id": "d1e1402"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1405", "view": "all"}, "_": "More than half a billion buildings are mapped in OpenStreetMap."}]}, {"#name": "list-item", "$": {"id": "d1e1407"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1410", "view": "all"}, "_": "Most comprehensive OpenStreetMap building attribute data quality assessment."}]}, {"#name": "list-item", "$": {"id": "d1e1412"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1415", "view": "all"}, "_": "Our global analysis provides an understanding of the highly variable quality."}]}, {"#name": "list-item", "$": {"id": "d1e1417"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1420", "view": "all"}, "_": "In thousands of districts, OSM building data may be sufficient for some use cases."}]}]}]}]}]}]}}