{"pii": "S0360319923056793", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "attachments", "$$": [{"#name": "attachment", "$": {"xmlns:xocs": true}, "$$": [{"#name": "attachment-eid", "_": "1-s2.0-S0360319923056793-si133.svg"}, {"#name": "ucs-locator", "_": "https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0360319923056793/image/svg+xml/d395cc6efd7e2c4890cf3fd3cd019f7a/si133.svg"}, {"#name": "file-basename", "_": "si133"}, {"#name": "abstract-attachment", "_": "true"}, {"#name": "filename", "_": "si133.svg"}, {"#name": "extension", "_": "svg"}, {"#name": "filesize", "_": "1198"}, {"#name": "attachment-type", "_": "ALTIMG"}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "d1e4031", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e4032"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e4034", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e4035", "view": "all"}, "$$": [{"#name": "__text__", "_": "Implicit finite difference method is popular numerical method for simulation of transient pipeline dynamics, governed by the system of Euler partial differential equations. If advection equation is included in the mathematical formulation, gas composition tracking is also possible. If implicit scheme is used for gas composition tracking, simulated concentration profiles are distorted due to the occurrence of numerical diffusion, a non-physical phenomenon, caused by the 1st order accurate numerical implicit scheme. Intensity of the numerical diffusion can be decreased by use of "}, {"#name": "math", "$": {"xmlns:mml": true, "altimg": "si133.svg", "display": "inline", "id": "d1e4038"}, "$$": [{"#name": "mi", "_": "θ"}]}, {"#name": "__text__", "_": "-scheme with arbitrarily chosen implicitness. In order to evaluate accuracy of such numerical scheme and adequacy for usage in actual application, numerical model must be evaluated on actual gas pipeline system topology with actual measured boundary conditions and compared to actual measured results. Aim of this paper is to assess whether hydrogen concentration tracking is feasible using such approach considering complex grid topologies. Paper highlights the peculiarities of the proposed "}, {"#name": "math", "$": {"xmlns:mml": true, "altimg": "si133.svg", "display": "inline", "id": "d1e4043"}, "$$": [{"#name": "mi", "_": "θ"}]}, {"#name": "__text__", "_": "-scheme and finite difference method and its impact on the calculated concentration profile for binary gas mixtures. Non-physical flow reversal issue and its impacts on concentration tracking in looped pipeline system is researched and explained. Simulation results shows high accuracy for simulated values of hydraulic variables compared to the measured values, in some cases fit is perfect. Discrepancy between measured and the simulated values of the pressures at nodes on the main transport route is negligible, while the discrepancy increases with the distance from the main transport routes. The largest discrepancy occurred on the most distant node and was between 1.7006 bar (4.85%) and 1.7119 bar (4.88%), depending on the "}, {"#name": "math", "$": {"xmlns:mml": true, "altimg": "si133.svg", "display": "inline", "id": "d1e4048"}, "$$": [{"#name": "mi", "_": "θ"}]}, {"#name": "__text__", "_": " value. On the other hand, simulated concentration profile lacks finer details due to the numerical diffusion effects while the simulated concentration profile lags the measured profile, partly by the impacts of the 1st order accurate scheme and partly by effects of non-physical reversed flows. Discrepancy between simulated and measured amplitude of the tracked concentration profile was negligible, while discrepancy due to the time delay of the simulated and measured profile was more expressed and ranged between 2h to 9h. Largest time delay was caused by the non-physical flow reversal."}]}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e4052", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e4053"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e4055", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e4056", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e4058"}, "$$": [{"#name": "list-item", "$": {"id": "d1e4059"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e4062", "view": "all"}, "_": "Model validation on actual network topology using measured boundary conditions."}]}, {"#name": "list-item", "$": {"id": "d1e4064"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e4067", "view": "all"}, "_": "Only gas component concentration profiles are affected by implicitness of the numerical scheme."}]}, {"#name": "list-item", "$": {"id": "d1e4069"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e4072", "view": "all"}, "_": "Simulation with lower implicitness is more accurate than fully implicit model."}]}, {"#name": "list-item", "$": {"id": "d1e4074"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e4077", "view": "all"}, "_": "Non-physical simulated flow reversal can occur in looped network topology and affect hydrogen concentration profile."}]}]}]}]}]}]}}