{"pii": "S0377042720300091", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e177"}, "$$": [{"#name": "section-title", "$": {"id": "d1e178"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e180"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e181"}, "_": "The purpose was to help investment banks select customers with good credit, exclude customers with greater risk, minimize the risk of investors, and maintain the maximum interests of investors. The data mining technology was used to establish a credit risk assessment model of personal to personal peer-to-peer (P2P) network lending, and then the credit situation of the lender was accurately assessed to reduce the risk of the platform. Firstly, the loan data of LendingClub (LC) platform in 2018 were collected and sorted out, and then the unbalanced data set was obtained through preprocessing. Secondly, the unbalanced data set was sampled by layers, and 10 balanced data sets were obtained, and the four indexes of evaluation were obtained through data classification, that is, P2P platform credit rating evaluation index. Finally, the actual data of LC platform were evaluated by decision tree and binomial logic regression algorithm. The CfsSubsetEval evaluation strategy and BestFirst search strategy were used to search for a single feature to improve the prediction ability, so as to analyze the credit rating of the lender. The research results showed that the decision tree algorithm could improve the accuracy of preliminary screening, and predict the default probability of borrowers more accurately, so as to filter out the borrowers with higher default rate and reduce the loan risk of the platform, while the binomial logistic regression algorithm could show good performance. The combination of the two algorithms can truly estimate the credit status of the lenders and improve the transaction efficiency. Therefore, the research on the credit risk of blockchain platform based on data mining technology is of great significance to improve the credit level of investors, improve their investment income, save transaction costs, optimize the allocation of credit resources, and achieve effective supervision by credit regulatory authorities."}]}]}]}}