{"pii": "S0378779624008423", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e855", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e856"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e858", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e859", "view": "all"}, "_": "With the increasing of DC loads in the distribution networks and calls for carbon emission reduction, the hybrid AC/DC distribution network (HDN) is a profound solution to increase the efficiency of the conventional distribution networks and allow for more renewable energy resources (RESs) to integrate. The optimal operation of these networks under normal conditions with different constraints and scenarios, including the stochastic nature of the RESs, need to be addressed and investigated. Various studies concerned about the optimal power flow (OPF) of an HDN are reviewed, and consequently, different related topics and issues are documented in this report. The objective function of the OPF process includes the most influential variables that have considerable weight on the HDN efficiency. Meanwhile, a broad collection of constraints with practical limits is required to avoid system operation violations. The non-linearity of the objective function and constraints of the HDN makes solving the OPF is more complicated. Therefore, selecting the OPF method requires a deep understanding of the complexity of these equations and the practical approximations that can be assumed. The method is necessary to be compared with other methods to record its robustness and efficiency. This study helps the distribution system operator (DSO) understand the gains obtained from applying an HDN to their network architecture, with the associated OPF. Also, it shows the challenges that result from operating these networks and what kind of solutions are being applied."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e861", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e862"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e864", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e865", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e867"}, "$$": [{"#name": "list-item", "$": {"id": "d1e868"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e871", "view": "all"}, "_": "The paper provides a review of recent advances in OPF."}]}, {"#name": "list-item", "$": {"id": "d1e873"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e876", "view": "all"}, "_": "The paper reviews OPF in hybrid AC/DC distribution network (HDN)."}]}, {"#name": "list-item", "$": {"id": "d1e878"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e881", "view": "all"}, "_": "It identifies the non-linearity of the objective function and constraints of the HDN."}]}, {"#name": "list-item", "$": {"id": "d1e883"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e886", "view": "all"}, "_": "The paper reviews the algorithms for the core optimisers."}]}]}]}]}]}]}}