{"pii": "S0378778824004572", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The data-driven approach currently dominates the field of Automatic Fault Detection and Diagnosis (AFDD) in HVAC systems. However, a significant concern lies in the prevalent use of labeled experimental and simulation data, which often does not represent real-world operational conditions. This study unveils a comprehensive framework for AFDD in light commercial buildings, effectively leveraging unlabeled raw data extracted directly from their Building BAS. Its main goal is to provide a versatile methodology tailored for real-world applicability. Buildings classified as “light commercial” typically have less than 2,500 square meters of floor area and no more than six stories, such as small offices, medical facilities, banks, small manufacturing facilities, etc. A common feature of these buildings is the fact that the HVAC systems tend to be relatively simple and have similar configurations, thus making it easy to develop scalable and reproducible fault detection methods. This paper focuses on a practical case study in a light commercial building HVAC system situated in Montreal, Canada, encompassing a single Air Handling Unit (AHU) and four Variable Air Volume (VAV) reheating boxes to evaluate the framework. This comprehensive framework encompasses a sequence of sub-objectives: creating a sizable, synchronized raw dataset from diverse BAS sensor tags, comprehensive data cleansing to address inconsistencies, developing an anomaly detection method, investigating these anomalies to extract underlying rules, and finally, dataset labeling. An AFDD classification model is then applied to evaluate its ability to distinguish normal from faulty conditions across various fault types. The study highlights the potential of dimensional reduction techniques and unsupervised clustering for effective anomaly detection in light commercial buildings, as well as the power of the Decision Tree classifier for uncovering hidden patterns, especially in anomaly conditions. It also highlights the significance of addressing imbalanced datasets in AFDD and the complexities of detecting sizing-related faults. Despite these challenges, the framework exhibits robust performance in detecting and diagnosing a range of HVAC faults. It offers a systematic and adaptable approach for handling real-world operational data in light commercial building HVAC systems, extendible to other building types, bridging the gap between data-driven methods and practical applications."}]}]}]}}