{"pii": "S0378778816302158", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Highlights"}, {"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "list0005"}, "$$": [{"#name": "list-item", "$": {"id": "listitem0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Reviews energy metering and environmental monitoring technologies along with a discussion on their working principle, types and cost comparison of most widely available meters and sensors."}]}, {"#name": "list-item", "$": {"id": "listitem0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Reviewed social, economic, environmental and legislative drivers for the installation of these technologies."}]}, {"#name": "list-item", "$": {"id": "listitem0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Presented a table to summarise energy legislation and regulations in different countries."}]}, {"#name": "list-item", "$": {"id": "listitem0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Factors influencing the selection of meters and sensors are also discussed in detail."}]}, {"#name": "list-item", "$": {"id": "listitem0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Reviews most widely used communication and network technologies."}]}, {"#name": "list-item", "$": {"id": "listitem0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "Discusses possible future research directions and challenges."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Buildings are responsible for 40% of global energy use and contribute towards 30% of the total CO"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": " emissions. The drive to reduce energy consumption and associated greenhouse gas emissions from buildings has acted as a catalyst in the increasing installation of meters and sensors for monitoring energy use and indoor environmental conditions in buildings. This paper reviews the state-of-the-art in building energy metering and environmental monitoring, including their social, economic, environmental and legislative drivers. The integration of meters and sensors with existing building energy management systems (BEMS) is critically appraised, especially with regard to communication technologies and protocols such as ModBus, M-Bus, Ethernet, Cellular, ZigBee, WiFi and BACnet. Findings suggest that energy metering is covered in existing policies and regulations in only a handful of countries. Most of the legislations and policies on energy metering in Europe are in response to the Energy Performance of Buildings Directive (EPBD), 2002/91/EC. However, recent developments in policy are pointing towards more stringent metering requirements in future, moving away from voluntary to mandatory compliance. With regards to metering equipment, significant developments have been made in the recent past on miniaturisation, accuracy, robustness, data storage, ability to connect using multiple communication protocols, and the integration with BEMS and the Cloud – resulting in a range of available solutions, selection of which can be challenging. Developments in communication technologies, in particular in low-power wireless such as ZigBee and Bluetooth LE (BLE), are enabling cost-effective machine to machine (M2M) and internet of things (IoT) implementation of sensor networks. Privacy and data protection, however, remain a concern for data aggregators and end-users. The standardization of network protocols and device functionalities remains an active area of research and development, especially due to the prevalence of many protocols in the BEMS industry. Available solutions often lack interoperability between hardware and software systems, resulting in vendor lock-in. The paper provides a comprehensive understanding of available technologies for energy metering and environmental monitoring; their drivers, advantages and limitations; factors affecting their selection and future directions of research and development – for use a reference, as well as for generating further interest in this expanding research area."}]}]}]}]}}