{"pii": "S0377221723007051", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "id": "absh001", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0001", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "lst0002"}, "$$": [{"#name": "list-item", "$": {"id": "lstitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0001", "view": "all"}, "_": "Multi-objective Dynamic Disaster Response Personnel Routing & Scheduling DDRPRS model."}]}, {"#name": "list-item", "$": {"id": "lstitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0002", "view": "all"}, "_": "A quadrant shrinking heuristic (QSH) for tri-objective integer programming models."}]}, {"#name": "list-item", "$": {"id": "lstitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0003", "view": "all"}, "_": "A tabu search based algorithm for solving the QSH subproblems."}]}, {"#name": "list-item", "$": {"id": "lstitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0004", "view": "all"}, "_": "Managerial insights from the application of the DDRPRS using Lombok Earthquake data."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0001", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0002", "view": "all"}, "_": "In the aftermath of natural disasters there is a need to provide disaster relief services. These services are offered by diverse disaster relief personnel teams that are specialized in the provision of the required services, e.g., teams that set up temporary shelters, teams that are providing medical services. These services are provided during a rolling horizon and the demand and supply characteristics of the disaster relief system evolve dynamically over time. In this paper we are presenting a dynamic variant of the multi-objective disaster relief personnel routing and scheduling (DDRPRS) problem, which considers efficiency, fairness and transportation risk objectives. We introduce a Quadrant Shrinking Method (QSM) based heuristic algorithm to approximate the Pareto Optimal Solutions of the DDRPRS problem under consideration. The proposed algorithm considers the performance of the solutions over the entire planning horizon and their robustness over time in terms of their efficiency, fairness and transportation risk. We apply the proposed heuristic for routing and scheduling personnel involved in evacuation and medical operations using data from the 2018 Lombok Earthquake in Indonesia. Our heuristic implementation covers both the dynamic and static variants of the disaster relief personnel routing and scheduling problem. Computational results show that the proposed heuristic can generate in a short time sufficiently large number of Pareto Optimal Solutions which cover the entire Pareto frontier as indicated by the diverging behaviours of the Pareto Optimal Solutions and the associated hypervolume metrics."}]}]}]}}