{"pii": "S037877962400467X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e962", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e963"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e965", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e966", "view": "all"}, "_": "In recent years, there has been an exploration of innovative electric grid concepts centered around power routers, devices capable of controlling power flows as desired. One of which is the Power Router Grid, a novel high-controllable network design fully based on power routers. Its ability to arbitrarily change power flows inside controllable lines raises the challenge of determining the optimal operation within such systems. This paper aims to push further the analysis of the operation and benefits of such networks by proposing a novel optimization model tailored for power router grids based on the most recent literature for the convexification of optimal power flows. Moreover, it demonstrated that radial-based models can be expanded for grids meshed through power routers. The model presented is also convex in the form of a second-order cone, ensuring a global optimum for diverse grid configurations. It has been implemented in Python using the PYOMO modeling language and applied to three case studies investigating the effects of power router operation modes on the grid’s optimal operation and associated costs. Results show that the definition of the power router grid design and the ports operation mode must be carefully decided when demand uncertainty of over 25% is taken into consideration. Moreover, controlling power flow near lines of higher impedance can lead up to a 21% increase in line losses."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e968", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e969"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e971", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e972", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e974"}, "$$": [{"#name": "list-item", "$": {"id": "d1e975"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e978", "view": "all"}, "_": "A novel and linearized optimal power flow model for electric grids based on power routers."}]}, {"#name": "list-item", "$": {"id": "d1e980"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e983", "view": "all"}, "_": "Application of second-order cone convexification for grids meshed through power routers."}]}, {"#name": "list-item", "$": {"id": "d1e985"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e988", "view": "all"}, "_": "Analysis of the effects of the layout and power controllability in line losses inside the power router grid."}]}, {"#name": "list-item", "$": {"id": "d1e990"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e993", "view": "all"}, "_": "Implementation of the optimization model in pyomo."}]}]}]}]}]}]}}