{"pii": "S0386111222000644", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0075", "view": "all"}, "_": "In this study, we develop a system to provide information on the sterilization of baggage carts and arriving passenger baggage to airport (Hereafter referred as arrival baggage) by using ultraviolet (UV) sterilization and information communication technology as border quarantine measures at airports. This system sterilizes arrival baggage and baggage carts by UV irradiation, and allows passengers to easily view the sterilization information recognized by radio frequency indentation technology. This is to provide safety and security not only to passengers, but also to staff, who may come into direct contact with the arrival baggage, of airport, airline, customs, and so on. In addition, the passengers can be provided with baggage tracking information, such as the current location and estimated delivering time of the baggage. This makes it possible to keep social distancing at baggage claims as an infection prevention. Furthermore, we verify the feasibility of the developed system and identify the issues to be addressed for its practical application through a demonstration of proof of concept at Central Japan International Airport."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0080", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0040"}, "$$": [{"#name": "list-item", "$": {"id": "li0080"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0080", "view": "all"}, "_": "We developed a sterilization system for arrival baggage and baggage carts in airports by ultraviolet irradiation."}]}, {"#name": "list-item", "$": {"id": "li0085"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0085", "view": "all"}, "_": "Radio frequency identification technology contributes to recognize the information regarding sterilization."}]}, {"#name": "list-item", "$": {"id": "li0090"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0090", "view": "all"}, "_": "This system allows passengers to easily view the regarding sterilization information."}]}, {"#name": "list-item", "$": {"id": "li0095"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0095", "view": "all"}, "_": "This can provide safety and security not only to passengers, but also to airport and airline staff."}]}]}]}]}]}]}}