{"pii": "S038611121730211X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0060", "view": "all"}, "_": "Emphasis on non-motorized travel modes (for example, biking) reduces motorized trips and provides positive effects on the environment and the quality of human life. Understanding factors that influence people to biking or bike commuting can help decision makers, transportation planners, and bike commuting networks. Historically, conventional methods like surveys and crash data analyses were conducted to understand relevant factors. Survey and crash data analysis are difficult to perform in broad scale due to data availability and efforts. An innovative approach to determining these factors is to conduct social media mining to understand sentiments or motivations of bike commuters. People use terms (with hashtag at the beginning of the term) in Twitter, a popular social media network, to express their thoughts, activities or information. This study developed a framework for using Twitter data in understating the sentiments of the bikers with minimal effort. In this study, Twitter data associated with bike commuting hashtags were obtained for eight years (2009–2016). This study provided a framework of data collection and application of various natural language processing (NLP) tools (for example, text mining, sentiment analysis) to extract knowledge from the unstructured text data. Findings show that biking is associated with weather and seasonal patterns. The general sentiment towards biking is positive. However, negative sentiments are associated with bad weather, crime, and other challenges. The polarity scores indicate somewhat positiveness in the recent few years. The developed framework and the findings of this study will help planners and decision makers to promote biking on a broader scale."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0065", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "This study used user-generated bike-commute Twitter posts to determine information patterns and motivations."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Bike-commute Twitter posts show association with major bike events."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The communication trends between Twitter handles are distributed."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The overall sentiment towards bike-commute trips is positive."}]}]}]}]}]}]}}