{"pii": "S0720048X23003418", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Purpose"}, {"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "To validate MRI Analyzer Quality Control (MA-QC), a free and open-source online software designed to facilitate MR data acquisition quality control and PI-QUAL score calculation."}]}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st015"}, "_": "Material and methods"}, {"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "MA-QC is a web-based software, designed for analysing DICOM data related to MR acquisition parameters. The software allows automatic extraction of 18 technical criteria, and manual input of 12 visual criteria, to calculate the PI-QUAL score. We collected 100 prostate MRI datasets from four MR device manufacturers to test data compatibility, automatic sequence recognition, and robustness of technical criteria extraction from DICOM data. The main issue was to determine the spatial resolution in the phase and frequency directions, due to variable encoding of the DICOM datasets."}]}, {"#name": "abstract-sec", "$": {"id": "as015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st020"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "sp0015", "view": "all"}, "_": "Acquisition data could be extracted from all sample examinations (100%), with a median analysis speed of 15.2 ± 4.4 images per second and mean processing time of 96 [11–326] seconds per examination. MA-CQ automatically detected the optimal T2-w, DWI and DCE sequences in 71 out of 100 (71%) cases, and required manual selection of at least one sequence in 29 out of 100 (29%) cases to get the best parameters. Display of technical criteria for the 3 sequences was instantaneous. PI-QUAL score could be calculated in all cases."}]}, {"#name": "abstract-sec", "$": {"id": "as020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st025"}, "_": "Conclusion"}, {"#name": "simple-para", "$": {"id": "sp0020", "view": "all"}, "_": "This software brings substantial help in the quality assessment of prostate MRI examinations, by providing fast extraction of series data and the 18 technical parameters of PI-QUAL. PI-QUAL scoring can be performed in less than two minutes, helping to focus on the visual criteria, allowing use of this software in the clinical workflow in the aim of improving overall image quality in prostate MR imaging."}]}]}]}}