{"pii": "S0736584523000406", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e677", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e678"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e680", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e681", "view": "all"}, "_": "The features of collaborative robots (cobots), like lightweight, easy programming, and flexibility, meet the production automation requirements in SMEs. However, SME productions are usually in semi-structured or cluttered environments, which raises major challenges in implementing cobot systems in SME production, for instance, increasing the visual perception of cobots, handling diverse tasks, and fast deploying cobot systems, etc. Therefore, we propose an automation framework for SME production by addressing these challenges with cobots to facilitate their production. First, the learning-based vision system is developed and implemented with the You Only Look Once (YOLOv5) for object detection, and with the Convolutional Neural Network cascaded with a Support Vector Machine (CNN-SVM) for quality control of products. Then, the multi-functional gripper system is designed and fabricated to be capable of performing multiple operations and tasks without tool changing, and be able to tolerate a certain level of changes in the environment. After that, a digital twin of the robotic system is developed, which enables the system developer to save time in troubleshooting and debugging, and the customers to have a customized model with all the elements and functions required before system deployment. Finally, the onsite testing of the integrated system is conducted in collaboration with our SME industrial partner, and the test results show that the cobot system can perform the automated production process well and accurately. It is feasible to extend the application of such a cobot system to other SME productions."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e683", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e684"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e686", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e687", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e689"}, "$$": [{"#name": "list-item", "$": {"id": "d1e690"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e693", "view": "all"}, "_": "Learning-based robot vision for object detection and quality inspection to increase the effectiveness of the cobot."}]}, {"#name": "list-item", "$": {"id": "d1e695"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e698", "view": "all"}, "_": "Design of multi-functional gripper for handling and adapting to different tasks in SME production."}]}, {"#name": "list-item", "$": {"id": "d1e700"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e703", "view": "all"}, "_": "Digital twin of the cobot system in SME production for development, optimization, and pre-validation."}]}]}]}]}]}]}}