{"pii": "S0888327023001322", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Tailored signal processing tools for processing data from embedded wireless accelerometers for condition monitoring of railway crossing panels."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Novel frequency-domain displacement reconstruction method which robustness is tested with acceleration traces from over 100 000 train passages over eight crossing panels."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Application of multibody simulations of the dynamic train–track interaction for interpretation of the measured signals and validation of the developed signal processing tools."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The separation of the track response into quasi-static and dynamic domains based on deformation wavelength regions is proposed as a promising strategy to observe the ballast condition and the crossing geometry condition, respectively."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Railway switches and crossings (S&C, turnouts) connect different track sections and create a railway network by allowing trains to change tracks. This functionality comes at a cost as the load-inducing rail discontinuities in the switch and crossing panels cause much larger degradation rates for S&C compared to regular plain line tracks. The high degradation rates make remote condition monitoring an interesting prospect for infrastructure managers to optimise maintenance and ensure safe operations. To this end, this paper addresses the development of tailored signal processing tools for condition monitoring using embedded accelerometers in crossing panels. Multibody simulations of the dynamic train–track interaction are used to aid the interpretation of the measured signals in a first step towards building a model-based condition monitoring system. An analysis is performed using sleeper acceleration measurement data generated by 100 000 train passages in eight crossing panels. Based on the given data, a novel frequency-domain displacement reconstruction method is developed and the robustness of the method with respect to encountered operational variability of the measured data is demonstrated. The separation of the track response into quasi-static and dynamic domains based on deformation wavelength regions is proposed as a promising strategy to observe the ballast condition and the crossing geometry condition, respectively."}]}]}]}}