{"pii": "S0888327024005004", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e5281", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e5282"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e5284", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e5285", "view": "all"}, "$$": [{"#name": "__text__", "_": "This paper represents the final part of a sequence on the foundations of "}, {"#name": "italic", "_": "Population-Based Structural Health Monitoring"}, {"#name": "__text__", "_": " (PBSHM). The previous papers presented detailed analyses of how PBSHM can extend the functionality of ‘classical’ single-structure SHM by leveraging information and data available across a population of structures. Two main concepts were critical in establishing the basic methodology. In the first place, it was assumed that the uplift from considering a population would only be truly present if a structure of interest could be shown to be ‘similar’ in some sense to at least one other structure in the population. This requirement of similarity demanded the development of a principled means of measuring the degree of said similarity; this was accomplished by the proposal and design of "}, {"#name": "italic", "_": "Irreducible Element"}, {"#name": "__text__", "_": " (IE) and "}, {"#name": "italic", "_": "Attributed Graph"}, {"#name": "__text__", "_": " (AG) models of structures, which naturally resided in a metric space. The second key concept in PBSHM was the idea of moving inferences between structures, and the natural methodology for this was established as "}, {"#name": "italic", "_": "transfer learning"}, {"#name": "__text__", "_": ". This final paper is concerned with showing how the main ideas of PBSHM can be embedded in software; in fact, this proved to be non-trivial and not a simple matter of programming. In order to embed the concepts of PBSHM within a computational framework, a number of new concepts needed to be developed – the "}, {"#name": "italic", "_": "network"}, {"#name": "__text__", "_": ", "}, {"#name": "italic", "_": "framework"}, {"#name": "__text__", "_": " and "}, {"#name": "italic", "_": "database"}, {"#name": "__text__", "_": " – and these ideas are introduced within the paper. Furthermore, the development of the computational architecture revealed a number of limitations inherent in the previously-proposed base PBSHM ideas, notably in the conception of the IE model. This paper therefore provides a radical reformulation of the IE-model concept, presenting it in a new form appropriate to embedding in software. The development of new theoretical constructs proved to be so entwined with the software development issues that they are not easily separable, so new concepts and software implementation are both presented here. To avoid interrupting the narrative flow of the conceptual material, the details of many of the software ‘objects’ are presented in a substantial appendix."}]}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e5309", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e5310"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e5312", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e5313", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e5315"}, "$$": [{"#name": "list-item", "$": {"id": "d1e5316"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e5319", "view": "all"}, "_": "A first holistic computational conceptualisation of PBSHM."}]}, {"#name": "list-item", "$": {"id": "d1e5321"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e5324", "view": "all"}, "_": "A novel approach for embedding structural knowledge within a technical framework."}]}, {"#name": "list-item", "$": {"id": "d1e5326"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e5329", "view": "all"}, "_": "A radical reformulation of the IE-model concept."}]}, {"#name": "list-item", "$": {"id": "d1e5331"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e5334", "view": "all"}, "_": "New theoretical constructs for the development of a shared data domain within PBSHM."}]}, {"#name": "list-item", "$": {"id": "d1e5336"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e5339", "view": "all"}, "_": "Implementation of the database and framework software."}]}]}]}]}]}]}}