{"pii": "S0898122108005476", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "class": "author", "id": "aep-abstract-id15"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id16"}, "$$": [{"#name": "simple-para", "$": {"view": "all"}, "$$": [{"#name": "italic", "_": "Timely"}, {"#name": "__text__", "_": " information refers to information whose ‘most recent’ or ‘latest’ instance is most valuable. In mobile ad hoc networks (MANETs), multiple instances of a piece of timely information may be produced by different nodes at different points in time. The problem is to discover the ‘latest’ instance among all existing instances. Within the context of MANETs, timely information discovery is fundamentally different from the existing resource/service discovery problem whose goal is to discover either "}, {"#name": "italic", "_": "any"}, {"#name": "__text__", "_": " instance or a "}, {"#name": "italic", "_": "subset"}, {"#name": "__text__", "_": " of instances which satisfy a "}, {"#name": "italic", "_": "local"}, {"#name": "__text__", "_": " query constraint that can be specified and evaluated using only local attributes of each individual node. In contrast, the timely information discovery problem imposes the "}, {"#name": "italic", "_": "global"}, {"#name": "__text__", "_": " (timeliness) constraint which should best be evaluated when "}, {"#name": "italic", "_": "all"}, {"#name": "__text__", "_": " the instances are considered to determine the latest instance. The complication of discovering timely information arises from the existence of multiple instances of the information, which are produced at different points in time by different nodes in the network, and the need to collect all these instances to decide the latest instance. For MANETs, the lack of infrastructure supports, frequent topology changes, and potential packet loss in wireless communications further challenge the problem of timely information discovery. This paper describes a self-organizing, peer-to-peer based approach, termed ALADIN, to discovering timely information in MANETs. In ALADIN, nodes that produce instances of the timely information are peers who self-organize an adaptive and distributed ‘search infrastructure’ to facilitate the discovery of the latest instance. A simulation study shows that ALADIN is scalable without incurring network-wide flooding in the case of large-scale networks and popular timely information, and yields a high chance of discovering the latest instance in the presence of mobility."}]}]}]}]}}