{"pii": "S0895717710004309", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "class": "author", "id": "aep-abstract-id18"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id19"}, "$$": [{"#name": "simple-para", "$": {"id": "sp000045", "view": "all"}, "_": "With the increase in deployment of multi-hop wireless networks and the desire for seamless internet access through ubiquitous connectivity, the inter-working of heterogeneous multi-hop wireless networks will become prominent in the near future. To complement the quest for ubiquitous service access, multi-mode mobile terminals are now in existence. Inter-working heterogeneous multi-hop wireless networks can provide seamless connectivity for such multi-mode nodes but introduces a number of challenges due to its dynamic network topology. One of the challenges in ensuring seamless access to service through these terminals in an inter-working environment is the selection of reliable wireless point-to-point links by the multi-hop nodes. A wireless link is said to be reliable if its radio attribute satisfies the minimum requirements for successful communication. Successful communication is specified by metrics such as signal to interference and noise ratio (SINR), probability of bit error etc. However, the multi-hop wireless networks being inter-worked may operate with different link layer protocols. Therefore, how can the reliability of a wireless link be estimated irrespective of the link level technologies implemented in the networks being inter-worked so that optimal paths can be used for multi-hopping between nodes? In this paper, a generic framework which can estimate the reliability of a link in inter-working multi-hop wireless network is presented. The framework uses the relationship between inter-node interference, SINR and the probability of bit error to determine the reliability of a wireless link between two nodes. There is a threshold for the probability of bit error on a link for the link to be termed reliable. Using parameters such as the SINR threshold, nodes’ transmission power, link distance and interfering node density, the framework can evaluate the reliability of a link in an inter-working multi-hop network."}]}]}]}}