{"pii": "S0896627316309941", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Summary"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Microglia are the intrinsic immune sentinels of the central nervous system. Their activation restricts tissue injury and pathogen spread, but in some settings, including viral infection, this response can contribute to cell death and disease. Identifying mechanisms that control microglial responses is therefore an important objective. Using replication-incompetent adenovirus 5 (Ad5)-based vectors as a model, we investigated the mechanisms through which microglia recognize and respond to viral uptake. Transgenic, immunohistochemical, molecular-genetic, and fluorescence imaging approaches revealed that phosphatidylserine (PtdSer) exposure on the outer leaflet of transduced cells triggers their engulfment by microglia through TAM receptor-dependent mechanisms. We show that inhibition of phospholipid scramblase 1 (PLSCR1) activity reduces intracellular calcium dysregulation, prevents PtdSer externalization, and enables months-long protection of vector-transduced, transgene-expressing cells from microglial phagocytosis. Our study identifies PLSCR1 as a potent target through which the innate immune response to viral vectors, and potentially other stimuli, may be controlled."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Phosphatidylserine exposure tags virally transduced cells for microglial phagocytosis"}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Engulfment by microglia is TAM receptor dependent"}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Inhibition of phospholipid scramblase 1 activity protects from phagocytosis"}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Rescued cells remain viable allowing prolonged transgene expression"}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0020", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "Tufail et al. show that inhibiting phospholipid scramblase 1 activity in virally transduced cells prevents intracellular calcium dysregulation, phosphatidylserine externalization, and TAM receptor-dependent microglial phagocytosis, providing a novel mechanism through which innate immune responses to viral vectors may be controlled."}]}]}]}}