{"pii": "S0895717713000034", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "class": "author", "id": "aep-abstract-id20"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id21"}, "$$": [{"#name": "simple-para", "$": {"id": "sp000085", "view": "all"}, "_": "The extraction of individual trees is important in a forest’s information management. The retrieval of tree and forest structural attributes from Light Detection and Ranging (LiDAR) data has focused largely on airborne LiDAR data. This paper investigates a new methodology to extract individual trees using a vehicle-borne LiDAR system that can provide different scan views and information compared with airborne systems. The paper describes the working procedure of the tree extraction from vehicle-borne laser points. The procedure includes the following steps: (1) mapping the RGB information of the high-resolution panoramic image onto the point cloud; (2) separation of points into ground classes a non-ground class, with only the non-ground class points used to extract trees; (3) segmentation of the colored point cloud; (4) layering of the laser points based on elevation data; (5) preliminary separation of the trees from other objects using the grid point density for each layer; (6) classifying the individual trees; (7) estimating tree height and crown area using the information of the entity from the segmentation. The laser point cloud data for the study were collected in Guangzhou in southern China. There was a density of nearly one thousand laser points per square meter, and the color images of the point cloud data had a pixel size of 20 cm. The tree position and stem diameter were measured simultaneously. The position and attitude of the camera for each image were used to match the segment-generated entity to the corresponding pixels in the CCD image of the digital camera. The classification results of the laser point cloud indicate that images add useful information for the identification of trees."}]}]}]}}