{"pii": "S0893395222017094", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "Abs1", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cestitle10"}, "_": "Abstract"}, {"#name": "simple-para", "$": {"id": "spara120", "view": "all"}, "_": "Mesotheliomas with pleomorphic features are rare and only a few studies on this mesothelioma variant have been published. Little information regarding the immunoprofile of these tumors and none on their electron microscopic features was included in these studies. Herein are reported 10 cases of pleomorphic mesothelioma that were investigated using a large panel of immunohistochemical markers, 4 of which were also studied by electron microscopy. All of the patients were men and seven had a history of asbestos exposure. Nine of the cases originated in the pleura and one in the peritoneum. Histologically, the tumors were characterized by being composed of large, often discohesive, cells that varied in size and shape, had dense abundant eosinophilic cytoplasm, and single or multiple irregular nuclei, which often contained one or several large nucleoli. Mitotic activity was high and atypical mitoses frequent. Immunoreactivity for pan-keratin and keratin 7 was strong in all of the cases. Expression for calretinin, WT1, podoplanin, mesothelin and keratin 5/6 was also frequent, but variable. All cases were negative for MOC-31, carcinoembryonic antigen, CD15, TAG-72 and thyroid transcription factor-1. Electron microscopy often showed the presence of abundant long, slender microvilli on the cell membrane of the neoplastic cells. These findings demonstrate that, contrary to what has been suggested by some investigators, both immunohistochemistry and electron microscopy can be very helpful in assisting in the diagnosis of pleomorphic mesotheliomas. That the seven patients who underwent extrapleural pneumonectomy had extensive lymph node metastasis and that the median survival of those patients for whom follow-up information was available was only 8.2 months indicates that mesotheliomas with pleomorphic features are associated with highly aggressive clinical behavior. Therefore, when this subtype of epithelioid mesothelioma is present, it should be reported as it can significantly affect the prognosis and treatment of the patient."}]}]}]}}