{"pii": "S0895717710004243", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "class": "author", "id": "aep-abstract-id42"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id43"}, "$$": [{"#name": "simple-para", "$": {"id": "sp000215", "view": "all"}, "$$": [{"#name": "__text__", "_": "In this paper, we introduce a brand new analytical perspective for analyzing and evaluating the IEEE 802.11-based networks. We identify a tightly-coupled relationship between the number of contending nodes and their contention window sizes in the networks. Based on the relationship, we propose a "}, {"#name": "italic", "_": "downsizing model"}, {"#name": "__text__", "_": " for reducing the computational complexity and for improving the simulation performance in the evaluation of the IEEE 802.11-based networks. We first formally prove that the proposed model preserves the operational characteristics of the original networks in their downsized networks through well-known analytical frameworks, such as the models proposed by Bianchi (2000) "}, {"#name": "cross-ref", "$": {"refid": "br000035"}, "_": "[7]"}, {"#name": "__text__", "_": ", Calí et al. (2000) "}, {"#name": "cross-ref", "$": {"refid": "br000010"}, "_": "[2]"}, {"#name": "__text__", "_": ", and Hu et al. (2006) "}, {"#name": "cross-ref", "$": {"refid": "br000040"}, "_": "[8]"}, {"#name": "__text__", "_": ". We then demonstrate that the proposed model speeds up the simulation by maximally "}, {"#name": "italic", "_": "two orders of magnitude"}, {"#name": "__text__", "_": ". Even though the simulation shows some difference between the results from an original network and those in its corresponding downsized networks in a wide range of network sizes and traffic patterns, the difference is acceptable since it has minimal values of 1% in most cases and maximum values of 10% in a very few cases. We also present the effectiveness of both the downsizing model and the downsizing-model-based simulation in comparison with other performance models and simulation techniques. As the size and complexity of wireless networks are increasing nowadays, we vision that the new proposed model will be of great advantage in conducting fast and accurate packet-level wireless simulations, as well as being a helpful tool for performing the numerically tractable theoretical studies for extensive performance evaluations, such as determining the network-wide throughput or end-to-end delays."}]}]}]}]}}