{"pii": "S0895717711007722", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "class": "author", "id": "aep-abstract-id28"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id29"}, "$$": [{"#name": "simple-para", "$": {"id": "sp000105", "view": "all"}, "_": "Over the years, a wireless mesh network (WMN) has been considered as a leading technology for providing Quality of Service (QoS) aware services to end users thanks to its features such as low deployment and maintenance costs. To obtain the maximum throughput in a WMN, an efficient routing and channel assignment is required. But there are certain constraints in the WMN such as end-to-end delay, interference, and available bandwidth which limits the QoS aware service availability to the end users. Moreover, predicting traffic demand is challenging due to the varying needs of the users which further limits the throughput. Hence, to overcome these difficulties, in this paper we propose a utility-based multicast routing and channel assignment (UBMR-CA) scheme. The two main objectives of the proposed scheme are the loop free routing and minimization of the total utility from a source to a destination at any time. The problem is formulated as a linear programming (LP) problem along with the constraints. The utility for a link is calculated using a utility weight metric (UWM) which is used for sending multicast messages from a source to destinations. Once the utility for all the links is calculated, these links are assigned to a particular channel keeping in view of various constraints such as capacity, bandwidth, and interference between different links. The performance of the proposed scheme is evaluated using extensive simulation with respect to various parameters such as aggregate throughput, fairness, delay, packet loss and collision probabilities, and total execution time. The proposed UWM is also compared with existing routing metrics in the literature. The results obtained from our simulation show that the proposed scheme outperforms existing schemes with respect to the above defined parameters."}]}]}]}}