{"pii": "S0893395222044891", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "Abs1", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cestitle10"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara240", "view": "all"}, "$$": [{"#name": "__text__", "_": "The histologic distinction between peritoneal epithelioid mesotheliomas and serous carcinomas diffusely involving the peritoneum may be difficult, but it can be facilitated by the use of immunohistochemistry and electron microscopy. D2-40 and podoplanin are two recently recognized lymphatic endothelial markers that can be expressed in normal mesothelial cells and mesotheliomas. The purpose of this study is to compare the value of these new mesothelial markers with those that are commonly used for discriminating between mesotheliomas and serous carcinomas, and also to determine the current role of electron microscopy in distinguishing between these malignancies. A total of 40 peritoneal epithelioid mesotheliomas and 45 serous carcinomas of the ovary (15 primary, 30 metastatic to the peritoneum) were investigated for the expression of the following markers: D2-40, podoplanin, calretinin, keratin 5/6, thrombomodulin, MOC-31, Ber-EP4, B72.3 (TAG-72), BG-8 (Lewis"}, {"#name": "sup", "$": {"loc": "post"}, "_": "Y"}, {"#name": "__text__", "_": "), CA19-9, and leu-M1 (CD15). All 40 (100%) of the mesotheliomas reacted for calretinin, 93% for D2-40, 93% for podoplanin, 93% for keratin 5/6, 73% for thrombomodulin, 13% for Ber-EP4, 5% for MOC-31, 3% for BG-8, and none for B72.3, CA19-9, or leu-M1. All 45 (100%) serous carcinomas were positive for Ber-EP4, 98% for MOC-31, 73% for B72.3, 73% for BG-8, 67% for CA19-9, 58% for leu-M1, 31% for keratin 5/6, 31% for calretinin, 13% for D2-40, 13% for podoplanin, and 4% for thrombomodulin. After analyzing the results, it is concluded that Ber-EP4 and MOC-31 are the best negative mesothelioma markers for differentiating between epithelioid mesotheliomas and serous carcinomas. The best discriminators among the positive markers for mesotheliomas are D2-40, podoplanin, and calretinin. From a practical point of view, Ber-EP4 and MOC-31, in combination with calretinin, and/or D2-40 or podoplanin allow the differential diagnosis to be established between mesothelioma and serous carcinoma in nearly all instances. As a clear distinction could be made between these two malignancies in all of the cases in which electron microscopy was performed, this technique can be very useful in establishing the correct diagnosis when the immunohistochemical results are equivocal or further support of a diagnosis of either mesothelioma or serous carcinoma is needed."}]}]}]}]}}