{"pii": "S0892687523005794", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0095"}, "$$": [{"#name": "list-item", "$": {"id": "o0095"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0265", "view": "all"}, "_": "The 21st Century mining industry holds promise for smart and sustainable mining practices."}]}, {"#name": "list-item", "$": {"id": "o0100"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0270", "view": "all"}, "_": "Technological advancements and an adequately skilled human workforce are key to migrating from command-and-control systems to integrated and intelligent remote operation centres (I2ROCs)."}]}, {"#name": "list-item", "$": {"id": "o0105"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0275", "view": "all"}, "_": "To date, few mining companies have achieved integrated remote operation centres IROCs, partially due to siloed data and privacy issues."}]}, {"#name": "list-item", "$": {"id": "o0110"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0280", "view": "all"}, "_": "Our study reveals that I2ROCs can bridge the gap between digitalisation strategies and the implementation of new technology, in a people-centric environment."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "The futuristic view of smart mines is the attainment of automated self-governed mines without human intervention throughout the value chain. However, reality entails a hybrid environment where humans and machines must effectively work together, with a bias towards machines highly aiding human capabilities. The minerals industry will require systems, processes and strategies to navigate this hybrid environment and transitional period. In this work, we focus on the role that integrated remote operation centres (IROCs) will play in ensuring that mining companies continue to get value from technological advancements during the transformation period. A review of IROC implementations by leading mining companies revealed that most functions in IROCs are powered by low-level artificial intelligence, in which most capabilities are goal-oriented. In this situation, automated machines and processes are programmed to accomplish specific tasks without a two-way intelligent interaction with humans. An integrated and intelligent remote operation centre can provide additional benefits. We refer to such a facility as I2ROC. I2ROCs offer opportunities beyond the traditional command-and-control capabilities by providing analytical insights and the interaction between people and machines, which contributes to better decision-making, ultimately improving performance measurability. In this paper, several enablers of I2ROCs are identified, as well as drivers that will accelerate I2ROCs' attainment. The human element is critical in achieving the 21st Century mining model. As such, this paper takes a two-dimensional approach focusing on the role of humans and technology in the future mining model. Key factors are explored, such as the required skillset and how these skills can be enhanced. Specifically, we present essential elements defining I2ROCs and the critical requirements for a digitalised workforce fit for operation within I2ROCs. Our findings provide a comprehensive framework for multiple stakeholders to collaboratively pursue I2ROCs through effective education, training, and governance, fostering a more sustainable and resilient future."}]}]}]}}