{"pii": "S0926580521001138", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab0005", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0115", "view": "all"}, "_": "Solutions for monitoring and control of the digital technologies in the residential and tertiary sector are lagging in terms of data exchange and easy deployment. The question arises whether current technologies allow cross-functional integration of data. This paper explores an IoT (Internet of Things) solution in controlling the HVAC system and monitoring of environmental, electric and comfort parameters in a real building. The implemented IoT solution proved to be flexible in terms of data exchange, deployment and debugging time in small and medium-size buildings and thus the IoT integration-based approach to be more efficient. This approach opens new possibilities for a wider set of beneficiaries. As future research, we are considering both extending our solution to other buildings within the university campus premises and on developing predictive analytics services."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "ab0010", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st1010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0135", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l4065"}, "$$": [{"#name": "list-item", "$": {"id": "li4145"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p4145", "view": "all"}, "_": "A new wired and wireless monitoring system based on IoT architecture. The solution has 64 data points which monitor environmental, comfort, electric and HVAC parameters."}]}, {"#name": "list-item", "$": {"id": "li7150"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p7150", "view": "all"}, "_": "An in house built wireless sensor for monitoring the comfort parameters. The sensor is based on LoRaWAN technology and runs on battery which, through a series of optimization, is able to keep the sensor online for more than 5 years. The timestep for data transmission is set to 1 minute."}]}, {"#name": "list-item", "$": {"id": "li8155"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p8155", "view": "all"}, "_": "A software module which controls the HVAC system. The solution is based on a wireless sensor which sends the data to a PID controller through MQTT network. The controller is able to maintain a comfort temperature set by the user."}]}, {"#name": "list-item", "$": {"id": "li1160"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p9160", "view": "all"}, "_": "An aggregator which allows cross-functional integration of data from wireless and wired sensors. The aggregator concentrates the data flows from all the datapoints and stores the information into the local cloud."}]}, {"#name": "list-item", "$": {"id": "li2165"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p9165", "view": "all"}, "_": "A communication network based on MQTT protocol. The protocol allows an efficient way for the devices to communicate which each other. Moreover, the protocol allows facile integration of other devices outside the building premises, making it easy to deploy and scale complex IoT solutions."}]}, {"#name": "list-item", "$": {"id": "li1165"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p1165", "view": "all"}, "_": "A deployed local cloud solution which offers storage capacity for data and also provides a self-managed observability stack tailored for enterprises."}]}]}]}]}]}]}}