{"pii": "S0920548917301113", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "id": "absh001", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectt0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0001", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "Review of current challenges for the structural health monitoring of critical infrastructures."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "Study of communication technologies and protocols for the structural health monitoring of critical infrastructures."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "Review of commercial solutions and real deployments for the structural health monitoring of critical infrastructures."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "Survey of WSN-based middlewares for the structural health monitoring of critical infrastructures."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0001", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectt0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0002", "view": "all"}, "_": "Critical Infrastructure Protection (CIP) has become a priority for every country around the world with the aim of reducing vulnerabilities and improving protection of Critical Infrastructures (CI) against terrorist attacks or natural disasters, among other threats. As part of CIP, Structural Health Monitoring (SHM) is defined as the process of gathering basic information that allows detecting, locating and quantifying vulnerabilities early on (fatigue cracking, degradation of boundary conditions, etc.) thereby improving, the resilience of the CI. Recent advances in electronics, wireless communication and software are expected to open the door to a new era of densely connected devices sharing information worldwide, known as the Internet of Things (IoT), in which Wireless Sensor Networks (WSNs) play an important role. The combined use of IoT/WSNs together with industrial sensors in SHM provide an ad-hoc, inexpensive and easy way of deploying a monitoring system, where data can be shared among different entities. SHM requirements are challenging and diverse and therefore several different technologies may be used in the same deployment. At the same time the use of a middleware can substantially simplify and speed up the development of applications for SHM. Taking into account the challenges of SHM systems, this paper provides a review of the most novel and relevant wireless technologies and a state-of-the-art middleware for WSNs focusing on SHM specific requirements."}]}]}]}}