{"pii": "S0925527324001932", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Tracking and tracing devices can provide real-time information from the supply chain and enable digital transformation in the logistics and supply chain industry. In this connection, Logistics 4.0 refers to the potential for information technology and smart connected assets to be used in logistics in the same way as the Industry 4.0 concept which has been applied in operations and manufacturing. This paper analyses current tracking and tracing-focused applications that can provide value for logistics operations through a case study approach."}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "This study employs an exploratory multiple-case study approach, which is based on interviews with development project stakeholders. The paper analyses three industrial case studies and how tracking/tracing applications are connected to value processes."}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "The findings of this study show that the value of Logistics 4.0, through the deployment of tracking/tracing applications, is delivered in terms of operational efficiency, visibility, transparency, and safety/security. The payback depends on the volume of transactions, the possibility of reusing the tracking tags, the duration of trips, and the supply chain structure. The paper provides insight into how Logistics 4.0 technology can enhance logistics performance value. Based on the analysis, the study proposes the following potential application domains: (1) intermodal tracking of the shipments for operations control, (2) asset management of containers, and (3) certification of the process steps and authenticity."}]}]}]}}