{"pii": "S0925346724012370", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "This article introduces, characterizes, and experimentally validates an innovative design for a compact-sized metamaterial (MM) perfect absorber (PA) for electromagnetic (EM) energy harvesting (EH) applications. The absorber design, comprised of three octagonal ring resonators made of annealed copper, incorporates split gaps at 45-degree inclinations within the uppermost and middle resonators. A split strip line connects the inner octagonal ring resonators, while the split gaps of the outermost and inner rings are filled with a 50 Ω resistive load. This structure is made on a Rogers RT5880 substrate, and the back side of the proposed design is entirely coated with annealed copper. The proposed absorber achieves precise impedance matching with free space, facilitating efficient absorption and redirecting EM power toward the resistive loads. The absorber demonstrates absorption peaks of 99.98 % at 2.4 GHz and 99.99 % at 4.9 GHz. In addition, the efficiency of absorption is assessed for different incident (θ) and polarization angles (ϕ) in both the Transverse Electric (TE) and Transverse Magnetic (TM) modes. Simulated harvesting efficiencies of 95.33 % at 2.4 GHz and 95.99 % at 4.9 GHz are recorded. An experimental validation is performed using a 3 × 3 array that measures 30 × 30 mm. The tests are carried out in an anechoic chamber. The measured harvesting efficiencies strongly correlate with the simulated results, indicating the reliability of the proposed design. This absorber's efficiency and compact size make it an excellent option for EH systems in wireless sensor networks (WSNs)."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "This work presents, characterizes, and tests a novel compact metamaterial perfect absorber for electromagnetic energy harvesting."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The proposed absorber precisely matches free space impedance, efficiently absorbing electromagnetic power and directing it to resistive loads."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The absorber shows 99.98 % absorption at 2.4 GHz and 99.99 % at 4.9 GHz, with efficiency tested for various θ and ϕ in TE and TM modes."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "The simulated harvesting efficiencies are recorded as 95.33 % at 2.4 GHz and 95.99 % at 4.9 GHz."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "A 3 × 3 array (30 × 30 mm) is tested in a controlled anechoic chamber, showing strong correlation between measured and simulated efficiencies."}]}]}]}]}]}]}}