{"pii": "S0920548917301861", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "id": "absh001", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectt0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0001", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "Protocol stack and mechanisms for robust unattended long lasting operation."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "WSN are not generally deployed by experts. Deployment phase is often a complex task."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "Related solutions require external tools or devices and technical skills."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "Our WSN includes an easy to use Quality test tool during deployment."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0001", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectt0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0002", "view": "all"}, "_": "Industrial Internet of Things (IIoT) is a disruptive paradigm which will bring new ways of monitoring, control and management for Industry 4.0 and Smart Cities. It relies on smart and connected sensors enabled by a new generation of communication technologies such as Wireless Sensor Networks (WSN). Although various solutions are becoming available, the reality is most of the end users of these systems won’t be communications experts, so the complexity and deployment difficulties are strong barriers for adopting this technology. This article briefly summarizes the state of art of current industrial wireless sensor networks technology, and presents the concept of Deploy&Forget network: a solution to enable the rapid deployment of WSN by assisting users onsite, reducing time and complexity of deployment, and includes a designed protocol stack to ensure unattended and long lasting operation. This technology emerges as an evolution of previous WSN works where these problems where clearly identified, and has been deployed and validated in water management tasks for Valencia, energy measurement in offices, and contextual monitoring for “Zero-Defect Manufacturing” for Industry 4.0."}]}]}]}}