{"pii": "S0925231223008317", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1908", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1909"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1911", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1912", "view": "all"}, "_": "In the era of sustainable smart agriculture, a vast amount of agricultural news text is posted online, accumulating significant agricultural knowledge. To efficiently access this knowledge, effective text classification techniques are urgently needed. Deep learning approaches, such as fine-tuning strategies on pre-trained language models (PLMs), have shown remarkable performance gains. Nonetheless, these methods face several complex challenges, including limited agricultural training data, poor domain transferability (especially across languages), and complex and expensive deployment of large models. Inspired by the success of recent ChatGPT models (e.g., GPT-3.5, GPT-4), this work explores the potential of applying ChatGPT in the field of agricultural informatization. Various crucial factors, such as prompt construction, answer parsing, and different ChatGPT variants, are thoroughly investigated to maximize its capabilities. A preliminary comparative study is conducted, comparing ChatGPT with PLMs-based fine-tuning methods and PLMs-based prompt-tuning methods. Empirical results demonstrate that ChatGPT effectively addresses the mentioned research challenges and bottlenecks, making it an ideal solution for agricultural text classification. Moreover, ChatGPT achieves comparable performance to existing PLM-based fine-tuning methods, even without fine-tuning on agricultural data samples. We hope this preliminary study could inspire the emergence of a general-purpose AI paradigm for agricultural text processing."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1914", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1915"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1917", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1918", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1920"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1921"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1924", "view": "all"}, "_": "We propose ChatAgri, an agricultural text classification approach based on ChatGPT."}]}, {"#name": "list-item", "$": {"id": "d1e1926"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1929", "view": "all"}, "_": "We design multiple prompting methods to harness ChatGPT’s understanding potential."}]}, {"#name": "list-item", "$": {"id": "d1e1931"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1934", "view": "all"}, "_": "ChatAgri demonstrates competitive performance compared to PLM fine-tuning methods."}]}, {"#name": "list-item", "$": {"id": "d1e1936"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1939", "view": "all"}, "_": "With limited data ChatAgri outperforms PLM fine-tuning methods in few-shot scenarios."}]}, {"#name": "list-item", "$": {"id": "d1e1941"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1944", "view": "all"}, "_": "Multi-linguistic test confirm ChatAgri’s remarkable cross-linguistic transferability."}]}]}]}]}]}]}}