{"pii": "S0926580523001917", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0030", "view": "all"}, "_": "The construction industry is facing enormous pressure to adopt digital solutions to solve the industry's inherent problems. The digital twin has emerged as a solution that can update a BIM model with real-time data to achieve cyber-physical integration, enabling real-time monitoring of assets and activities and improving decision-making. The application of digital twins in the construction industry is still in its nascent stages but has been steadily growing over the past few years. A wide variety of emerging technologies are being used in the development of digital twins in diverse applications in construction but it is not immediately clear from the literature which ones are key to the successful development of digital twins, necessitating a systematic literature review with a focus on technologies. This paper aims to identify the key technologies used in the development of digital twins in construction in the existing literature, the research gaps and the potential areas for future research. This is achieved by conducting a systematic review of studies with demonstrative case studies and experimental setups in construction. Based on the observed research gaps, prominent future research directions are suggested, focusing on technologies in data transmission, interoperability and data integration and data processing and visualisation."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0035", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Essential components of digital twin applications in construction."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "State-of-the art of existing technologies for digital twin applications in research literature."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Research gaps and future research directions for technologies in digital twin applications."}]}]}]}]}]}]}}