{"pii": "S0926580519311288", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab0005", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0105", "view": "all"}, "_": "The Industry Foundation Classes (IFC) are a prevalent data model in which Building Information Models can be exchanged, typically with a file-based nature. Processing the full extent of these models can be time-consuming. Considering the multi-disciplinary nature of the construction industry, stakeholders will typically only be interested in a small subset, depending on the purpose of the exchange. Therefore, the retrieval of relevant subsets, whether spatially, based on discipline, or others, is necessary to effectively consume such datasets in downstream applications."}, {"#name": "simple-para", "$": {"id": "sp0110", "view": "all"}, "_": "Prevalent encoding forms of IFC models are text-based and do not facilitate random-access seeking within the file and do not impose an ordering on the definition of elements within the file. Therefore, typically, the entire file needs to be read in order to find the data of interest. Furthermore, text-based data is slower to parse in comparison to binary data."}, {"#name": "simple-para", "$": {"id": "sp0115", "view": "all"}, "_": "This paper assesses a binary serialization format originating from the family of EXPRESS standards. It is based on an existing open, binary, hierarchical data format called HDF5 that allows random access to specific instances and therefore efficient retrieval of relevant subsets. The block-level, transparent compression yields a reduction of file sizes as compared to traditional serializations. Fully specified datatypes embedded in the exchange guarantee interoperable use."}, {"#name": "simple-para", "$": {"id": "sp0120", "view": "all"}, "_": "In this paper, several serialization profiles are introduced that cater to specific use cases by governing storage settings. Advanced functionality from the HDF5 library is applied to offer novel paradigms for fine-grained access rights, varying level of detail, revision management and aggregation of aspect models."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "ab0010", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0125", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "A binary serialization format for IFC files is introduced and investigated."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Profound reductions of access time is realized to specific information in the model."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The format is suitable for long-term digital preservation."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The format facilitates novel paradigms for federated storage and level of detail."}]}]}]}]}]}]}}