{"pii": "S0925753523000024", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0390"}, "$$": [{"#name": "list-item", "$": {"id": "o1210"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p1210", "view": "all"}, "_": "The concepts of systems, infrastructure and governance are analysed in literature."}]}, {"#name": "list-item", "$": {"id": "o1215"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p1215", "view": "all"}, "_": "The conceptual analysis advances the intellectual progression of safety and security."}]}, {"#name": "list-item", "$": {"id": "o1220"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p1220", "view": "all"}, "_": "The kaleidoscope for integrative system analysis (KISA) led the literature review."}]}, {"#name": "list-item", "$": {"id": "o1225"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p1225", "view": "all"}, "_": "An understanding of the state of the art in the current literature is presented."}]}, {"#name": "list-item", "$": {"id": "o1230"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p1230", "view": "all"}, "_": "Governance networks need to systemically address adaption, emergence and entropy."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "The reliability of infrastructure that is critical to society’s functionality, survival and progression has gained significance for both national security and research because of its large-scale and interdependent nature. However, the theoretical basis of the relatively new research field of critical infrastructure is incomplete and the common parlance about the underlying concepts is ambiguous. This article addresses this issue and presents the results of a substantial review of scientific literature on the concepts of systems, infrastructure and governance. The results demonstrate that the concepts encounter a common challenge in characterising their key elements, structures and processes because of their recursive nature. The multi-level character of critical infrastructure systems provokes governance to systemically address the properties of adaption, emergence and entropy which the complex system-of-systems exhibits. This article contributes with both a conceptual study of the terms system, infrastructure and governance and a detailed review of the state of the art regarding these concepts in the current scientific literature to an enhanced understanding of the theoretical foundations of the associated fields. Subsequent research could interrelate other concepts, such as vulnerability, resilience, sustainability and feedback with the provided state of the art."}]}]}]}}