{"pii": "S0926580524004400", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0120", "view": "all"}, "_": "Early detection of cracks in reinforced concrete caused by chloride intrusion is crucial for effective maintenance. This paper develops and compares AI-assisted models that use ultrasonic pulse waves to automatically assess early-stage concrete damage, particularly cracks caused by steel corrosion. Data were collected from 108 concrete cubes with various mixture designs, cover depths, and steel corrosion levels induced by the impressed current technique. The AI models, particularly convolutional neural networks (CNNs), outperformed traditional regression models, achieving up to 84% classification accuracy. The systematic and automated features of the AI-assisted algorithm enable reliable, consistent and rapid ultrasonic wave data analysis, which is especially beneficial for the condition assessment of large infrastructure systems. This advancement inspires further research into integrating automated IoT and robotics-assisted systems for comprehensive infrastructure monitoring."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0125", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0260"}, "$$": [{"#name": "list-item", "$": {"id": "li0375"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0375", "view": "all"}, "_": "AI trained with ultrasonic analysis enhances classification of steel corrosion-induced concrete damage"}]}, {"#name": "list-item", "$": {"id": "li0380"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0380", "view": "all"}, "_": "Data for training the models was collected from 108 specimen cubes with various properties and subjected to corrosion"}]}, {"#name": "list-item", "$": {"id": "li0385"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0385", "view": "all"}, "_": "Classification based on AI models outperforms conventional techniques, with convolutional neural networks performing best"}]}, {"#name": "list-item", "$": {"id": "li0390"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0390", "view": "all"}, "_": "The study demonstrates the feasibility of using AI for enhanced efficiency and automated damage evaluation"}]}]}]}]}]}]}}