{"pii": "S0926580524000335", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0085", "view": "all"}, "_": "This study explored the performance of ten pre-trained CNN architectures in detecting and classifying asphalt pavement cracks from images. A comparison of eight optimisation techniques led to developing an optimised pre-trained CNN model tailored for crack classification, with DenseNet201 emerging as the most effective, closely followed by ShuffleNet and ResNet101. Conversely, VGG16 exhibited notably lower accuracy among the models evaluated. Through the application of diverse feature selection techniques as optimisers, DenseNet201 consistently outperformed others, followed by DarkNet19 and Xception. Despite employing different optimisers, VGG16 and VGG19 consistently demonstrated inferior performance. The research introduced a novel approach utilising the DenseNet201 model and the GWO optimiser for asphalt pavement crack classification, validated against various CNN models. Its robustness was verified by testing against images contaminated with differing levels and types of noise, yielding promising outcomes. Results underscore the method's potential for accurately detecting diverse crack types, implying applicability in real-world scenarios."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0090", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "10 pre-trained CNN architectures for pavement crack detection and classification were compared."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Eight optimisation techniques on CNN models led to the selection of DenseNet201 as the best model."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "DenseNet201 achieved the highest accuracy at 94.12%, followed by ShuffleNet and ResNet101 at 94.07% and 93.83%, respectively."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The study outlines a method for classifying pavement cracks using DenseNet201 and the GWO optimiser."}]}, {"#name": "list-item", "$": {"id": "li0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "The proposed optimised OpDenseNet201 architecture was tested across various epochs."}]}]}]}]}]}]}}