{"pii": "S092523122400198X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e3732", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e3733"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e3735", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e3736", "view": "all"}, "_": "In today’s world, it is vital to have strong cybersecurity measures in place. To combat the ever-evolving threats, adopting advanced models like cybersecurity mesh is necessary to enhance our protection. Cybersecurity mesh is an architecture scalable, flexible, composable, robust and resilient and allows the interoperability and coordination between intelligent systems to provide security services. Designing a cybersecurity mesh faces three major challenges: scalability, distributed or federated systems, and technology integration. For the design, it is necessary to apply security tools that support scalability because millions and millions of data are stored, processed, and analysed. Federated systems are needed to improve interoperability in a decentralized cybersecurity mesh. However, it can be tough to integrate different security tools and communication protocols. Cryptographic algorithms and AI models like federated learning, swarming intelligence and blockchain technologies are useful for security services. It is essential to study the integration of existing methods to determine the best technology for the job. We conduct a comprehensive analysis of intelligent systems, including federated learning, blockchain technology, and swarming intelligence, with a particular focus on how they have been and can be used to enhance cybersecurity. We examine the latest trends in these technologies, explore their connections, and weigh the pros and cons of each approach. To conduct this review, we utilized the Web of Science and Scopus databases and followed the PRISMA guidelines."}]}]}]}}