{"pii": "S0926580524005375", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0125", "view": "all"}, "_": "Organisations increasingly rely on data-driven strategies, utilising analytics to achieve competitive advantages. This paper systematically investigates the integration of big data into Building Information Modeling (BIM) within the Architecture, Engineering, and Construction (AEC) sectors, named “big BIM data.” Employing mixed methods of systematic and bibliometric analysis, it synthesises findings from 125 records published 2013–23. While many studies are at preliminary stages with conceptual or small-scale experimental approaches, the paper categorises its results into four domains: AEC organisational infrastructure, big BIM data (IT) infrastructure, AEC organisational strategic domain, and big BIM data (IT) strategic domain, aligned with the Strategic Alignment Model (SAM), exploring organisational competencies, governance factors, and strategic frameworks. This paper introduces the AEC Organisational - Big BIM Data SAM as the research agenda to implement big BIM data utilisation across AEC industry. This framework thoroughly addresses organisational dynamics while emphasising interconnectedness among individual projects, organisational tiers, and industry-wide standards."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0130", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "BIM and Big Data integration for construction industry is presented and analysed."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "A strategic alignment model is developed to implement big BIM data and its implications for Industry 4.0."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The industrial and strategic implications of big BIM data on the construction sector are presented."}]}]}]}]}]}]}}