{"pii": "S0925231219304217", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0002", "view": "all"}, "_": "Along with the fast growing web-based applications, the recommender system is now attracting much attention due to its core function that matches the target users’ interest with the potential resources from the massive online information. Since the recommender system is a user centric application, in this work, we propose a recommendation framework based on user interaction, so as to explore the user’s real-time interest from the instant feedback. Naturally, we utilize the tag information assigned to different resources as the medium for user interaction. During the interaction, the most effective tags will be provided for users to choose, and the chosen tag words will be considered as the personalized preference and utilized to dynamically adjust the recommendation list during the process. However, the interaction procedure may cause the problem of potential false dismissal during the candidate filtering. In this work, we propose to analyze the association between different tags, and utilize the tag co-occurrence to refine the recommendation candidate, so as to avoid false dismissal. To generate the recommendation list from the filtered candidates, we design the representation of user and resource characteristics based on tag information and user historical behavior. We distinguish the significance of each tag word for the corresponding resource item, so as to precisely describe the item feature. Probabilistic matrix factorization is employed in our work to overcome the rating sparsity, which is enhanced by embedding the similar user and resource information. The experiments on real-world datasets demonstrate that the proposed algorithm can achieve more accurate predictions and higher recommendation efficiency."}]}]}]}}