{"pii": "S0957417422005991", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e239"}, "$$": [{"#name": "section-title", "$": {"id": "d1e240"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e242"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e243"}, "_": "Multi-label classification (MLC) has recently attracted increasing interest in the machine learning community. Several studies provide surveys of methods and datasets for MLC, and a few provide empirical comparisons of MLC methods. However, they are limited in the number of methods and datasets considered. This paper provides a comprehensive empirical investigation of a wide range of MLC methods on a wealth of datasets from different domains. More specifically, our study evaluates 26 methods on 42 benchmark datasets using 20 evaluation measures. The evaluation methodology used meets the highest literature standards for designing and conducting large-scale, time-limited experimental studies. First, the methods were selected based on their use in the community to ensure a balanced representation of methods across the MLC taxonomy of methods within the study. Second, the datasets cover a wide range of complexity and application domains. The selected evaluation measures assess the predictive performance and efficiency of the methods. The results of the analysis identify RFPCT, RFDTBR, ECCJ48, EBRJ48, and AdaBoost.MH as the best-performing methods across the spectrum of performance measures. Whenever a new method is introduced, it should be compared with different subsets of MLC methods selected according to relevant (and possibly different) evaluation criteria."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e245"}, "$$": [{"#name": "section-title", "$": {"id": "d1e246"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e248"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e249"}, "$$": [{"#name": "list", "$": {"id": "d1e251"}, "$$": [{"#name": "list-item", "$": {"id": "d1e252"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e255"}, "_": "A comprehensive empirical investigation of multi-label classification methods."}]}, {"#name": "list-item", "$": {"id": "d1e257"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e260"}, "_": "A strict and robust evaluation methodology for large-scale benchmarking."}]}, {"#name": "list-item", "$": {"id": "d1e262"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e265"}, "_": "Evaluated 26 methods across 42 benchmark datasets using 20 evaluation measures."}]}, {"#name": "list-item", "$": {"id": "d1e267"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e270"}, "_": "Best overall methods are RFPCT, RFDTBR, ECCJ48, EBRJ48, and AdaBoost. MH."}]}]}]}]}]}]}}