{"pii": "S0957417424020086", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e606", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e607"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e609", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e610", "view": "all"}, "_": "The development of Social Media has caused an incredible change in the way people communicate and share information. It provides a set of platforms, web-based applications and services that facilitate the collaborative creation of content and the sharing of ideas and interests. Since its inception, Social Media technologies have been increasingly used in different fields that have integrated them into their daily lives. In Software Engineering, for example, it has caused a disruptive change in the software development model, changing the way that the projects are approached by promoting collaborative environments. This effect has led to the proliferation of the software development communities where huge amounts of information are published every day. Therefore, when a project is started and a development team needs to be assembled, it is difficult to select and identify the most suitable developer profiles for such a project by considering all the disseminated information. To solve this problem, we have proposed an ontology-based system to help find a suitable group of developers to develop a project. The system uses web services to extract user profiles from GitHub, and semantic technologies to represent and annotate the features of the extracted data. Then, when the system receives the natural language description of the project to be developed, it identifies and extracts relevant concepts such as technologies, platforms, tools, among others. As a result, it analyzes the extracted information and lists the most suitable developers to assemble a team of developers with the right technical skills to tackle the software project. For evaluation purposes, we generated a random list of GitHub profiles, and collected a corpus of documents describing research projects and patents. The system produced very promising results, achieving a MAP@5 and F-Measure of 0.68."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e612", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e613"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e615", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e616", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e618"}, "$$": [{"#name": "list-item", "$": {"id": "d1e619"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e622", "view": "all"}, "_": "Setting up a team with the right skills is a key for project success."}]}, {"#name": "list-item", "$": {"id": "d1e624"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e627", "view": "all"}, "_": "Features gathered from project descriptions help identify required skills."}]}, {"#name": "list-item", "$": {"id": "d1e629"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e632", "view": "all"}, "_": "Semantic technologies facilitates the integration and processing of heterogeneous data."}]}, {"#name": "list-item", "$": {"id": "d1e634"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e637", "view": "all"}, "_": "Semantically-enriched recommender system matches projects with developer profiles."}]}]}]}]}]}]}}