{"pii": "S0957417421004802", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "id": "ab005", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "An algorithm to mining multi-community structures of crowdsourced workers."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "A method for the worker characteristics model."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Considering workers' ability, activity, preference and community attributes."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Two optimization strategies to alleviate the recommended cold start problem."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Crowdsourcing as an important computing resource for the Crowd-based Cooperative, crowdsourcing workers, due to the complexity of their personnel composition and the ambiguity of group characteristics, make it difficult to accurately recommend suitable worker groups for the task. Recommending crowdsourcing tasks to suitable workers can greatly improve the efficiency and quality of the execution of crowdsourcing tasks. The current crowdsourcing recommendation algorithm is based on the single characteristics of the workers, ignoring the multi-dimensional characteristics of the workers and the community characteristics of the crowd. This paper proposes a worker group recommendation method based on multi-community collaboration (GRMBC) by utilizing the worker characteristics information extracted from crowdsourcing platform. Based on the characteristics of workers'reputation, preference and activity, the method divides the worker group into several characteristics communities with similar behavior to discover the potential multi-community structure in the crowdsourcing worker group, and then selects Top-N worker group for recommendation through the interaction among multi-communities. At the same time, we also proposed two mitigation strategies for the cold start problem of data in crowdsourcing. This paper uses the public data collected by AMT to do the experiments, and compares the aggregation results of the recommendations generated by different algorithms. The results show the recommendations generated by the GRBMC algorithm proposed in this paper performs the best comprehensively. When the GRBMC algorithm that considers both worker attributes and communi-ty characteristics has an accuracy improvement of 0.03 ~ 0.04 compared with not using the recommendation algorithm on each index, the accuracy of 0.01 ~ 0.02 is improved com-pared with the method considering single characteristic. Moreover, compared with the individual recommendation method of the workers, the recommendation method of the workers' group is more in line with the platform requirements, and can well reflect the wisdom of crowd wisdom."}]}]}]}}