{"pii": "S0952197623009296", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e816", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e817"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e819", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e820", "view": "all"}, "_": "Today, there are billions of connected IoT devices and their number continues to grow as they contribute to the digitalization of infrastructures. However, the deployment process of these smart wireless devices when delivered to customer premises is slow and error prone as each of them needs to be provisioned with authentication credentials to access the corporate network. In this paper, we propose HANNA, a human-friendly provisioning and configuration framework for smart devices, that extends the zero-touch paradigm to large IoT deployments by introducing voice assisted configuration in combination with large scale ad-hoc communications to overcome the initial installation effort of IoT deployments. The most prominent role in HANNA is played by the assisting device, which includes a voice assistant capable of correctly understanding a minimum number of keywords required for initial provisioning and configuration of the devices. The device’s role is to interact with the user and ensure that all provisioning details are received. These are then converted into appropriate machine instructions for further use by the mass provisioning mechanism. We provide an example prototype implementation of HANNA and evaluate the performance of the assisting device in the human-to-machine communication phase and the performance of the selected communication technique in the machine-to-machine communication phase. Our results show the potential of existing speech-to-text engines for this application area and also reveal shortcomings with respect to the robustness of the engines in office-like working environments as well as with respect to user’s gender and language proficiency level. Additionally we show that the proposed machine-to-machine provisioning approach is always faster compared to manual provisioning for cases with more than ten devices."}]}]}]}}