{"pii": "S0952197624004986", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The Industry 4.0 paradigm enables advanced data-driven decision-making processes leading many manufacturers to a digital transformation. Within this context, Predictive Maintenance (PdM) - i.e. a maintenance strategy that predicts failures in advance - based on Machine Learning (ML) - i.e. a set of algorithms to analyze data for pattern recognition - emerged as one of the most prominent data-driven analytical approaches for maximizing availability and efficiency of industrial systems. Indeed, there exists a considerable body of literature dealing with ML-based PdM where a wide set of ML algorithms has been applied to a broad range of industrial settings. Whilst this results in extensive knowledge on the topic, the need to choose the right algorithm for a specific task arises as a challenging issue since it is considered an essential stage in the development and implementation of an ML-oriented approach. To respond to such a necessity, this work proposes a conceptual framework to guide practitioners as well as non-expert users in ML algorithm selection for PdM issues. The aim is to provide a set of guidelines and recommendations for the identification of which ML techniques are likely to achieve valuable performance for specific tasks or datasets. First, the most commonly applied ML algorithms in PdM are analyzed together with their core characteristics, advantages, and disadvantages. Then, several decision variables depending on dataset and ML characteristics, learning objectives, accuracy and interpretability are considered. Finally, illustrative case studies are presented to demonstrate how the proposed framework can be adopted in real industrial applications."}]}]}]}}