{"pii": "S0952791523000456", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0020", "view": "all"}, "$$": [{"#name": "__text__", "_": "Typical hyper-IgE syndromes (HIES) are caused by autosomal-dominant-negative (DN) variants of "}, {"#name": "italic", "_": "STAT3"}, {"#name": "__text__", "_": " (Signal Transducer And Activator Of Transcription 3) or "}, {"#name": "italic", "_": "IL6ST"}, {"#name": "__text__", "_": " (Interleukin 6 Cytokine Family Signal Transducer), biallelic partial loss-of-function (LOF) variants of "}, {"#name": "italic", "_": "IL6ST"}, {"#name": "__text__", "_": ", or biallelic complete LOF variants of "}, {"#name": "italic", "_": "ZNF341"}, {"#name": "__text__", "_": " (Zinc Finger Protein 341). Including the two new cases described in this review, only 20 patients with autosomal-recessive (AR) ZNF341 deficiency have ever been reported. Patients with AR ZNF341 deficiency have clinical and immunological phenotypes resembling those of patients with autosomal-dominant STAT3 deficiency, but with a usually milder clinical presentation and lower NK (Natural Killer) cell counts. ZNF341-deficient cells have 50% the normal level of STAT3 in the resting state. However, as there is no clear evidence that STAT3 haploinsufficiency causes HIES, this decrease alone is probably insufficient to explain the HIES phenotype observed in the ZNF341-deficient patients. The combination of decreased basal expression level and impaired autoinduction of STAT3 observed in ZNF341-deficient lymphocytes is considered a more likely pathophysiological mechanism. We review here what is currently known about the "}, {"#name": "italic", "_": "ZNF341"}, {"#name": "__text__", "_": " gene and ZNF341 deficiency, and briefly discuss possible roles for this protein in addition to its control of STAT3 activity."}]}]}]}]}}