{"pii": "S0957417422015275", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e561", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e562"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e564", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e565", "view": "all"}, "_": "The embedding of features plays a critical role in the neural network-based recommendation model. The ID feature, which is discrete and high-dimensional sparse, contains the significant information for relevance reasoning in recommender system. However, most models use the same embedding method to address the encoding of all features. This results in inaccurate expression of ID features, as well as reduces the generalization ability of the model. Based on the assumption that learning higher-order information from the mixture of ID and other features by crossover and extraction operations provides limited benefits, or negative results, we propose an ID feature learning model (IFLM) to embed the ID tags independently and learn their interactions efficiently. IFLM separates the ID tags from the complete inputs as its exclusive input, then outputs the vectors with general data structure, thus, making it easily parallel to other deep recommendation models. Besides, IFLM generates the second-order cross feature from pairwise IDs and captures higher-order feature through the specific hidden layer, which is more efficient in learning the knowledge of ID features. We used our approach on three typical deep recommendation models. The experimental results showed that the optimized model produced better results than the corresponding baseline, in terms of prediction accuracy and convergence time."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e567", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e568"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e570", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e571", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e573"}, "$$": [{"#name": "list-item", "$": {"id": "d1e574"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e577", "view": "all"}, "_": "Recommendation models use the same method to embedding all features including IDs."}]}, {"#name": "list-item", "$": {"id": "d1e579"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e582", "view": "all"}, "_": "The embedding and learning approach reduces accuracy and generalization ability."}]}, {"#name": "list-item", "$": {"id": "d1e584"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e587", "view": "all"}, "_": "Embedding ID tags independently and learning their interactions efficiently."}]}, {"#name": "list-item", "$": {"id": "d1e589"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e592", "view": "all"}, "_": "Optimizing prediction accuracy and convergence time of deep recommendation models."}]}]}]}]}]}]}}