{"pii": "S0950705124000455", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e2132", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e2133"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e2135", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e2136", "view": "all"}, "_": "Temporal relation extraction aims to infer the temporal order of either two events in the document. Because of the nature of events in real life, severe imbalanced temporal relation classes exist in the temporal relation extraction task. Even though various methods have been proposed to improve the overall performance, the accuracy of these methods on minority temporal classes is limited. In this work, we present a contrastive prototypical learning architecture to address this problem, which explicitly models the spatial similarity between instances in the embedding space so that instances from minority classes can be distinguished from the large classes. To make it compatible with current temporal relation extraction settings, we propose a novel sampling memory queue-based method so that the architecture can be applied to a limited batch size scenario. We further design a context encoding layer that incorporates both contextualized information and linguistic features such as tense information and dependency. Our extensive experiments on TimeBank-Dense, TDDiscourse, and MATRES datasets demonstrate that our model can significantly improve the performance of minority relation classes and, therefore increase the overall learning ability."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e2138", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e2139"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e2141", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e2142", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e2144"}, "$$": [{"#name": "list-item", "$": {"id": "d1e2145"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e2148", "view": "all"}, "_": "A contrastive prototypical model in temporal relation extraction."}]}, {"#name": "list-item", "$": {"id": "d1e2150"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e2153", "view": "all"}, "_": "A memory queue method with two sample methods to track the support set of prototypes."}]}, {"#name": "list-item", "$": {"id": "d1e2155"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e2158", "view": "all"}, "_": "A document-graph context encoding layer to incorporate linguistic features."}]}, {"#name": "list-item", "$": {"id": "d1e2160"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e2163", "view": "all"}, "_": "The model improves the F1 of minority temporal classes compared to SOTA methods."}]}]}]}]}]}]}}