{"pii": "S0959652623034182", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "This study explores how the concept of greenwashing has evolved on social media and identifies the most dominant themes and stakeholders shaping these debates. Drawing on the extant literature on greenwashing and stakeholder theory, an in-depth empirical analysis was conducted on how greenwashing debates unfolded during 2006–2022 on the Twitter (now ‘X’) platform. The analysis is based on 496,276 unique tweets, which provide a detailed account of the main themes and stakeholders involved in online greenwashing debates. The findings indicate that greenwashing debates on social media are dominated by a limited number of themes, sectors, companies, and stakeholders. Over the last 10 years, three companies have consistently been in the top-10 list of tweets addressing greenwashing. Likewise, greenwashing debates on social media are often propagated by small groups of individuals, non-governmental organisations, and media outlets. This study provides new insights into the issues and stakeholders dominating greenwashing debates on social media and highlights the dynamic interplay between the accusers, accused, accomplices, and allies involved in these discussions."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Empirical analysis identifies key stakeholders and themes in greenwashing debates on social media (Twitter) from 2006 to 2022."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "We highlight the importance of interplay between online debate accusers, accused, accomplices, and allies."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Greenwashing debates have historically been centred around few companies and sectors."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Greenwashing debates on Twitter are dominated by a relatively narrow network of stakeholders."}]}]}]}]}]}]}}