{"pii": "S0957417423033018", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e3418", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e3419"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e3421", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e3422", "view": "all"}, "_": "Attributed graph clustering is a prominent research area, catering to the increasing need for understanding real-world systems by uncovering exhaustive meaningful latent knowledge from heterogeneous spaces. Therefore, the critical challenge of this problem is the strategy used to extract and integrate meaningful heterogeneous information from structure and attribute sources. To this end, in this paper, we propose a novel Nonnegative Matrix Factorization (NMF)-based model for attributed graph clustering. In this method, firstly, we filter structure and attribute spaces from noise and irrelevant information for clustering by applying Symmetric NMF and NMF during the clustering task, respectively. Then, to overcome the heterogeneity of discovered partitions from spaces, we suggest a new regularization term to inject the complementary information from the attribute partition into the structure by transforming them into their pairwise similarity spaces, which are homogeneous. Simultaneously, by setting orthogonality constraints on the discovered communities, we encourage the representation of distinct and non-overlapping communities within the attributed graph. Finally, we collect all these terms in a unified framework to learn a meaningful partition containing consensus and complementary information from structure and attributes. Then a new iterative multiplicative updating strategy is proposed to solve the proposed model, and its convergence is proven theoretically. Our experiments on the nine popular real-world networks illustrate the supremacy of our methods among eleven widely recognized and stat-of-the-arts attributed graph clustering methods in terms of accurately matching the ground truth and quality-based metrics."}]}]}]}}