{"pii": "S0952197623000325", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "attachments", "$$": [{"#name": "attachment", "$": {"xmlns:xocs": true}, "$$": [{"#name": "attachment-eid", "_": "1-s2.0-S0952197623000325-si1.svg"}, {"#name": "ucs-locator", "_": "https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S0952197623000325/STRIPIN/image/svg+xml/afe02f2bd68933bf59f2449ca05b8e74/si1.svg"}, {"#name": "file-basename", "_": "si1"}, {"#name": "abstract-attachment", "_": "true"}, {"#name": "filename", "_": "si1.svg"}, {"#name": "extension", "_": "svg"}, {"#name": "filesize", "_": "892"}, {"#name": "attachment-type", "_": "ALTIMG"}]}]}, {"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e1349"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1350"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e1352"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e1353"}, "$$": [{"#name": "__text__", "_": "In an Industry 4.0 ecosystem, all the essential components are digitally interconnected, and automation is integrated for higher productivity. However, it invites the risk of increasing cyber-attacks amid the current cyber explosion. The identification and monitoring of these malicious cyber-attacks and intrusions need efficient threat intelligence techniques or intrusion detection systems (IDSs). Reducing the false positive rate in detecting cyber threats is an important step for a safer and reliable environment in any industrial ecosystem. Available approaches for intrusion detection often suffer from high computational costs due to large number of feature instances. Therefore, this paper proposes a novel unsupervised IDS for Industry 4.0 which we term as: Unsupervised Intrusion Detection System for Industry 4.0 (UInDeSI4.0). We have substantiated the proposed UInDeSI4.0 approach through its experimentation on the well-known UNSW-NB15 Industry 4.0 dataset. The proposed UInDeSI4.0 employs feature selection approaches to obtain minimal and optimal features. These features are then used to train isolation forest to detect network traffic threats in an unsupervised manner. Accordingly, the proposed UInDeSI4.0 approach can efficiently differentiate between the normal events and the attacks or intrusions in environments with no label information. Experimental results show that the proposed UInDeSI4.0 provides better accuracy ("}, {"#name": "math", "$": {"xmlns:mml": true, "display": "inline", "id": "d1e1361", "altimg": "si1.svg"}, "$$": [{"#name": "mo", "_": "∼"}]}, {"#name": "__text__", "_": "63%) and a minimal feature set (nine) compared to traditional IDSs. In contrast to deep learning approaches, UInDeSI4.0 generates faster results with minimum features. In conclusion, we establish the superiority of UInDeSI4.0 approach as an accurate and computationally efficient IDS for Industry 4.0."}]}]}]}]}}