{"pii": "S0957417422021856", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e740", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e741"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e743", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e744", "view": "all"}, "_": "In recent years, it has become common for consumers to familiarize themselves with the latest fashion trends through the internet and engage in their own fashion-inspired shopping activities. Therefore, making fashion-inspired shopping and browsing activities (internet surfing in the fashion domain) comfortable is essential because it leads to interactions in the fashion industry. However, fashion is a fuzzy and complex domain that contains many abstract elements, and this ambiguity and complexity can hinder users’ deep interest in the fashion industry. Therefore, we define a novel technology and domain called “fashion intelligence” and propose a system based on a visual-semantic embedding method for automatically learning and interpreting fashion and obtaining answers to users’ questions. Our proposed method can embed the abundant abstract tag information in the same projective space as outfit images. Mapping of images and tags in a projective space helps search for outfit images using fashion-specific abstract words. In addition, visually estimating the degree of relevance between images and tags helps interpret abstract words. As a result, this research helps decrease fashion-specific ambiguity and complexity and supports the marketing activities and fashion choices of both experts and non-experts."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e746", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e747"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e749", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e750", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e752"}, "$$": [{"#name": "list-item", "$": {"id": "d1e753"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e756", "view": "all"}, "_": "A novel technology and research area called “fashion intelligence” is defined."}]}, {"#name": "list-item", "$": {"id": "d1e758"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e761", "view": "all"}, "_": "Full-body outfit images are embedded with rich fashion-specific abstract tags."}]}, {"#name": "list-item", "$": {"id": "d1e763"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e766", "view": "all"}, "_": "Effective learning methods with broad, complex backgrounds are presented."}]}, {"#name": "list-item", "$": {"id": "d1e768"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e771", "view": "all"}, "_": "Various applications of the system for real-world service are introduced."}]}, {"#name": "list-item", "$": {"id": "d1e773"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e776", "view": "all"}, "_": "Interpretation of fashion using the proposed system is demonstrated."}]}]}]}]}]}]}}