{"pii": "S0957417424002495", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1740", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1741"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1743", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1744", "view": "all"}, "_": "A botnet is a group of hijacked devices that conduct various cyberattacks, which is one of the most dangerous threats on the internet. Individuals or organizations can effectively detect botnets by analyzing abnormal behaviors in network traffic. Existing works focus on extracting the deterministic behavioral features, which highly rely on statistical features and existing botnet interaction structures, resulting in unsatisfactory detection accuracy, especially for unknown botnet traffic. The botnet detection method based on the original traffic bytes has more advantages in this regard, especially the use of mining payload information in the traffic to enhance the identification of abnormal botnet behavior is the focus of this study. In this paper, we propose a dual-mode botnet detection scheme, which takes the original traffic bytes as the object, one is to encode the implicit semantic relationship between the traffic bytes through a multi-layer Transformer encoder, and the other is the network traffic Image representation, the spatial relationship of traffic bytes is captured by a deep neural network, and then botnet detection is achieved by maximizing the mutual information between the two. We conduct comprehensive experiments with both known botnets and unknown botnets to evaluate our scheme. Experimental results show that for known botnets, our approach achieves 99.84% and 91.92% detection accuracy with CTU-13 and ISCX-2014 datasets, respectively, which is 3.04% and 2.54% more accurate compared with the state-of-art (DL). For unknown datasets, our scheme is 10.19% more accurate than the existing traffic representation."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1746", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1747"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1749", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1750", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1752"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1753"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1756", "view": "all"}, "_": "We extract the implicit semantic relationship of raw traffic for botnet detection."}]}, {"#name": "list-item", "$": {"id": "d1e1758"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1761", "view": "all"}, "_": "We propose a dual-modal botnet detection method (Bot-DM) based on raw traffic."}]}, {"#name": "list-item", "$": {"id": "d1e1763"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1766", "view": "all"}, "_": "We conduct extensive experiments to validate the superiority of the proposed methods."}]}, {"#name": "list-item", "$": {"id": "d1e1768"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1771", "view": "all"}, "_": "We compare the detection performance of unknown botnets in different traffic modes."}]}]}]}]}]}]}}