{"pii": "S0957417423011429", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1497", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1498"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1500", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1501", "view": "all"}, "_": "An evaluation is administered to measure students’ learning outcomes, which nowadays become challenging for instructors as student growth increases exponentially. Several models are proposed in the literature based on selected artificial intelligence algorithms that are once trained and then deployed. The problem with these kinds of systems is that the trained models are locked and cannot adjust to dynamically changing circumstances, leading to a drop in performance. Moreover, these systems only considered basic parameters for computing the semantic similarity, resulting in less accuracy. This paper develops an intelligent student evaluation model based on a predictive optimization approach, which considers question type, structure, necessary keywords, language, and conceptual aspects to evaluate the student’s answer. In order to enhance the performance of the proposed evaluation system, we have proposed a predictive optimization approach where a deep neural network is used as a learning module to learn from training data, and particle swarm optimization and gradient descent are used as an optimization scheme to optimize weighting parameters for the deep neural network. The proposed work uses and analyzes the real dataset of NTNU students’ exams to validate the proposed platform’s practicability. Initially, we will employ the natural language processing technique of deep learning in which semantic similarity score and other features will be used to compute the degree of relevance between actual answers and students’ provided answers. The proposed semantic similarity score algorithm is based on the WordNet library and Growbag dataset to check the solution’s semantics, conceptual aspects, and creativity. The resulting score will be used as a supervised machine-learning classification system feature. Performance of the classification model will be ensured using standard evaluation measures, including Precision, recall, and f-measure. The end goal of this platform is to acquire the grade against the student’s answer given as input in the developed platform."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1503", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1504"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1506", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1507", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1509"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1510"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1513", "view": "all"}, "_": "Develop an ISE model for open-ended question based on optimal learning."}]}, {"#name": "list-item", "$": {"id": "d1e1515"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1518", "view": "all"}, "_": "Develop a semantic similarity module using wordnet and Growbag dataset."}]}, {"#name": "list-item", "$": {"id": "d1e1520"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1523", "view": "all"}, "_": "Minimize feature space based on correlation index to reduce computational costs."}]}, {"#name": "list-item", "$": {"id": "d1e1525"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1528", "view": "all"}, "_": "Proof of concept of the proposed ISE is presented based on comprehensive analysis."}]}, {"#name": "list-item", "$": {"id": "d1e1530"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1533", "view": "all"}, "_": "Compare the similarity rate of the ISE with baseline models."}]}]}]}]}]}]}}