{"pii": "S0952197623004256", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e1252"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1253"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e1255"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e1256"}, "_": "To address the issues of high human interference and low efficiency in traditional manual methods for classifying and rating steel scrap, we propose the development of CSBFNet, a deep learning-based model for multi-category steel scrap classification and rating. Firstly, we built a 1:3 physical model of steel scrap quality inspection to simulate the unloading of a truck. We used a high-resolution vision sensor to capture the morphological characteristics of various steel scraps. Next, we trained the CSBFNet model using this data to obtain characteristic information for classifying and judging various types of scrap steel. Finally, we tested and improved the CSBFNet model at a Chinese steel mill. The results demonstrate that the model can effectively determine the automatic rating for different grades of scrap. The average accuracy rate of all types of steel scrap reaches 92.4% for the full category, with an mAP of 90.7%. Compared to traditional artificial quality detection methods, it has clear advantages in accuracy and fairness. This model solves the problem of evaluating the quality of steel scrap in the recycling process."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e1258"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1259"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e1261"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e1262"}, "$$": [{"#name": "list", "$": {"id": "d1e1264"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1265"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1268"}, "_": "Built a steel scrap quality inspection system based on machine vision related technologies."}]}, {"#name": "list-item", "$": {"id": "d1e1273"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1276"}, "_": "Combining Squeeze-Excitation attention mechanism and EfficientDet steel scrap intelligent classification and rating model."}]}, {"#name": "list-item", "$": {"id": "d1e1278"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1281"}, "_": "The intelligent inspection work for classification and rating of multi-category and multi-scale scrap is realized."}]}, {"#name": "list-item", "$": {"id": "d1e1283"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1286"}, "_": "Solve the problems of high risk, low rating accuracy, and easily questioned fairness in manual scrap rating."}]}]}]}]}]}]}}