{"pii": "S095937802200142X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Rainbows provide cultural ecosystem services that often have relational value."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Climate change will alter rainbow distribution by changing rainfall and cloud cover."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "By 2100, global rainbow occurrence may increase by ∼4–5 %"}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "High latitude and high elevation areas will likely gain rainbows."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Rainbows contribute to human wellbeing by providing an inspiring connection to nature. Because the rainbow is an atmospheric optical phenomenon that results from the refraction of sunlight by rainwater droplets, changes in precipitation and cloud cover due to anthropogenic climate forcing will alter rainbow distribution. Yet, we lack a basic understanding of the current spatial distribution of rainbows and how climate change might alter this pattern. To assess how climate change might affect rainbow viewing opportunities, we developed a global database of crowd-sourced photographed rainbows, trained an empirical model of rainbow occurrence, and applied this model to present-day climate and three future climate scenarios. Results suggest that the average terrestrial location on Earth currently has 117 ± 71 days per year with conditions suitable for rainbows. By 2100, climate change is likely to generate a 4.0–4.9 % net increase in mean global annual rainbow-days (i.e., days with at least one rainbow), with the greatest change under the highest emission scenario. Around 21–34 % of land areas will lose rainbow-days and 66–79 % will gain rainbow-days, with rainbow gain hotspots mainly in high-latitude and high-elevation regions with smaller human populations. Our research demonstrates that alterations to non-tangible environmental attributes due to climate change could be significant and are worthy of consideration and mitigation."}]}]}]}}