{"pii": "S0959652622049964", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The building Life Cycle Assessment (LCA) applied to buildings requires collecting and organizing large quantities of data over all building life cycles. To overcome specific difficulties related to the system boundaries definition and life cycle inventory stages, the literature recognizes that systematic building decomposition methods (SBDM) can be used to classify building components, elements and materials, as well as to increase the reliability and transparency of LCA results, particularly for embodied carbon and other environmental impacts. In this paper developed in the context of the research project IEA EBC Annex 72, the authors aim to provide a basis for understanding how different SBDMs decompose a building and classify its parts. This study analyses the implications of using different SBDM along the steps of an LCA study. Such as to support transparent and comprehensible (de)composition of the life cycle inventory (LCI), definition of service lives for different building parts or clear and comparable communication of assessment results and environmental hotspots particularly when using digital tools to conduct LCA. The study analyses 12 national SBDMs used in participating countries of IEA EBC Annex 72. To showcase the implications of SBDMs in building LCA practice, an office building was used as a common case study for applying the different SBDM approaches. Differences were identified among the decomposition levels and the consequences of these differences on the LCI organization. Thus, some of the main contributions to this study are the investigation of different SBDM approaches for improving the design workflows, by discussing BIM model definitions and the recommendation to use hierarchically based methods to allow the building elements and materials decomposition."}]}]}]}}