{"pii": "S0950705122011327", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e1889"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1890"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e1892"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e1893"}, "_": "Social media platforms present significant threats against underage users targeted for predatory intents. Many early research works have applied the footprints left by online predators to investigate online grooming. While digital forensics tools provide security to online users, it also encounters some critical challenges, such as privacy issues and the lack of data for research in this field. Our literature review investigates all research papers on grooming detection in online conversations by looking at the psychological definitions and aspects of grooming. We study the psychological theories behind the grooming characteristics used by machine learning models that have led to predatory stage detection. Our survey broadly considers the authorship profiling research works used for grooming detection in online conversations, along with predatory conversation detection and predatory identification approaches. Various approaches for online grooming detection have been evaluated based on the metrics used in the grooming detection problem. We have also categorized the available datasets and used feature vectors to give readers a deep knowledge of the problem considering their constraints and open research gaps. Finally, this survey details the constraints that challenge grooming detection, unaddressed problems, and possible future solutions to improve the state-of-the-art and make the algorithms more reliable."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e1895"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1896"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e1898"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e1899"}, "$$": [{"#name": "list", "$": {"id": "d1e1901"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1902"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1905"}, "_": "Presents a comprehensive survey of child exploitation in chat logs."}]}, {"#name": "list-item", "$": {"id": "d1e1907"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1910"}, "_": "Provides in-depth analysis of available datasets and grooming detection techniques."}]}, {"#name": "list-item", "$": {"id": "d1e1912"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1915"}, "_": "Outlines challenges and future perspectives for online grooming detection."}]}]}]}]}]}]}}