{"pii": "S0957417424013587", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "User experience is a crucial aspect of software quality, and while various guidelines and heuristics have been proposed to enhance it, tables have not received as much attention as other elements. Additionally, many developers are unaware of the guidelines they should follow in this regard. The objective of this article is to enhance the user experience on websites by streamlining the development process of usable tables. To achieve this, we propose a set of heuristics integrated into a tool called BetterTable that enables automatic application of usability improvements while parsing the HTML document. The complexity involved in developing a table with applied usability guidelines is evaluated using different implementations: the proposed approach, DataTables, and AntDesign. Furthermore, tests are conducted to validate the effectiveness of the proposed heuristics through user interactions with 13 table usage scenarios, measuring time, mouse movement, and clicks. Each user is randomly presented with 13 scenarios that either meet or do not meet a specific guideline. The results indicate that our proposal reduces implementation complexity by 43.83% and 24.69% compared to DataTables and AntDesign, respectively. Moreover, user testing reveals that 6 out of the 13 guidelines show improvements in at least 2 of the 3 calculated metrics. Guidelines fulfilled show 40.37% less average completion time and 20.39% less mouse movement than the baseline. Based on the conducted studies, we observed that compliant tables, on average, exhibit reduced user time and mouse movements compared to non-compliant tables. However, no significant differences are found in terms of clicks."}]}]}]}}