{"pii": "S0957417422012301", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1738", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1739"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1741", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1742", "view": "all"}, "_": "Phishing attacks are one of the most challenging social engineering cyberattacks due to the large amount of entities involved in online transactions and services. In these attacks, criminals deceive users to hijack their credentials or sensitive data through a login form which replicates the original website and submits the data to a malicious server. Many anti-phishing techniques have been developed in recent years, using different resource such as the URL and HTML code from legitimate index websites and phishing ones. These techniques have some limitations when predicting legitimate login websites, since, usually, no login forms are present in the legitimate class used for training the proposed model. Hence, in this work we present a methodology for phishing website detection in real scenarios, which uses URL, HTML, and web technology features. Since there is not any updated and multipurpose dataset for this task, we crafted the Phishing Index Login Websites Dataset (PILWD), an offline phishing dataset composed of 134,000 verified samples, that offers to researchers a wide variety of data to test and compare their approaches. Since approximately three-quarters of collected phishing samples request the introduction of credentials, we decided to crawl legitimate login websites to match the phishing standpoint. The developed approach is independent of third party services and the method relies on a new set of features used for the very first time in this problem, some of them extracted from the web technologies used by the on each specific website. Experimental results show that phishing websites can be detected with 97.95% accuracy using a LightGBM classifier and the complete set of the 54 features selected, when it was evaluated on PILWD dataset."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1744", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1745"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1747", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1748", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1750"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1751"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1754", "view": "all"}, "_": "Using legitimate homepage websites foster false positives during login classification."}]}, {"#name": "list-item", "$": {"id": "d1e1756"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1759", "view": "all"}, "_": "Proposed web technology features improve phishing detection accuracy."}]}, {"#name": "list-item", "$": {"id": "d1e1761"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1764", "view": "all"}, "_": "Legitimate login websites ensure generalization in practical scenarios."}]}, {"#name": "list-item", "$": {"id": "d1e1766"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1769", "view": "all"}, "_": "PILWD-134K: A publicly available dataset for phishing detection benchmarking."}]}]}]}]}]}]}}