{"pii": "S0957417423027872", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1644", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1645"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1647", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1648", "view": "all"}, "_": "Workplace safety is a prominent concern, motivating researchers across diverse disciplines to investigate valuable ways to address its challenges. However, creating an efficient system to address this issue remains a significant challenge. Since many accidents happen due to improper usage or complete removal of Personal Protective Equipment (PPE), one straightforward method for enhancing workplace security involves monitoring their usage This paper introduces an Operator Area Network (OAN) system which improves the existing solutions by increasing portability across different users and environments, non-intrusiveness and privacy. To enhance robustness in detecting the situations in which PPEs are not used correctly, we take advantage of Machine Learning to analyse the received signal strength indicator (RSSI) between PPEs in the same OAN The novelty of this work is that it does not exploit RSSI as a proxy of the distance but instead recognizes a signature of the correct wearing of the PPE By employing this system, employers can effectively ensure the proper usage of PPE devices at their worksites while also minimizing any adverse effects on workers’ comfort and reducing the setup burden for employers. The system runs a Support Vector Machine (SVM) model several times per second and employs a post-processing algorithm to enhance its initial accuracy further As a result, the system effectively reduces false positives by about 80% and swiftly detects instances of improper usage of the worker’s PPE, raising the alarm in less than seven seconds. Moreover, the post-processing algorithm can be customized to meet the specific needs of different use cases, allowing for a flexible trade-off between the detection time interval and the overall accuracy of the detection system."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1650", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1651"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1653", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1654", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1656"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1657"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1660", "view": "all"}, "_": "Monitoring of Personal Protective Equipment leveraging embedded IoT devices."}]}, {"#name": "list-item", "$": {"id": "d1e1662"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1665", "view": "all"}, "_": "Cost-effective approach to enhance safety while minimizing worker discomfort."}]}, {"#name": "list-item", "$": {"id": "d1e1667"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1670", "view": "all"}, "_": "Exploiting Bluetooth Low Energy signal strength (RSSI) for anomaly detection."}]}, {"#name": "list-item", "$": {"id": "d1e1672"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1675", "view": "all"}, "_": "Deploy of machine learning algorithm on low-power embedded devices."}]}, {"#name": "list-item", "$": {"id": "d1e1677"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1680", "view": "all"}, "_": "Public dataset of RSSI measurements for PPE wearing and anomalous removal."}]}]}]}]}]}]}}