{"pii": "S095741742201675X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1729", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1730"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1732", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1733", "view": "all"}, "_": "With the advent of cheap, miniaturized electronics, ubiquitous networking has reached an unprecedented level of complexity, scale and heterogeneity, becoming the core of several modern applications such as smart industry, smart buildings and smart cities. A crucial element for network performance is the protocol stack, namely the sets of rules and data formats that determine how the nodes in the network exchange information. A great effort has been put to devise formal techniques to synthesize (offline) network protocols, starting from system specifications and strict assumptions on the network environment. However, offline design can be hard to apply in the most modern network applications, either due to numerical complexity, or to the fact that the environment might be unknown and the specifications might not available. In these cases, online protocol design and adaptation has the potential to offer a much more scalable and robust solution. Nevertheless, so far only a few attempts have been done towards online automatic protocol design. These approaches, however, typically require a central coordinator, or need to build and update a model of the environment, which adds complexity. Here, instead, we envision a protocol as an emergent property of a network, obtained by an environment-driven Distributed Hill Climbing (DHC) algorithm that uses node-local reinforcement signals to evolve, at runtime and without any central coordination, a network protocol from scratch, without needing a model of the environment. We test this approach with a 3-state Time Division Multiple Access (TDMA) Medium Access Control (MAC) protocol and we observe its emergence in networks of various scales and with various settings. We also show how DHC can reach different trade-offs in terms of energy consumption and protocol performance."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1735", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1736"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1738", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1739", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1741"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1742"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1745", "view": "all"}, "_": "We propose Distributed Hill Climbing + local reinforcement to evolve TDMA protocols."}]}, {"#name": "list-item", "$": {"id": "d1e1747"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1750", "view": "all"}, "_": "We extensively test several reinforcement rule variants over grid or random networks."}]}, {"#name": "list-item", "$": {"id": "d1e1752"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1755", "view": "all"}, "_": "Different reinforcement rule assignments produce different kinds of TDMA protocols."}]}, {"#name": "list-item", "$": {"id": "d1e1757"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1760", "view": "all"}, "_": "Some rules find minimal-energy protocols even if energy is not explicitly optimized."}]}, {"#name": "list-item", "$": {"id": "d1e1762"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1765", "view": "all"}, "_": "The proposed approach is more scalable and robust than compared optimization methods."}]}]}]}]}]}]}}