{"pii": "S0957417422009071", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Multidimensional Candlestick is encoded according to morphologies."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Combined with future trend, the pattern of candlestick is defined."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Sequential pattern mining approaches are extended to mine the defined pattern."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "A sequence similarity is proposed to match sequences with patterns."}]}, {"#name": "list-item", "$": {"id": "o0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "The proposed model offsets the mediocre performance of some traditional models."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "This article aims to implement trend forecasting of stock time series based on candlestick patterns and sequence similarity. Financial time series forecasting plays a central role in hedging market risks and optimizing investment portfolios. This is a challenging task, as financial engineering requires the proposed approach to be interpretable, robust, and compatible. It is noted that many published research studies are based on multi-modal data, which makes the prediction approaches increasingly complex, difficult to interpret, and does not allow the migration across different data. Given this situation, it is believed that a candlestick data-based approach is promising. It is already recognized by the technical analyses, prevalent in financial markets, more readily available, and has better interpretability. In this paper, the forecasting approach is divided into two steps. In the first step, sequential pattern mining is used to obtain candlestick patterns from multidimensional candlestick data, and the correlation between different patterns and the corresponding future trends are calculated. In the second step, a new sequence similarity is proposed to match the diverse candlestick sequences with the existing patterns. The method is validated on real data from 800 stocks in the Chinese stock market, which are divided into two groups of experiments, and the average accuracy achieved by the proposed method is 56.04% and 55.56%, which is higher than the SVM model (50.83% and 51.32%) and the LSTM model (50.71% and 50.68%) used for comparison, proving that our work is more stable and accurate. This work is instructive for further research around candlestick data to follow."}]}]}]}}