{"pii": "S0957417422017432", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1219", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1220"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1222", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1223", "view": "all"}, "_": "Navigation assistance is an active research area, where one aim is to foster independent living for people with vision impairments. Despite the fact that many navigation assistants use advanced technologies and methods, we found that they did not explicitly address two essential requirements in a navigation assistant - portability and convenience. It is equally imperative in designing a navigation assistant for the visually impaired that the device is portable and convenient to use without much training. Some navigation assistants do not provide users with detailed information about the obstacle types that can be detected, which is essential to make informed decisions when navigating in real-time. To address these gaps, we propose DeepNAVI, a smartphone-based navigation assistant that leverages deep learning competence. Besides providing information about the type of obstacles present, our system can also provide information about their position, distance from the user, motion status, and scene information. All this information is offered to users through audio mode without compromising portability and convenience. With a small model size and rapid inference time, our navigation assistant can be deployed on a portable device such as a smartphone and work seamlessly in a real-time environment. We conducted a pilot test with a user to assess the usefulness and practicality of the system. Our testing results indicate that our system has the potential to be a practical and useful navigation assistant for the visually impaired."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1225", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1226"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1228", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1229", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1231"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1232"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1235", "view": "all"}, "_": "Portability and convenience are crucial in navigation assistant design."}]}, {"#name": "list-item", "$": {"id": "d1e1237"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1240", "view": "all"}, "_": "We propose DeepNAVI, a smartphone navigation assistant for the visually impaired."}]}, {"#name": "list-item", "$": {"id": "d1e1242"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1245", "view": "all"}, "_": "DeepNAVI provides information about obstacles and environment to help navigate."}]}, {"#name": "list-item", "$": {"id": "d1e1247"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1250", "view": "all"}, "_": "DeepNAVI can be deployed on a portable device and works in real-time."}]}, {"#name": "list-item", "$": {"id": "d1e1252"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1255", "view": "all"}, "_": "Tests suggest that DeepNAVI could be helpful for the visually impaired."}]}]}]}]}]}]}}