{"pii": "S0957417423016858", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1281", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1282"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1284", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1285", "view": "all"}, "_": "Phishing websites distribute unsolicited content and are frequently used to commit email and internet fraud. Detecting them before any user information is submitted is critical. Several efforts have been made to detect these phishing websites in recent years. Most existing approaches use hand-crafted lexical and statistical features from a website’s textual content to train classification models to detect phishing web pages. However, these phishing detection approaches have limitations, including (1) the tediousness of extracting hand-crafted features, which require specialized domain knowledge to determine which features are useful for a particular platform; and (2) the difficulties encountered by models built on hand-crafted features to capture the semantic patterns in words and characters in URL and HTML content. To address these challenges, this paper proposes WebPhish, an end-to-end deep neural network trained using embedded raw URLs and HTML content to detect website phishing attacks. First, the proposed model automatically employs an embedding technique to extract the corresponding characters into homologous dense vectors. Then, the concatenation layer merges the URL and HTML embedding matrices. Following that, Convolutional layers are used to model its semantic dependencies. Extensive experiments were conducted with real-world phishing data, which yielded an accuracy of 98.1%, showing that WebPhish outperforms baseline detection approaches in identifying phishing pages."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1287", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1288"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1290", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1291", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1293"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1294"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1297", "view": "all"}, "_": "WebPhish employs both raw URL and HTML content to detect phishing web pages."}]}, {"#name": "list-item", "$": {"id": "d1e1299"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1302", "view": "all"}, "_": "WebPhish uses character-level embeddings to enable the feature vectors to generalize to new data."}]}, {"#name": "list-item", "$": {"id": "d1e1304"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1307", "view": "all"}, "_": "Extensive experiments conducted on a real-world dataset yields 98.1% accuracy."}]}, {"#name": "list-item", "$": {"id": "d1e1309"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1312", "view": "all"}, "_": "Its application on the airline Twitter dataset shows the proposed model’s flexibility."}]}]}]}]}]}]}}