{"pii": "S0959652624020213", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The textiles and apparel industry is a major contributor to economic development while at the same time being one of the most polluting industries due to its lengthy supply chain and resource intensive production operations. To address these sustainability challenges, digitalization is seen as one of the potential solutions. Using the lens of sustainability and digitalization in Supply Chain Management (SCM), this paper analyses the sustainability and digitalization status of Dutch textile and apparel firms. We used a mixed methodology of quantitative text mining of 94 Dutch textile and apparel firms as well as qualitative thematic and coding analysis of experts’ views and opinions on sustainability and digitalization in the Dutch textiles and apparel industry. Quantitative analysis of website data shows that Dutch textile and apparel firms predominantly communicate the environmental, to a lesser extent social, and least of all economic sustainability factors. Keyword analysis also shows that the use of technological keyword indicators is less prominent, while certain technologies such as IoT, sensors and blockchain correlate mostly to environmental sustainability factors. Moreover, qualitative analysis reveals that to address sustainability via digitalization, it is important to link sustainability goals to Key Performance Indicators, which requires data for traceability. We recommend firms to: (1) re-evaluate their business models and assess the extent traceability can be incorporated in their sustainability strategy; (2) enhance stakeholder collaboration within and outside the supply chain to utilize traceability; and (3) proactively use traceability information to improve transparency and accountability to meet legal requirements and address greenwashing. This study contributes to literature by showing the importance of traceability for (a) linking sustainability and digitalization in SCM, b) achieving the ultimate goals of transparency and accountability, and c) predicting demand and supply to address overproduction and waste in the textiles and apparel sector."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "This study analyses the sustainability and digitalization status of Dutch textile and apparel firms."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Firms predominantly communicate environmental, followed by social and least of all economics sustainability, in their websites."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "To address sustainability via digitalization, it is important to link sustainability goals to Key Performance Indicators."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Traceability data can improve transparency and accountability, as well as predictability of demand and supply in the chain."}]}]}]}]}]}]}}