{"pii": "S0957417424015021", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e812", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e813"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e815", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e816", "view": "all"}, "$$": [{"#name": "__text__", "_": "Shelf monitoring plays a key role in optimizing retail shelf layout, enhancing the customer shopping experience and maximizing profit margins. The process of automating shelf audit involves the detection, localization and recognition of objects on store shelves, including diverse products with varying attributes in unconstrained environments. This facilitates the assessment of planogram compliance. Accurate product localization within shelves requires the identification of specific shelf rows. To address the current technological challenges, we introduce “Shelf Management”, a deep learning-based system that is carefully tailored to redesign shelf monitoring practices. Our system can navigate the complexities of shelf monitoring by using advanced deep learning techniques and object detection and recognition models. In addition, a complex semantic module enhances the accuracy of detecting and assigning products to their designated shelf rows and locations. In particular, we recognize the lack of finely annotated datasets at the SKU level. As a contribution to the field, we provide annotations for two novel datasets: SHARD (SHelf mAnagement Row Dataset) and SHAPE (SHelf mAnagement Product dataset). These datasets not only provide valuable resources, but also serve as benchmarks for further research in the field of retail. A complete pipeline is designed using a RetinaNet architecture for object detection with 0.752 mAP, followed by a Deep Hough transform to detect shelf rows as semantic lines with an F1 score of 97%, and a product recognition step using a MobileNetV3 architecture trained with triplet loss and used as a feature extractor together with FAISS for fast image retrieval with an accuracy of 93% on top-1 recognition. Localization is achieved using a deterministic approach based on product detection and shelf row detection. Source code and datasets are available at "}, {"#name": "inter-ref", "$": {"xmlns:xlink": true, "id": "interref2", "href": "https://github.com/rokopi-byte/shelf_management", "type": "simple"}, "_": "https://github.com/rokopi-byte/shelf_management"}, {"#name": "__text__", "_": "."}]}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e821", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e822"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e824", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e825", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e827"}, "$$": [{"#name": "list-item", "$": {"id": "d1e828"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e831", "view": "all"}, "_": "Automated shelf audit process."}]}, {"#name": "list-item", "$": {"id": "d1e833"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e836", "view": "all"}, "_": "Key steps: shelf row detection, product detection, identification."}]}, {"#name": "list-item", "$": {"id": "d1e838"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e841", "view": "all"}, "_": "Efficient and accurate evaluation through advanced deep learning."}]}, {"#name": "list-item", "$": {"id": "d1e843"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e846", "view": "all"}, "_": "Streamlined process, improved efficiency, valuable insights for retailers."}]}]}]}]}]}]}}