{"pii": "S0950584923001738", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1407", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1408"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1411", "role": "introduction", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1412"}, "_": "Context:"}, {"#name": "simple-para", "$": {"id": "d1e1414", "view": "all"}, "_": "In 2012, our paper “On the reproducibility of empirical software engineering studies based on data retrieved from development repositories” was published. It proposed a method for assessing the reproducibility of studies based on mining software repositories (MSR studies). Since then, several approaches have happened with respect to the study of the reproducibility of this kind of studies."}]}, {"#name": "abstract-sec", "$": {"id": "d1e1416", "role": "introduction", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1417"}, "_": "Objective:"}, {"#name": "simple-para", "$": {"id": "d1e1419", "view": "all"}, "_": "To revisit the proposals of that paper, analyzing to which extent they remain valid, and how they relate to current initiatives and studies on reproducibility and validation of research results in empirical software engineering."}]}, {"#name": "abstract-sec", "$": {"id": "d1e1421", "role": "materials-methods", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1422"}, "_": "Method:"}, {"#name": "simple-para", "$": {"id": "d1e1424", "view": "all"}, "_": "We analyze the most relevant studies affecting assumptions or consequences of the approach of the original paper, and other initiatives related to the evaluation of replicability aspects of empirical software engineering studies. We compare the results of that analysis with the results of the original study, finding similarities and differences. We also run a reproducibility assessment study on current MSR papers. Based on the comparison, and the applicability of the method to current papers, we draw conclusions on the validity of the approach of the original paper."}]}, {"#name": "abstract-sec", "$": {"id": "d1e1426", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1427"}, "_": "Main lessons learned:"}, {"#name": "simple-para", "$": {"id": "d1e1429", "view": "all"}, "_": "The method proposed in the original paper is still valid, and compares well with other more recent methods. It matches the results of relevant studies on reproducibility, and a systematic comparison with them shows that our approach is aligned with their proposals. Our method has practical use, and complements well the current major initiatives on the review of reproducibility artifacts. As a side result, we learn that the reproducibility of MSR studies has improved during the last decade."}]}, {"#name": "abstract-sec", "$": {"id": "d1e1431", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1432"}, "_": "Vision:"}, {"#name": "simple-para", "$": {"id": "d1e1434", "view": "all"}, "_": "We propose to use our approach as a fundamental element of a more profound review of the reproducibility of MSR studies, and of the characterization of validation studies in this realm."}]}]}]}}