{"pii": "S0959652616311210", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Life cycle assessment (LCA) is a highly interdisciplinary field that requires knowledge from different domains to be gathered and interpreted together. Although there are relatively few major data sources for LCA, the data themselves are presented with highly heterogeneous formats, interfaces, and distribution mechanisms. The lack of agreement among data providers for descriptions of processes and flows creates substantial barriers for information sharing and reuse of practitioners’ models."}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "Nevertheless, the many data resources share a common logic. The use of Semantic Web technologies and text mining techniques can facilitate the interpretation of data from diverse sources. Numerous existing efforts have been made to articulate a knowledge model for LCA. In March of 2015 a joint workshop was held that brought together leading international domain experts with ontology engineers to develop a set of simple models called ontology design patterns (ODPs) for LCA information. In this paper we build on the outcomes of the workshop, as well as prior published works, to derive a minimal “consensus model” for LCA. We use the consensus model to derive a description of an LCA “catalog” that can be used to express the semantic content of a data resource. We generate catalogs of several prominent databases, and make those catalogs available to the public for independent use. Finally, we “link” those catalogs to existing knowledge models using JSON-LD, a linked data format that can expose the catalog contents to Semantic Web tools."}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "We then show by example how the catalogs may be used to answer questions about the scope, coverage, and comparability of data, both within and across data sources, that are difficult to answer when the contents of the catalogs are provided independently and inconsistently. We discuss how the use of semantic catalogs can help address challenges that initiatives such as the “Global Network of Interoperable LCA Databases – Global LCA Data Access” are facing today."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "We present the first multi-database catalog of life cycle data in an open, linked-data format."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "A common knowledge model can be used to represent different data sources in a consistent context."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Semantic Web and text mining tools can improve data interoperability."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Quantitative information can be separated from metadata."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "The catalog format provides guidance for semantic management of existing data."}]}]}]}]}]}]}}