{"pii": "S0960982222019066", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Summary"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "It is well established that sleep deprivation after learning impairs hippocampal memory processes and can cause amnesia. It is unknown, however, whether sleep deprivation leads to the loss of information or merely the suboptimal storage of information that is difficult to retrieve. Here, we show that hippocampal object-location memories formed under sleep deprivation conditions can be successfully retrieved multiple days following training, using optogenetic dentate gyrus (DG) memory engram activation or treatment with the clinically approved phosphodiesterase 4 (PDE4) inhibitor roflumilast. Moreover, the combination of optogenetic DG memory engram activation and roflumilast treatment, 2 days following training and sleep deprivation, made the memory more persistently accessible for retrieval even several days later (i.e., without further optogenetic or pharmacological manipulation). Altogether, our studies in mice demonstrate that sleep deprivation does not necessarily cause memory loss but instead leads to the suboptimal storage of information that cannot be retrieved without drug treatment or optogenetic stimulation. Furthermore, our findings suggest that object-location memories, consolidated under sleep deprivation conditions and thought to be lost, can be made accessible again several days after the learning and sleep deprivation episode, using the clinically approved PDE4 inhibitor roflumilast."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Sleep deprivation-induced amnesia is a problem of memory retrievability"}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Memory engram activation after sleep deprivation restores memory retrievability"}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Amnesia due to sleep loss can be permanently reversed multiple days after learning"}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Roflumilast and optogenetics can be used to restore memory access"}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0020", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "Sleep deprivation after learning leads to hippocampal memory deficits. Bolsius et al. show that this amnesia is not caused by information loss but is rather a problem of retrievability. Memory access can be restored by optogenetic engram activation or the drug roflumilast."}]}]}]}}