{"pii": "S0969699724001042", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Flight operations over the North Pacific Ocean are affected by strong westerly jet streams, which have day-to-day weather variations as well as seasonal trends. Fast-time simulation is used to evaluate the effect of proposed airspace and procedure changes on flight operations, and the results must reflect seasonal trends while not being overly influenced by conditions on any given day. Aggregating the results of air traffic flow simulations using the winds on a large number of days spread over a year will achieve this but requires considerable time and effort, and a method to obtain a reasonable evaluation using a small set of representative wind conditions and a minimum number of simulations is desired. This paper proposes using clustering to achieve this. To avoid having to cluster large meteorological data sets and to reduce the dimensionality of the data, we used Pacific Organised Track System (PACOTS) tracks as a surrogate for wind conditions since these are calculated considering the daily winds aloft. For a schedule of ten major trans-Pacific flight services, we compared statistical trends over a full year of routes and those on wind days chosen by five candidate methods, which consisted of clustering and non-clustering methods. The constant-interval selection of days from a dendrogram produced via Ward's clustering captured the seasonal variation of winds over the studied year with the highest fidelity. Airspaces in which winds aloft dominate flight planning and for which daily wind-optimal tracks are published exist in other oceanic areas, and the proposed method is also applicable to their simulation studies."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Reflection of winds aloft in air traffic flow simulations over the Pacific Ocean."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Simulation of oceanic airspace including seasonal variations using a small number of days."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Classification of winds aloft by clustering using wind-optimum flight routes."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Statistical method to evaluate the best method of selecting wind reflection day."}]}]}]}]}]}]}}