{"pii": "S0967586823000048", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "Syringomyelia is a chronic, progressive disease of the spinal cord. Syringomyelia is an etiologically diverse affliction caused by disturbance of normal cerebrospinal fluid flow dynamics. Lesions are characterized by the formation of tubular cavities in the gray matter of the spinal cord and gliosis; however, the etiology is unknown and treatment methods differ. Many existing studies have focused on the relationship between other diseases and syringomyelia. There is a lack of comprehensive and objective reports on the research status of syringomyelia. Therefore, this study aimed to conduct a bibliometric analysis to quantify studies on Syringomyelia and trending issues in the last 20 years."}]}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st015"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Articles were acquired from the Web of Science Core Collection database. We used the Library Metrology online analysis platform, BICOMB, gCLUTO, CiteSpace bibliometrics tools for analysis, VOSviewer 1.6.16 (Nees Jan van Eck and Ludo Waltman, 2010), and Microsoft Excel 2019 to perform bibliometric analysis and visualization. Individual impact and collaborative information were quantified by analyzing annual publications, journals, co-cited journals, countries/regions, institutions, authors, and co-cited authors. We then identified the trending research areas of syringomyelia by analyzing the co-occurrence of keywords and co-cited references."}]}, {"#name": "abstract-sec", "$": {"id": "as015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st020"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "sp0015", "view": "all"}, "_": "From January 2003 to August 2022, 9,556 authors from 66 countries published a total of 1,902 research articles on syringomyelia in 518 academic journals. Most publications come from the United States, China, the United Kingdom, and Japan, with the United States dominating. Nanjing University and the University of Washington are the most active institutions, Dr. Claire Rusbridge has published the most papers, and Miholat has the most co-citations. The Journal of Neurosurgery has the highest number of co-cited articles, which are mainly in the fields of neurology, surgery, and biology. High-frequency keywords included syringomyelia, Chiari-I malformation, children, surgical treatment, and spinal cord."}]}, {"#name": "abstract-sec", "$": {"id": "as020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st025"}, "_": "Conclusions"}, {"#name": "simple-para", "$": {"id": "sp0020", "view": "all"}, "_": "The number of articles on syringomyelia has increased steadily over the past two decades. At present, research on syringomyelia is mainly focused on the age of onset, potential therapeutic interventions, surgical treatment, avoidance of recurrence, and delay of pain. The use of surgical treatment of the disease and the mechanism of further treatment are the current hot research topics. The correlation between trauma and congenital factors, translational application, the effect of surgical treatment, postoperative recurrence, and complications are further hot research areas. These may provide ideas for further research into a radical cure for syringomyelia"}]}]}]}}