{"pii": "S0965997822002939", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara025", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "Solve nonlinear stress problems in shell structures using image processing technique."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "Finite element results are transformed into image pairs to generate training dataset."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "Mechanical behaviour, material properties and geometry are mapped to colour channels."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "Solutions are generated in real-time with 5–10% error."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara026", "view": "all"}, "_": "In this paper, we propose a novel approach to solve nonlinear stress analysis problems in shell structures using an image processing technique. In general, such problems in design optimisation or virtual reality applications must be solved repetitively in a short period using direct methods such as nonlinear finite element analysis. Hence, obtaining solutions in real-time using direct methods can quickly become computationally overwhelming. The proposed method in this paper is unique in that it converts the mechanical behaviour of shell structures into images that are then used to train a machine learning algorithm. This is achieved by mapping shell deformations and stresses to a set of images that are used to train a conditional generative adversarial network. The network can then predict the solution of the problem for a varying range of parameters. The proposed approach can be significantly more efficient than training a machine learning algorithm using the raw numerical data. To evaluate the proposed method, two different structures are assessed where the training data is created using nonlinear finite element analysis. Each structure is studied for a varying geometry and a set of material properties. We show that the results of the trained network agree well with the results of the nonlinear finite element analysis. The proposed approach can quickly and accurately predict the mechanical behaviour of the structure using a fraction of the computational cost. All created data and source codes are openly available."}]}]}]}}