{"pii": "S096669232100212X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0050", "view": "all"}, "_": "The development of public transport networks in polycentric regions involves making complex trade-offs between extending network coverage, densifying local connections, offering improved connections between urban centers and increasing capacity on existing links. Moreover, different modalities might be suitable for each of these development decisions depending on their speed, capacity and cost function structure. The objective of this study is to identify the influence of polycentric configurations and their respective travel demand distributions on the emerging topology of the corresponding multi-modal public transport network using an iterative growth model. Since polycentricity comes in many forms, our experimental design considers four polycentric configurations inspired by the cases of London, Tokyo, the Flemish Diamond and the Rhine-Ruhr area."}, {"#name": "simple-para", "$": {"id": "sp0055", "view": "all"}, "_": "The results are analysed in terms of both the properties of the obtained network structure as well as the evolutionary path and the sensitivity of both to key model settings and design variables. We find that more uneven population distributions result with the construction of fewer links and consequently the less connected and shorter the network becomes. The network evolutionary path is marked by distinctive intra- and inter- agglomeration expansion, densification and bulking phases. While the costs associated with each investment are the same regardless of the moment at which the investment is made, the benefits are not. This path dependency means that the evolutionary path is characterized by the need to attain a critical mass to justify further developments."}]}]}]}}