{"pii": "S1000936117300900", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "Air route network optimization, one of the essential parts of the airspace planning, is an effective way to optimize airspace resources, increase airspace capacity, and alleviate air traffic congestion. However, little has been done on the optimization of air route network in the fragmented airspace caused by prohibited, restricted, and dangerous areas (PRDs). In this paper, an air route network optimization model is developed with the total operational cost as the objective function while airspace restriction, air route network capacity, and non-straight-line factors (NSLF) are taken as major constraints. A square grid cellular space, Moore neighbors, a fixed boundary, together with a set of rules for solving the route network optimization model are designed based on cellular automata. The empirical traffic of airports with the largest traffic volume in each of the 9 flight information regions in mainland China is collected as the origin-destination (OD) airport pair demands. Based on traffic patterns, the model generates 35 air routes which successfully avoids 144 PRDs. Compared with the current air route network structure, the number of nodes decreases by 41.67%, while the total length of flight segments and air routes drop by 32.03% and 5.82% respectively. The NSLF decreases by 5.82% with changes in the total length of the air route network. More importantly, the total operational cost of the whole network decreases by 6.22%. The computational results show the potential benefits of the model and the advantage of the algorithm. Optimization of air route network can significantly reduce operational cost while ensuring operation safety."}]}]}]}}