{"pii": "S1000936124001365", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The active vibration control technology has been successfully applied to several helicopter types. However, with the increasing of control scale, traditional centralized control algorithms are experiencing significant increase of computational complexity and physical implementation challenging. To address this issue, a diffusion collaboration-based distributed Filtered-x Least Mean Square algorithm applied to active vibration control is proposed, drawing inspiration from the concept of data fusion in wireless sensor network. This algorithm distributes the computation load to each node, and constructs the active vibration control network topology of large-scale system by discarding the weak coupling secondary paths between nodes, achieving distributed active vibration control. In order to thoroughly validate the effectiveness and superiority of this algorithm, a helicopter fuselage model is designed as the research object. Firstly, the excellent vibration reduction performance of the proposed algorithm is confirmed through simulations. Subsequently, specialized node control units are developed, which utilize STM32 microcontroller as the processing unit. Further, a distributed control system is constructed based on multi-processor collaboration. Building on this foundation, a large-scale active vibration control experimental platform is established. Based on the platform, experiments are carried out, involving the 4-input 4-output system and the 8-input 8-output system. The experimental results demonstrate that under steady-state harmonic excitation, the proposed algorithm not only ensures control effectiveness but also reduces computational complexity by 50%, exhibiting faster convergence speed compared with traditional centralized algorithms. Under time-varying external excitation, the proposed algorithm demonstrates rapid tracking of vibration changes, with vibration amplitudes at all controlled points declining by over 94%, proving the strong robustness and adaptive capability of the algorithm."}]}]}]}}