{"pii": "S1018364723001751", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st085"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp005", "view": "all"}, "_": "Adaptive Defense has become an important factor in order to maintain device safety and security on the Internet. In 2021, there were more than 10 billion devices connected to the Internet which is estimated to exceed 25.4 billion by 2030. In order to implement the defensive mechanism approach to security, this paper demonstrates the implementation of the Artificial Bees Colonization (ABC) Approach as Nature Inspired Cyber Security Algorithm. This paper analyzes the defensive approach to Distributed Denial-of-Service attack which limits the amount of traffic flow from each node, therefore, minimizing the attack surface. The simulated network shows the difference between the normal and attack throughput and compares the fitness of the network intermediaries with reference to the parametric graph that shows the effect of a simulated attack on each network intermediary. Thereafter, the state of defense from the ABC’s point of view shows the effectiveness of the proposed algorithm in detecting and minimizing traffic flow from malicious nodes thus, maintaining the network throughput while keeping the network stable."}, {"#name": "simple-para", "$": {"id": "sp010", "view": "all"}, "_": "The proposed algorithm introduces an Adaptive Defense Approach that works recursively on the nodes attached to a network of clusters that prepares a solution set of probable malicious nodes that are attached to the network. The detected nodes are then analyzed by their properties based on the network parameters such as Network Throughput, End-to-End Delay, and Packet Delivery Ratio. On change in any of the factors in the devised properties, the node or cluster of nodes is marked as malicious and the rate of traffic flow along with the packet delivery ratio is reduced to match the normal node’s generic properties such that the hammering of the network with traffic is done under a controlled environment and the network works with reduced performance but does not halt even under attack thereby, maintaining business continuity under attack scenario."}]}]}]}}