{"pii": "S1044030504002880", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "aep-abstract-id16"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id17"}, "$$": [{"#name": "simple-para", "$": {"view": "all"}, "$$": [{"#name": "__text__", "_": "Technological advancements including an open-cylindrical Penning trap with capacitively coupled ICR cell, selective ion accumulation with a resolving quadrupole, and a voltage gradient used during ion extraction from an octopole ion trap, have individually improved dynamic range and sensitivity in Fourier Transform Ion Cyclotron Resonance Mass Spectrometry (FT-ICR MS). Documented here is a new instrument utilizing these technologies toward the robust detection and fragmentation of biomolecules >10 kDa. Up to 55-fold enhancement in ion population by selective ion accumulation combined with 10- to 20- fold signal-to-noise improvement by application of a DC voltage gradient to an accumulation octopole during the ion transfer event offers improved signal-to-noise (or speed) of MS/MS experiments, for proteins from "}, {"#name": "italic", "_": "Methanococcus jannaschii"}, {"#name": "__text__", "_": " and "}, {"#name": "italic", "_": "Saccharomyces cerevisiae"}, {"#name": "__text__", "_": " whole cell lysates. After external quadrupole filtering with a 40 "}, {"#name": "italic", "_": "m"}, {"#name": "__text__", "_": "/"}, {"#name": "italic", "_": "z"}, {"#name": "__text__", "_": " window, three proteins were fragmented (and identified) in parallel from the database of "}, {"#name": "italic", "_": "Methanococcus jannaschii"}, {"#name": "__text__", "_": ". Electron capture dissociation (ECD) of an intact yeast protein provides extensive sequence information resulting in a high degree of localization for an N-terminal acetylation. Hybrid fragmentation, infrared multiphoton dissociation (IRMPD) followed by low energy electrons (ECD), with the electron source located laterally off the z-axis and external to the magnet bore, presents a strategy for identification of proteins by means of the sequence tag approach. Automated implementation of diverse MS"}, {"#name": "sup", "$": {"loc": "post"}, "_": "n"}, {"#name": "__text__", "_": " approaches in a Q-FTMS instrument promises to help realize “top-down” proteomics in the future."}]}]}]}]}}