{"pii": "S105381192100505X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "abs0001", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara005", "view": "all"}, "_": "Conceptual knowledge allows the categorisation of items according to their meaning beyond their physical similarities. This ability to respond to different stimuli (e.g., a leek, a cabbage, etc.) based on similar semantic representations (e.g., belonging to the vegetable category) is particularly important for language processing, because word meaning and the stimulus form are unrelated. The neural basis of this core human ability is debated and is complicated by the strong reliance of most neural measures on explicit tasks, involving many non-semantic processes. Here we establish an implicit method, i.e., fast periodic visual stimulation (FPVS) coupled with electroencephalography (EEG), to study neural conceptual categorisation processes with written word stimuli. Fourteen neurotypical participants were presented with different written words belonging to the same semantic category (e.g., different animals) alternating at 4 Hz rate. Words from a different semantic category (e.g., different cities) appeared every 4 stimuli (i.e., at 1 Hz). Following a few minutes of recording, objective electrophysiological responses at 1 Hz, highlighting the human brain's ability to implicitly categorize stimuli belonging to distinct conceptual categories, were found over the left occipito-temporal region. Topographic differences were observed depending on whether the periodic change involved living items, associated with relatively more ventro-temporal activity as compared to non-living items associated with relatively more dorsal posterior activity. Overall, this study demonstrates the validity and high sensitivity of an implicit frequency-tagged marker of word-based semantic memory abilities."}]}]}]}}