{"pii": "S1053811922006656", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "id": "absh001", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0001", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "lst0001"}, "$$": [{"#name": "list-item", "$": {"id": "lstitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0001", "view": "all"}, "_": "We present a new superficial white matter (SWM) atlas of short association bundles created by an unsupervised method based on different levels of fiber clustering, over probabilistic tractography data."}]}, {"#name": "list-item", "$": {"id": "lstitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0002", "view": "all"}, "_": "The resulting atlas is composed of 525 bundles of short association fibers along the whole brain, with 384 bundles connecting pairs of different ROIs (cortical circumvolutions) and 141 bundles connecting portions of the same ROI."}]}, {"#name": "list-item", "$": {"id": "lstitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0003", "view": "all"}, "_": "The reproducibility of the atlas bundles was verified using an automatic segmentation applied to new subjects from three different tractogram databases, with a high reproducibility found for HCP probabilistic tractography."}]}, {"#name": "list-item", "$": {"id": "lstitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0004", "view": "all"}, "_": "Compared to previous whole-brain SWM atlases, our atlas features better cortical surface coverage and a larger number of bundles, with 97 bundles not described in previous atlases (58 in the left hemisphere and 39 in the right hemisphere)."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0001", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0002", "view": "all"}, "_": "The study of short association fibers is still an incomplete task due to their higher inter-subject variability and the smaller size of this kind of fibers in comparison to known long association bundles. However, their description is essential to understand human brain dysfunction and better characterize the human brain connectome. In this work, we present a multi-subject atlas of short association fibers, which was computed using a superficial white matter bundle identification method based on fiber clustering. To create the atlas, we used probabilistic tractography from one hundred subjects from the HCP database, aligned with non-linear registration. The method starts with an intra-subject clustering of short fibers (30-85 mm). Based on a cortical atlas, the intra-subject cluster centroids from all subjects are segmented to identify the centroids connecting each region of interest (ROI) of the atlas. To reduce computational load, the centroids from each ROI group are randomly separated into ten subgroups. Then, an inter-subject hierarchical clustering is applied to each centroid subgroup, followed by a second level of clustering to select the most-reproducible clusters across subjects for each ROI group. Finally, the clusters are labeled according to the regions that they connect, and clustered to create the final bundle atlas."}, {"#name": "simple-para", "$": {"id": "sp0003", "view": "all"}, "_": "The resulting atlas is composed of 525 bundles of superficial short association fibers along the whole brain, with 384 bundles connecting pairs of different ROIs and 141 bundles connecting portions of the same ROI. The reproducibility of the bundles was verified using automatic segmentation on three different tractogram databases. Results for deterministic and probabilistic tractography data show high reproducibility, especially for probabilistic tractography in HCP data. In comparison to previous work, our atlas features a higher number of bundles and greater cortical surface coverage."}]}]}]}}