{"pii": "S1053811921001294", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "abs0001", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara009", "view": "all"}, "_": "Regulation of the internal homeostasis is modulated by the central autonomic system. So far, the view of this system is determined by animal and human research focusing on cortical and subcortical grey substance regions. To provide an overview based on white matter architecture, we used a global tractography approach to reconstruct a network of tracts interconnecting brain regions that are known to be involved in autonomic processing. Diffusion weighted imaging data were obtained from subjects of the human connectome project (HCP) database. Resulting tracts are in good agreement with previous studies assuming a division of the central autonomic system into a cortical (CAN) and a subcortical network (SAN): the CAN consist of three subsystems that encompass all cerebral lobes and overlap within the insular cortex: a parieto-anterior-temporal pathway (PATP), an occipito-posterior-temporo-frontal pathway (OPTFP) and a limbic pathway. The SAN on the other hand connects the hypothalamus to the periaqueductal grey and locus coeruleus, before it branches into a dorsal and a lateral part that target autonomic nuclei in the rostral medulla oblongata. Our approach furthermore reveals how the CAN and SAN are interconnected: the hypothalamus can be considered as the interface-structure of the SAN, whereas the insula is the central hub of the CAN. The hypothalamus receives input from prefrontal cortical fields but is also connected to the ventral apex of the insular cortex. Thus, a holistic view of the central autonomic system could be created that may promote the understanding of autonomic signaling under physiological and pathophysiological conditions."}]}]}]}}