{"pii": "S1059056024000686", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The growth of digital assets in recent periods are accompanied by negative externalities, which raise concerns over sustainability. This has influenced the news content on both conventional and social media outlets, leading to the creation of the index of cryptocurrency environmental attention (ICEA). Given the pivotal role of social and conventional media in forming investors’ attitudes and behavior in financial markets, we address this issue from the perspective of Islamic stocks, which by their nature represent a class of Shariah-compliant sustainable assets. With dataset spanning from 2014 onwards up to July 2022, we analyze how the ICEA induces market dynamics in Islamic stocks covering diverse economic sectors. By applying the bi-wavelet-based time-frequency econometric framework, our empirical findings reveal time-varying levels of coherence between the ICEA and Islamic sectoral stocks, implying that the pricing and returns-generating dynamics across various economic sectors in Islamic markets are led by media coverage on environmental attention vis-à-vis the mining and trade of cryptocurrencies. Notwithstanding, our results indicate that the real “brick-and-mortar” categories of faith-based stocks, which contains the basic materials, consumer goods, industrials, and oil & gas sectors, provide attractive diversification attributes. Our findings are important for risk, portfolio, and policy management."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Comovements between environmental crypto sentiment and Islamic sectoral stocks."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "We use squared wavelet coherence and wavelet coherence phase difference techniques."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Index of cryptocurrency environmental attention (ICEA) leads Islamic stock prices."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Islamic stocks from various sectors are responsive to shocks in cryptocurrencies."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "Basic materials, consumer goods, industrial, oil&gas offer better diversification."}]}]}]}]}]}]}}