{"pii": "S1053811920309149", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "id": "abs0001", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara006", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "We associated structural brain organization with time-varying functional dynamics."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "Structure-function coupling is strong for transitions involving sensorimotor states."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "Sensorimotor transitions involve network diffusion along structural connectome gradients."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "Transitions in higher-order states increasingly engage inter-hub routing."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "abs0002", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara007", "view": "all"}, "_": "Human cognition is dynamic, alternating over time between externally-focused states and more abstract, often self-generated, patterns of thought. Although cognitive neuroscience has documented how networks anchor particular modes of brain function, mechanisms that describe transitions between distinct functional states remain poorly understood. Here, we examined how time-varying changes in brain function emerge within the constraints imposed by macroscale structural network organization. Studying a large cohort of healthy adults (n = 326), we capitalized on manifold learning techniques that identify low dimensional representations of structural connectome organization and we decomposed neurophysiological activity into distinct functional states and their transition patterns using Hidden Markov Models. Structural connectome organization predicted dynamic transitions anchored in sensorimotor systems and those between sensorimotor and transmodal states. Connectome topology analyses revealed that transitions involving sensorimotor states traversed short and intermediary distances and adhered strongly to communication mechanisms of network diffusion. Conversely, transitions between transmodal states involved spatially distributed hubs and increasingly engaged long-range routing. These findings establish that the structure of the cortex is optimized to allow neural states the freedom to vary between distinct modes of processing, and so provides a key insight into the neural mechanisms that give rise to the flexibility of human cognition."}]}]}]}}