{"pii": "S1053811923001477", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara008", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "The regions in the salience and executive control networks (S-ECN) were more strongly predictive of successful memory."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "The memory-related activation in the S-ECN was just before the errors were corrected during retrieval practice (RP)."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "The anterior insula had connectivity with the hippocampus and the default mode network (DMN) to update memory."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "Maintaining corrected memory requires repeated RP and feedback, which was associated with increased activation in the DMN."}]}, {"#name": "list-item", "$": {"id": "celistitem0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0005", "view": "all"}, "_": "The anterior insula and posterior insula showed double dissociations for monitoring errors and maintaining corrects."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara009", "view": "all"}, "_": "How memory representations are eventually established and maintained in the brain is one of central issues in memory research. Although the hippocampus and various brain regions have been shown to be involved in learning and memory, how they coordinate to support successful memory through errors is unclear. In this study, a retrieval practice (RP) – feedback (FB) paradigm was adopted to address this issue. Fifty-six participants (27 in the behavioral group, and 29 in the fMRI group) learned 120 Swahili-Chinese words associations and underwent two RP-answer FB cycles (i.e., RP1, FB1, RP2, FB2). The responses of the fMRI group were recorded in the fMRI scanner. The trials were divided based on participant's performance (correct or incorrect, C or I) during the two RPs and the final test (i.e., trial type, CCC, ICC, IIC III). The results showed that the regions in the salience and executive control networks (S-ECN) during RP, but not during FB, was strongly predictive of final successful memory. Their activation was just before the errors were corrected (i.e., RP1 in ICC trials and RP2 in IIC trials). The anterior insula (AI) is a core region in monitoring repeated errors, and it had differential connectivity with the default mode network (DMN) regions and the hippocampus during the RP and FB phases to inhibit incorrect answers and update memory. In contrast, maintaining corrected memory representation requires repeated RP and FB, which was associated with the DMN activation. Our study clarified how different brain regions support error monitoring and memory maintenance through repeated RP and FB, and emphasized the role of the insula in learning from errors."}]}]}]}}