{"pii": "S1053811924003884", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "We connect predictive coding and perception-action integration frameworks"}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "We outline neurophysiological mechanisms underlying prediction during perception action integration."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "Perception-Acting binding is guided by theta power in insular cortex"}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0005", "view": "all"}, "_": "Predictability selectively enables attentional shielding of retrieval processes"}]}, {"#name": "list-item", "$": {"id": "celistitem0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0006", "view": "all"}, "_": "Top-down influence of alpha power in inferior frontal cortex reflect retrieval"}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara016", "view": "all"}, "_": "A major concept in cognitive neuroscience is that brains are “prediction machines”. Yet, conceptual frameworks on how perception and action become integrated still lack the concept of predictability and it is unclear how neural processes may implement predictive coding during dynamic perception-action integration. We show that distinct neurophysiological mechanisms of nonlinearly directed connectivities in the theta and alpha band between cortical structures underlie these processes. During the integration of perception and motor codes, especially theta band activity in the insular cortex and temporo-hippocampal structures is modulated by the predictability of upcoming information. Here, the insular cortex seems to guide processes. Conversely, the retrieval of such integrated perception-action codes during actions heavily relies on alpha band activity. Here, directed top-down influence of alpha band activity from inferior frontal structures on insular and temporo-hippocampal structures is key. This suggests that these top-down effects reflect attentional shielding of retrieval processes operating in the same neuroanatomical structures previously involved in the integration of perceptual and motor codes. Through neurophysiology, the present study connects predictive coding mechanisms with frameworks specifying the dynamic integration of perception and action."}]}]}]}}