{"pii": "S1068520024001603", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1208", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1209"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1211", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1212", "view": "all"}, "_": "The main advantage of multi-band (MB) networks is to provide more capacity than C-band networks by using other unused bands like the L- and S-bands and, in this way, postpone the announced optical network capacity crunch. However, MB nodes have a more complex structure than C-band nodes, impacting their cost and enhancing their induced physical layer impairments (PLIs). The main goal of this paper is to analyze the impact of several MB node architectures (namely baseline, common-band and compact MB node architectures) on the total network capacity and total network cost-per-bit, using a routing, modulation format, and spectrum assignment (RMSA) network planning tool based on a Monte–Carlo simulation that also incorporates the impact of network PLIs. When the PLIs are neglected, the common-band architecture presents the lowest cost-per-bit compared to the remaining MB architectures, since only lower cost C-band components are used. However, with the PLIs impact, the common-band architecture leads to the lowest total network capacity and highest cost-per-bit due to additional noise coming from all-optical wavelength converters. In particular, the common-band total network capacity is less than half the baseline and compact total network capacities for a blocking probability of 1%, considering the best channel launch power. Also, the common-band cost-per-bit is almost twice the baseline and compact cost-per-bit due to the PLIs-induced degradation."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1214", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1215"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1217", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1218", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1220"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1221"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1224", "view": "all"}, "_": "Four multiband nodes are compared in terms of cost and capacity in a network scenario."}]}, {"#name": "list-item", "$": {"id": "d1e1226"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1229", "view": "all"}, "_": "Common-band node loses the cost advantage in presence of physical layer impairments."}]}, {"#name": "list-item", "$": {"id": "d1e1231"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1234", "view": "all"}, "_": "Common-band node capacity is less than half the baseline and compact nodes capacity."}]}, {"#name": "list-item", "$": {"id": "d1e1236"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1239", "view": "all"}, "_": "Baseline and compact nodes have similar costs and capacities."}]}]}]}]}]}]}}