{"pii": "S1071581923000137", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e262", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e263"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e265", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e266", "view": "all"}, "_": "This paper presents an Internet of Musical Things system devised to support recreational music-making, improvisation, composition, and music learning via vocal queries to an online music repository. The system involves a commercial voice-based interface and the Jamendo cloud-based repository of Creative Commons music content. Thanks to the system the user can query the Jamendo music repository by six content-based features and each combination thereof: mood, genre, tempo, chords, key and tuning. Such queries differ from the conventional methods for music retrieval, which are based on the piece’s title and the artist’s name. These features were identified following a survey with 112 musicians, which preliminary validated the concept underlying the proposed system. A user study with 20 musicians showed that the system was deemed usable, able to provide a satisfactory user experience, and useful in a variety of musical activities. Differences in the participants’ needs were identified, which highlighted the need for personalization mechanisms based on the expertise level of the user. Importantly, the system was seen as a concrete solution to physical encumbrances that arise from the concurrent use of the instrument and devices providing interactive media resources. Finally, the system offers benefits to visually-impaired musicians."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e268", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e269"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e271", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e272", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e274"}, "$$": [{"#name": "list-item", "$": {"id": "d1e275"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e278", "view": "all"}, "_": "An Internet of Musical Things system is created to support recreational music-making, improvisation, composition, and music learning via vocal queries to an online music repository."}]}, {"#name": "list-item", "$": {"id": "d1e280"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e283", "view": "all"}, "_": "Thanks to the system, users can query the Jamendo music repository by six content-based features and combination thereof: mood, genre, tempo, chords, key and tuning."}]}, {"#name": "list-item", "$": {"id": "d1e285"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e288", "view": "all"}, "_": "Such queries differ from conventional methods for music retrieval, which are based on the piece’s title and the artist’s name."}]}, {"#name": "list-item", "$": {"id": "d1e290"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e293", "view": "all"}, "_": "A user study showed that the system is deemed usable, able to provide a satisfactory user experience, and useful in a variety of musical activities."}]}, {"#name": "list-item", "$": {"id": "d1e295"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e298", "view": "all"}, "_": "The system was seen as a concrete solution to physical encumbrances that arise from the concurrent use of the instrument and devices providing interactive media resources."}]}]}]}]}]}]}}