{"pii": "S1084804524001632", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e965", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e966"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e968", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e969", "view": "all"}, "_": "The Internet of Things (IoT) has emerged as a promising paradigm which facilitates the seamless integration of physical devices and digital systems, thereby transforming multiple sectors such as healthcare, transportation, and urban planning. This paradigm is also known as ad-hoc networks. IoT is characterized by several pieces of equipment called objects. These objects have different and limited capacities such as battery, memory, and computing power. These limited capabilities make it difficult to design routing protocols for IoT networks because of the high number of objects in a network. In IoT, objects often have data which does not belong to them and which should be sent to other objects, then leading to a problem known as permutation routing problems. The solution to that problem is found when each object receives its items. In this paper, we propose a new approach to addressing the permutation routing problem in single-hop IoT networks. To this end, we start by representing an IoT network as an oriented graph, and then, based on a reservation channel protocol, we first define a permutation routing protocol for an IoT in a single channel. Secondly, we generalize the previous protocol to make it work in multiple channels. Routing is done using graph theory approaches. The obtained results show that the wake-up times and activities of IoT objects are greatly reduced, thus optimizing network lifetime. This is an effective solution for the permutation routing problem in IoT networks. The proposed approach considerably reduces energy consumption and computation time. It saves 5.2 to 32.04% residual energy depending on the number of items and channels used. Low energy and low computational cost demonstrate that the performance of circuit-based and oriented graph theory is better than the state-of-the-art protocol and therefore is a better candidate for the resolution of the permutation routing problem in single-hop environment."}]}]}]}}