{"pii": "S1084804523000024", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e2342", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e2343"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e2345", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e2346", "view": "all"}, "_": "The controller placement problem (CPP) is one of the main issues that need to be addressed in the context of Software Defined Networking (SDN), especially when different aspects are being considered, such as latency, capacity, reliability, and load balancing. Most of the solutions in the literature address these aspects by considering a fixed load for each controller and attempting to equally distribute the traffic demand of the switches among the controllers, which also have a fixed common capacity. On the contrary, in this work, the CPP is studied by considering load, controller capacity, and the failure probability of controllers and links as varying over time. The CPP is formulated in terms of a robust optimization problem, which, by introducing the concept of scenario, takes into account changes in the network status due to failures, load variations, and changes in switches’ demand and controllers’ capacity. The provided solution is robust, that is, neither controllers’ re-placement nor switches’ re-assignment is required as network conditions change. Besides, a co-evolutionary algorithm is provided to solve the aforementioned optimization problem. Two populations coevolve based on the concept of complementary evolution of allied species in nature. Experimental results on a set of real-world network topologies and comparisons with the state-of-the-art have proven the superiority of the proposal, in terms of better latency, load balancing and resilience, in solving the CPP under different network status changes that might occur over time."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e2348", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e2349"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e2351", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e2352", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e2354"}, "$$": [{"#name": "list-item", "$": {"id": "d1e2355"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e2358", "view": "all"}, "_": "A novel controller placement approach in Software Defined Networks (SDN)."}]}, {"#name": "list-item", "$": {"id": "d1e2360"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e2363", "view": "all"}, "_": "Formulation as a robust optimization problem considering uncertainties in network parameters."}]}, {"#name": "list-item", "$": {"id": "d1e2365"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e2368", "view": "all"}, "_": "Solution is based on a co-evolutionary algorithm, resembling the behavior of allied species in nature."}]}, {"#name": "list-item", "$": {"id": "d1e2370"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e2373", "view": "all"}, "_": "A new genetic operator inspired by the gradient descent theory ensures rapid convergence."}]}]}]}]}]}]}}