{"pii": "S1084804523002151", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1093", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1094"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1096", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1097", "view": "all"}, "_": "Industry 5.0 vision, a step toward the next industrial revolution and enhancement to Industry 4.0, conceives the new goals of resilient, sustainable, and human-centric approaches in diverse emerging applications such as factories-of-the-future and digital society. The vision seeks to leverage human intelligence and creativity in nexus with intelligent, efficient, and reliable cognitive collaborating robots (cobots) to achieve zero waste, zero-defect, and mass customization-based manufacturing solutions. However, it requires merging distinctive cyber–physical worlds through intelligent orchestration of various technological enablers, e.g., cognitive cobots, human-centric artificial intelligence (AI), cyber–physical systems, digital twins, hyperconverged data storage and computing, communication infrastructure, and others. In this regard, the convergence of the emerging computational intelligence (CI) paradigm and softwarized next-generation wireless networks (NGWNs) can fulfill the stringent communication and computation requirements of the technological enablers of the Industry 5.0, which is the aim of this survey. In this article, we address this issue by reviewing and analyzing current emerging concepts and technologies, e.g., CI tools and frameworks, network-in-box architecture, open radio access networks, softwarized service architectures, potential enabling services, and others, elemental and holistic for designing the objectives of CI-NGWNs to fulfill the Industry 5.0 vision requirements. Furthermore, we outline and discuss ongoing initiatives, demos, and frameworks linked to Industry 5.0. Finally, we provide a list of lessons learned from our detailed review, research challenges, and open issues that should be addressed in CI-NGWNs to realize Industry 5.0."}]}]}]}}