{"pii": "S1084804522000844", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Aerial surveillance using unmanned aerial vehicles (UAVs) provides an on-demand and cost-effective solution to smart-city monitoring needs, owing to their three-dimensional positioning adjustment and autonomy. The optimal deployment of a UAV swarm, also known as a flying ad hoc network (FANET), to achieve on-demand coverage of mobile ground targets (MGTs) is challenging in terms of controlling UAV mobility to maximize coverage while maintaining quality of service. Data routing from UAVs to a base station (BS) without awareness of the updated topology causes link breakages, excessive retransmissions, high congestion, and energy holes. Therefore, we propose a joint topology control and routing (JTCR) protocol comprising three modules to perform crowd surveillance. The first JTCR module provides virtual force-based mobility control (VFMC), which controls the mobility of UAVs to track MGTs, ensuring stable bi-connectivity. The second module provides energy-efficient mobility-aware fuzzy clustering that clusters the FANET to aggregate the sensed data to each cluster head (CH) by utilizing the UAV mobility provided by the VFMC. The third module provides topology-aware Q-routing, which routes the aggregated data from CH UAVs to the BS by selecting an optimal path in terms of delay, path stability, and energy consumption. According to our performance study, the proposed JTCR outperforms existing routing protocols in terms of tracking-coverage rate, connectivity rate, the number of retransmissions, packet delivery ratio, end-to-end delay, and energy consumption. This is mainly enabled by the realistic mobility control of the UAV swarm at the reasonable cost of control overhead."}]}]}]}}