{"pii": "S1084804524001061", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e2302", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e2303"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e2305", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e2306", "view": "all"}, "$$": [{"#name": "__text__", "_": "Metarouting allows for the modeling of routing protocols using an algebraic structure called routing algebra. Routing protocols requiring design or validation can easily be modeled using this approach. To date, however, existing research on routing algebras has mainly focused on applying this approach to routing protocols that are generally used in networks which have a single addressing and forwarding protocol. The basic algebraic structures used in such contexts are semirings, Sobrinho’s algebras and algebras of endomorphisms. In this paper, we propose the modification of these existing routing algebras to deal with networks that contain multiple forwarding protocols where tunnels are omnipresent. To achieve this, we define new algebraic structures derived from the three aforementioned ones, in order to model the generalized routing problem with automatic tunneling entitled "}, {"#name": "italic", "_": "valid paths"}, {"#name": "__text__", "_": " algebra. All of our routing algebras are defined as semi-direct products of two structures, the well-known "}, {"#name": "italic", "_": "shortest paths"}, {"#name": "__text__", "_": " algebra and the proposed "}, {"#name": "italic", "_": "valid paths"}, {"#name": "__text__", "_": " algebra. These new algebras are isotonic and non-monotonic with a partial order. We propose a fixed point for those new algebras and we prove the iterative convergence to the optimal solution of the "}, {"#name": "italic", "_": "valid shortest paths"}, {"#name": "__text__", "_": " problem."}]}]}]}]}}