{"pii": "S1098301523030292", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Objectives"}, {"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Widespread use of electronic health records (EHRs) now makes it feasible to expand beyond health insurance claims data to include full EHR data for health economics and outcomes research (HEOR) studies. We seek to develop ways to maximize researcher access to such data while strongly protecting patients’ privacy rights."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0020"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "We analyzed alternative organizational structures and intellectual property rights assignments as they now exist and compared these with structures and intellectual property rights assignments that would maximize access to data for HEOR studies and minimize transactions costs. We analyzed data protection requirements and financial incentives at 3 levels: patient decision making, patients’ data aggregators, and final aggregation across patients’ data."}]}, {"#name": "abstract-sec", "$": {"role": "results", "id": "abssec0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0025"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "Creating new HEOR data systems requires new organizations and funding, while also protecting patients’ data privacy rights. The Cures Act enables a new market for trusted third parties (TTPs) to aggregate patients’ data. New secondary data aggregators must combine individuals’ aggregated EHRs into usable HEOR databases. Maximal patient participation requires complete health insurance coverage of costs that healthcare providers charge for transmitting patients’ data to TTPs. The new secondary system to aggregate data from many TTPs into usable HEOR optimally has external funding."}]}, {"#name": "abstract-sec", "$": {"role": "conclusion", "id": "abssec0025", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0030"}, "_": "Conclusions"}, {"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "Important steps remain uncompleted to achieve maximally available HEOR data while protecting patients’ privacy rights. HEOR information is a public good, so private incentives to support creation and operation of this new system remain incomplete. Public and private support can expand this system to optimally improve people’s health."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0035"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0030", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0030", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Significant health benefits can emerge from health economics and outcomes research (HEOR) studies, but these have been limited by data availability, particularly when relying solely on insurance claims data. Creation of relevant data has obvious public good aspects, but without public intervention, such data will be undersupplied. The Cures Act provides a necessary but insufficient starting point for creating and distributing compilations of electronic health record (EHR) data to expand HEOR studies."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Current laws and rules have led to incomplete researcher access to medical records data, particularly given now-widespread use of EHRs. The Cures Act established patients’ primacy in access to their own EHR data but allows healthcare providers to charge for transmitting those data to their trusted third party data aggregators. Mandating full health insurance coverage for these fees can remove this barrier to participation, thereby expanding generalizability of the data."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "To assure that patients are fully informed about data sharing choices, we propose new monitoring boards to approve incentives for and communication about data sharing, similar to existing procedures for clinical trials. Second-level aggregation must also occur to create usable HEOR data sets from individual compilations of patients’ information by their trusted third parties. This final level of data aggregation requires public or other support to reach optimal levels, just as for basic science research."}]}]}]}]}]}]}}