{"pii": "S1110866524000951", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "A device-free localization system is a technology for tracking targets or individuals without requiring them to carry any electronic devices. The system works by monitoring and processing changes in the received signal strength to detect changes in the environment. However, due to unreliable wireless communications and radio-based tracking solutions, an efficient system concerning both wireless communication and tracking performance should be developed. This paper presents a study of the 2.4 GHz IEEE 802.15.4 device-free localization system, focusing on the effectiveness of wireless network protocols and the accuracy of localization algorithms. The novelty and contribution of our work is that we develop a modified desync protocol for network synchronization and the weighted k-nearest neighbor algorithm for location tracking. The study provides both simulation and experimental evaluations, considering hardware configurations such as the CC2538 + CC2592 device. Results demonstrate that the modified desync protocol can effectively operate in real-world environments. The network’s performance is evaluated through the packet delivery ratios for different network sizes and the convergence time, which refers to the ability to restore synchronization among network nodes. In our experiment case, the packet delivery ratio and the convergence time for a twenty-node network size are 97.98 % and 6.976 s, respectively. In addition, the weighted k-nearest neighbor algorithm with an additional solution provides a high estimation accuracy of 99.93 % as accessed from various fixed human locations. Results also indicate that our algorithm can track the locations of a movement person, achieving an average accuracy of 85.75 % for different movement patterns. Finally, we suggest that the effect of new generative artificial intelligence approaches in this field should be investigated."}]}]}]}}