{"pii": "S1110866523000464", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "Cattle identification is pivotal for many reasons. Animal health management, traceability, bread classification, and verification of insurance claims are largely depended on the accurate identification of the animals. Conventionally, animals have been identified by various means such as ear tags, tattoos, rumen implants, and hot brands. Being non-scientific approaches, these controls can be easily circumvented. The emerging technologies of biometric identification are extensively applied for Human recognition via thumb impression, face features, or eye retina patterns. The application of biometric recognition technology has now moved towards animals. Cattle identification with the help of muzzle patterns has shown tremendous results. For precise identification, nature has awarded a unique Muzzle pattern that can be utilized as a primary biometric feature. Muzzle pattern image scanning for biometric identification has now been extensively applied for identification. Animal recognition via Muzzle pattern image for different applications has been proliferating gradually. One of those applications includes the identification of fake insurance claims under livestock insurance. Fraudulent animal owners tend to lodge fake claims against livestock insurance with proxy animals. In this paper, we proposed the solution to avoid and/or discard fraudulent claims of livestock insurance by intelligently identifying the proxy animals. Data collection of animal muzzle patterns remained challenging. Key aspects of the proposed system include: (1) the Animal face will be detected through visual using YOLO v7 object detector. (2) After face detection, the same procedures will apply to detect muzzle point (3) the muzzle pattern is extracted and then stored in the database. The System has a mean average precision of 100% for the face and 99.43% for the nose/muzzle point of the animal. Once the animal is registered in the database, the identification process is initiated by extracting unique nose pattern features with ORB and/or SIFT. Then it is matched using the pattern matchers like BFMatcher and/or FLANNMatcher for animal identification. The proposed model is more efficient and accurate as compared to concurrent approaches. The results extracted from this research study show 100% accurate identification."}]}]}]}}