{"pii": "S1110982316300047", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "Bukit Merah karst has been deteriorating dramatically over 40"}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "years due to intensification of human activities as a result of fast rate of lateral urbanization and extensive dimensional expansion of surface mining activities for instance, quarrying. Application of morphometric techniques to karst landforms provides a quantitative measurement and analysis of the configuration of karst landform variations. The objective of this study is to demonstrate the viability of using an integrated approach based on digital terrain model (DTM) derived time-series of steriopair aerial photography for monitoring the long-term geological karst response to environmental changes. The aerial photo stereo pairs were used to extract digital terrain model of the years 1981 and 2004, which in turn produced the TIN profiles of selected karst sites in the study area to define the karst morphology changes and to develop 3D representation and visualization. A detailed visualization of the karst terrain and its surface changes were represented using 3D virtual reality tool to substantiate the impact of surface mining in the Bukit Merah. Topographical characteristics of limestone hills, mountainous areas and flat areas were presented in 3D prospective. The results show the simulation topographical analysis results have confirmed that there were changes in elevation over the period from 1981 to 2004 especially in the limestone hill area as detected by the digital elevation model. It showed a dramatic variation in elevation has increased over a time interval. This means there has occurred an interference with the terrain attributed to human intervention or natural causes during the time interval. The result shows that the digital terrain model (DTM) derived time-series of steriopair aerial photography is able to delineate the changes in karst topography."}]}]}]}]}}