{"pii": "S1110016824008718", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0170", "view": "all"}, "_": "Efficient allocation of resources is crucial in wireless ad hoc networks (WANETs) as spectrum assets are costly. Cooperative communications were introduced as a solution to the problem of limited spectrum availability. In this approach, numerous nodes share their resources and increase the bandwidth available to end-users. This research investigates the practicality of a new algorithm that optimizes resources based on load for Cooperative Communications in 5 G WANETs. The algorithm consists of two components. Initially, a distributed algorithm for forming a topology is suggested. This algorithm employs a load-based approach to explore network conditions and efficiently choose the most suitable topology. An optimization algorithm that relies on a greedy strategy is suggested. In this approach, the chosen nodes send their bits to the receiver to maximize the attainable system throughput. A thorough simulation study is conducted to evaluate the overall performance of the proposed algorithm in assessing existing methods. The proposed model obtained 94.72 % energy efficiency, 91.69 % network throughput, 94.72 % spectrum utilization, 27.47 % network delay, 24.08 % packet loss rate, 94.38 % signal-to-noise ratio, 93.91 % data transfer rate, 95.87 % error detection rate, and 94.28 % link reliability rate. The results demonstrate that the suggested algorithm significantly enhances the system and the overall network performance compared to existing approaches. The proposed approach is feasible and environmentally friendly for optimizing bandwidth in 5 G wireless ad hoc Networks."}]}]}]}}