{"pii": "S1110016823009754", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "Several technologies provide cellular connectivity to transmit data to end devices (EDs) in the indoor environment. These technologies have short-range; complex network architecture; short lifespan; and high power consumption. In this paper, LoRa is utilized to design the Building Internet of Things (BIoT) system for electronic shelf labels (ESL) to provide long-range connectivity. To minify the transmission losses, the concurrent data exploits data parallelism for updating transmission parameters at the network server (NS) for non-interruptive communication between the centroid gateways (GWs) and allocated EDs. The EDs are deployed by K-means at different locations in each cluster based on spreading factor (SF) and data rate (DR) to avoid data congestion and intra-SF interference for the SF and hybrid (DR/SF) models. The varying bandwidths (BWs) and duty cycles (DCs) enhance the lifespan of the EDs, while the Bayesian game parameter selection (BGPS) method minimizes the power losses among the EDs. The one-slope estimates medium losses; the adjusted R-square predicts variance; and Pearson finds a correlation among the measured values. The hybrid model improves the network’s performance to a spiraling average efficiency of 90.48 % and 89.64 %, with network saturation of 10.185 % and 10.337 % for pure and slotted ALOHA, respectively. The overall results illustrate a packet loss ratio (PLR) of 20.11 % for the SF model and 4.861 % for the hybrid model. The energy dissipation plunged to 0.06032 J per day, prolonging the EDs’ life span to 14265.34 days."}]}]}]}}