{"pii": "S1110016817300169", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The availability of multiple channels in Mobile Ad hoc NETworks (MANET) enhances the options of utilizing channels efficiently for achieving improved system performance in terms of throughput, end-to-end and communication overhead that impacts spectral efficiency. However, ensuring quality of service (QoS) in multichannel ad hoc networks is crucial and most of the existing signaling and adaptation mechanisms for QoS available in the literature mainly supports fixed-width channels or variable-width channels that restrict network performance. In this paper, we propose a Hyper-Erlang Channel Allocation Factor-based QoS Enhancement Mechanism (HECAFQEM) for improving the support capability of ad hoc networks. HECAFQEM uses a composite model that models the availability and performance of the prevailing channel conditions through Hyper-Erlang Factor that quantifies the rate of rejection of the network. The degree of rejection of user request depends on queuing delay, transmission delay and two significant parameter called Channel Allocation factor (CAF) and Expected Channel Allocation Factor (ECAF). The QoS adaptations are performed by HECAFQEM by measuring the queuing delay that helps in segmenting the packet stream into small bursts for enhancing the degree of QoS. This distributed mechanism enhances QoS through the estimation of Channel Allocation Factor (CAF) that dynamically adapts channel widths in a multichannel ad-hoc network to suit bandwidth adaptability. The performance analysis of HECAFQEM is carried out based on ns-2 simulator and the proposed approach shows an improvement on an average by 23% and 19% in terms of packet delivery ratio and throughput than the existing QoS adaptation mechanisms available in the literature."}]}]}]}}