{"pii": "S1110016821005330", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "With the establishment of the economic New Area, preliminary results have been achieved in the construction of the business environment, and some experience has been accumulated, but there are still many problems. The most important of these is the issue of business safety. The security system in commercial areas generally adopts manual shifts. This management method is increasingly unsuitable for urban development. Therefore, the unattended electronic fence system emerges from time to time, but its security has become an urgent problem to be solved. This article designs the electronic fence system project based on intelligent video surveillance and wireless local area network technology. This article designs the electronic fence system based on intelligent video surveillance and wireless local area network technology. First, design a pulsebased electronic fence system. Under the control of the FPGA, by sending pulses to the electronic fence, the frontend detection fence subsystem can detect the pulse signals, and implement the pulse signals to the FPGA through wireless local area network technology. After feature extraction and pulse signal recognition, determine whether an abnormal situation has occurred. Secondly, an intelligent video surveillance system based on wireless local area network is designed to record the surrounding video information 24"}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": " h, and use related target detection technology to locate and record abnormal conditions. The experimental results show that the design system can"}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "well judge the occurrence of abnormal conditions and record the abnormal conditions in real"}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "time, which can ensure the safety."}]}]}]}]}}