{"pii": "S111001682300649X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0150", "view": "all"}, "$$": [{"#name": "__text__", "_": "The availability of industrial network topologies is limited, which presents a significant challenge for researchers in this field. Network generators are essential tools for generating realistic simulation outcomes in network research. Thus, it is crucial to use realistic topologies that can accurately represent the characteristics of the target network. The primary objective of this study is to address the existing research gap by developing an industrial network topology generator for novel topology datasets specific to industrial networks and the industrial Internet of Things (IIoT). In this paper, we describe the development of the graph theoretic "}, {"#name": "underline", "_": "ind"}, {"#name": "__text__", "_": "ustrial topology "}, {"#name": "underline", "_": "gen"}, {"#name": "__text__", "_": "erator (GENIND), a topology generator that can produce realistic IIoT and industrial network topologies. The proposed GENIND network topology generator is validated through comparisons with real-world industrial network topologies. The evaluation framework assesses the performance of the proposed GENIND system using three main measures: the overall network structure, path-related factors, and resilience topological structure features. The results of the evaluation demonstrate a high degree of similarity between the graphs generated by the GENIND system and the real-world industrial networks used for comparison. This finding suggests that the generated graphs can be utilized as reliable tools to predict the behavior of industrial networks under various conditions."}]}]}]}]}}