{"pii": "S111086652300021X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "Wireless Sensor Networks (WSNs) are revolutionizing the globe with their sensing technologies. This initiative aims to design and deploy a cattle health monitoring system (CHMS) for the agriculture sector for the well-being of livestock and the eradication of hunger. The production and consumption of all dairy and meat products can only be conducted responsibly if the health of the source animal is protected. In this regard, WSNs, a component of the Internet-of-things (IoT) system, can be utilized for monitoring cow health due to their adaptability and portability, which enables them to be applied to expansive domains such as cattle healthcare. The integration of IoT and artificial intelligence enables the prediction of livestock illnesses. The primary purpose of this proposed system is to forecast cattle diseases utilizing real-time data from non-invasive body-area sensors and Artificial Neural Networks (ANN) and to display the expected results to authorized personnel via a web application. Popular authentication schemes are used in this system as it is susceptible to hacking and requires robust network security to protect the confidentiality, integrity, and availability of its resources. The presented results validates the accuracy of the proposed novel system for cow diseases prediction that is approximately 98 percent. The proposed CHMS can assist concerned farmers in remotely monitoring the health of their livestock from a variety of locations and in taking appropriate and timely measures to protect animal health. Technological automation will lower prices and labor inputs while enhancing farm output."}]}]}]}}