{"pii": "S1110866521000281", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "In this contemporary era, recent developments have seen proliferation of methods on improving energy utilization for wireless sensor networks. Although the proposed methods can mitigate the problem of rapid battery depletion to some extent, the lifespan of sensor nodes is still a biggest constraint. Many studies conducted so far have shown continuous network functions with the help of external harvesting techniques. However, these provide low output because of the limitation on the energy capturing devices. Therefore, energy limitation strongly restricts the usage of wireless sensor nodes. This paper aims to provide high recharging rates and better energy efficiency by proposing a three-step mechanism, which is an extension of our existing proposed work J-ERLB (Joint Energy Replenishment and Load Balancing). In a three-step mechanism, topology selection followed by recharging and load balancing are combined together to prolong the lifetime of sensor nodes. Topology selection is performed by implementing J-ERLB on various topologies like ring, star, and cluster. Further, taking advantage of Unmanned Aerial vehicle (UAV) we focus on data collection and high-rate recharging. We have implemented System on Chip (SoC) integrated chip on UAV to achieve goal of perpetual network operations. Finally, the effectiveness of proposed mechanism is tested by comparing its numerical outcomes with existing J-ERLB and J-MERDG (Joint Mobile Energy Replenishment and Data Gathering) techniques. The overall throughput for 3SM is doubled in comparison with the existing techniques, whereas the average remaining energy shows 6 times better savings for the proposed solution in comparison to the existing J-ERLB and J-MERDG when varying data rates is applied."}]}]}]}}