{"pii": "S111001682400351X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0195", "view": "all"}, "_": "Wearable antennas are important in many areas of our lives, including the Internet of Things (IoT), health care, sports, the automobile industry, security, and entertainment. Wearable antennas should be designed with a compact size in order to be readily integrated and conform to the body shape, as well as a high performance to withstand mechanical and environmental changes. 5 G and 6 G technologies offer sufficient solutions for wearable antennas utilized for wireless body area networks (WBANs) and IoT applications in terms of high reliability, high gain, compactness, low cost, and high performance. In this work, we present for the first time a comprehnsive review of 5 G and 6 G wearable antennas discussing their significance, types, applications, and design issues in detail. A state-of-the-art for the recent 5 G wearable antenna reviews is also outlined. The main contribution of this work is explaining the compactness and performance enhancement methods at both bands in ascending order starting from low frequency, sub 6 GHz, 5 G mmWave, up to 6 G (high mmWavw and THz wave), so the reader will differentiate between the antennas’ design requirements and challenges for different bands easily. The impacts of flexibility, bending, and on-body/off-body on antenna performance as well as specific absorption rate (SAR) calculation are also taken into account. This review can be considered a valuable tool for designers and researchers in designing many types of wearable antennas at 5 G and 6 G frequency bands for various applications by understanding the antenna's design problems, topologies, and types of substrate and conductive materials."}]}]}]}}