{"pii": "S1110016821001046", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The anti-seepage wall project is an important part of the anti-seepage system of water conservancy and hydropower projects, and it is the basic facility and barrier to resist floods and ensure the safety of people's lives and property. This paper analyzes the wireless communication GPRS (General Packet Radio Service) technology. After establishing a mathematical model and determining the optimal sensor deployment scheme, the mesh-type sensor network type is determined, and the overall design scheme of the system is analyzed. The wireless network completes the field information collection and instruction transmission, and transmits the field information to the remote monitoring platform for unified processing. In order to effectively improve the node coverage of wireless sensor networks, a network coverage optimization method based on a hybrid strategy to improve the Antlion algorithm is proposed. The continuity boundary shrinkage factor is used to improve the search traversal of the algorithm and accelerate the convergence speed. Dynamic weight coefficients are introduced during the elitization phase to balance the global exploration and local development capabilities of the algorithm. Combining the precocious convergence judgment mechanism and the dynamic hybrid mutation method, the algorithm can effectively jump out of the local optimum. The comparison experiments on 4 benchmark functions verify the effectiveness of the improved strategy. The water injection test was used to detect and evaluate the integrity and impermeability of the plastic concrete impervious wall. The drilling and excavation verification results confirmed the effectiveness and practicability of the method."}]}]}]}}