{"pii": "S1110016823005987", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "One of the most crucial issues in mobile networks is ensuring reliable and stable connectivity during mobility. In recent years, numerous research has examined Fourth Generation (4G) and Fifth Generation (5G) mobile networks to address issues related to handover (HO) self-optimisation. Different approaches have been developed to identify the best Handover Control Parameters (HCPs) settings, including Time-To-Trigger (TTT) and Handover Margin (HOM), since managing HCP values is a key factor in determining the efficiency and accuracy of handover decisions. The purpose of this work is to address the challenges associated with HO management in Sixth Generation (6G) mobile networks, where a massive number of diverse devices, high mobility, and varying network conditions (e.g., Ultra Dense Network (UDN), Heterogeneous Network (HetNet) and Millimetre Waves (mmWaves)) are established. This, in turn, presents complex HO issues which require solutions that can adapt to different deployment settings. To provide a brief background of mobility management, the paper presents the basic HO concept, HO history, and HO procedure. Additionally, a comparison of HO in 4G to 6G is discussed to gain a better understanding of technology development and its effect on HO solutions. Furthermore, the basics of Mobility Robustness Optimisation (MRO) is explained, which involve HCP values. Previous MRO approaches have made significant advancements; however, they often lack adaptability and robustness to dynamic network conditions. By leveraging Artificial Intelligence (AI) algorithms with MRO techniques, this approach offers an improved solution to optimize handover decisions in a self-optimizing manner, thereby enhancing the overall network performance. To achieve this goal, it is necessary to analyze previous MRO and AI-integrated solutions and make comparisons between them. Additionally, the advantages and disadvantages of these solutions are considered. The contribution of this work lies in identifying the directions for HO self-optimization in 6G deployment. It demonstrates that deploying an AI-based solution would benefit future MRO deployments. This survey will aid in the analysis of mobility management challenges, particularly for the future mobile MRO self-optimization implementation in future technologies."}]}]}]}}