{"pii": "S1110016824001418", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0120", "view": "all"}, "$$": [{"#name": "__text__", "_": "The significant advancement of Artificial Intelligence (AI) technology has led to the gradual emergence of intelligent adaptive learning as a pivotal modality for acquiring knowledge. The knowledge graph, as a crucial component of the intelligent adaptive learning model, assumes the vital responsibility of guiding and facilitating the learning process while evaluating its outcomes. The current knowledge graph, however, presents several challenges including fragmented knowledge content, inadequate ability characterization, and limited automatic construction capabilities, which hinder its effectiveness in assisting learners to achieve their learning objectives. The paper proposes the knowledge-resource-objective (KRO) model of knowledge graph, based on a robust correlation between knowledge, learning resources, and learning objectives. In the KRO model, Bidirectional Encoder Representations from Transformers (BERT) is utilized for data pre-processing. Protége is employed for ontology construction. Entities and relations are synchronously annotated using the Main-Entity+ Relation +Begin-Inside-End-Single-Other (ME+R+BIESO) corpus labeling model to complete the triplet construction. Additionally, entities and relations are extracted synchronously utilizing a Bi-directional Long-Short Term Memory-Conditional Random Field (BiLSTM-CRF) model. Knowledge visualization and reasoning are achieved through Neo4j graph database. The study employs the "}, {"#name": "italic", "_": "Letter of Credit"}, {"#name": "__text__", "_": " as a case study to examine the application of the KRO model, and assesses its efficacy through metrics such as accuracy, precision, recall, and F1-score. The research demonstrates that the KRO model effectively targets learning objectives, restructures knowledge and resources, optimizes learning pathways, provides recommendations for learning resources, and visualizes learners' cognitive states. As a result, it enhances the effectiveness of intelligent adaptive learning. The subsequent research will continue to focus on the visual representation of learners' learning progress and explore the practical application of learners' profiles in diverse disciplines, aiming to facilitate the realization of personalized learning for individuals."}]}]}]}]}}