{"pii": "S1110016817301266", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "Due to rapid growth in wireless communication, multimedia communication over wireless network attracted researchers. In this field of multimedia communication mobile Ad Hoc Network (MANET) has proved its significance. MANETs are collection of various communicating nodes without utilizing any fixed infrastructure and network topology. In MANET, mobile nodes can independently be in any direction which causes frequent change in network configuration. Use of multimedia communication is increasing day-by-day which demands high Quality-of-Service for end user experience. MANET suffers from challenges to provide QoS such as dynamic nature of mobile node, limited bandwidth, routing, and contention channel."}, {"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "In this work, we address the issue QoS in mobile ad hoc network for multimedia applications. In order to improve the quality of service for mobile-ad hoc network, this article presents a combined scheme to maximize the network performance. Proposed approach includes three main aspects such as channel modeling, threshold based data transmission and queuing modeling over physical layer to support quality of service. Channel modeling provides the information about channel such as path loss, Probability density function of channel fading, path gain and probability density function of gain. Later, threshold selection model is implemented to compute the threshold of video packet. With the help of threshold, channel is selected through which video packet has to be transmitted and finally queuing model is developed to reduce communication delay in mobile ad hoc network. Performance of proposed model is computed in terms of throughput, bandwidth efficiency and packet delivery rate and compared with existing approach. Experimental study shows that proposed model is able to perform better when compared to existing approach."}]}]}]}}