{"pii": "S1130634324001193", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Purpose"}, {"#name": "simple-para", "$": {"id": "sp0045", "view": "all"}, "_": "To review and analyse the available literature on peripheral administration of noradrenaline (NA) with the aim of providing recommendations to ensure correct use and patient safety."}]}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0015"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "sp0050", "view": "all"}, "_": "Systematic review on the databases PubMed, ISI Web of Science, SCOPUS, and Science Direct, using the following search terms: (“Noradrenaline” [Mesh]) AND (“Norepinephrine” [Mesh]) AND (“Vasopressors” [Mesh]) AND (“Peripheral infusions” [Mesh]) OR (“Extravasations” [Mesh]). A total of 1040 articles were identified. Animal studies and studies written in languages other than English were excluded. Finally, 83 articles were included."}]}, {"#name": "abstract-sec", "$": {"id": "as0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "sp0055", "view": "all"}, "_": "NA can be administered peripherally. The risk of extravasation should be taken into account, with phentolamine being the first pharmacological line of treatment. It has also been related to the appearance of thrombophlebitis, cellulitis, tissue necrosis, limb ischaemia, and gangrene, although its incidence seems to be low. The use of peripheral NA in children seems to be carried out without obvious complications. The use of standard concentrations is suggested to reduce the risk of errors. It is recommended to use 0.9% saline as the default diluent for peripheral NA."}]}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0025"}, "_": "Conclusions"}, {"#name": "simple-para", "$": {"id": "sp0060", "view": "all"}, "_": "Peripheral infusions of NA could be a safe and beneficial option in early resuscitation provided that a number of guidelines are followed that reduce the likelihood of complications associated with this route."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "lang": "es", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0030"}, "_": "Resumen"}, {"#name": "abstract-sec", "$": {"id": "as0025", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0035"}, "_": "Objetivo"}, {"#name": "simple-para", "$": {"id": "sp0065", "view": "all"}, "_": "Revisar y analizar la literatura disponible sobre la administración de noradrenalina (NA) por vía periférica con el fin de aportar recomendaciones que garanticen el correcto uso y la seguridad del paciente."}]}, {"#name": "abstract-sec", "$": {"id": "as0030", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0040"}, "_": "Método"}, {"#name": "simple-para", "$": {"id": "sp0070", "view": "all"}, "_": "Revisión sistemática en las bases de datos PubMed, ISI Web of Science, SCOPUS y Science Direct, utilizándose los siguientes términos de búsqueda: («Noradrenaline» [Mesh]) AND («Norepinephrine» [Mesh]) AND («Vasopressors» [Mesh]) AND («Peripheral infussions» [Mesh]) OR («Extravasations» [Mesh]). Se identificaron 1040 artículos. Se excluyeron estudios en animales y estudios escritos en idiomas diferentes al inglés. Finalmente se incluyeron 83 artículos."}]}, {"#name": "abstract-sec", "$": {"id": "as0035", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0045"}, "_": "Resultados"}, {"#name": "simple-para", "$": {"id": "sp0075", "view": "all"}, "_": "La administración de NA se puede realizar por vía periférica. Se debe tener en cuenta el riesgo que existe de extravasación, siendo la fentolamina la primera línea farmacológica de tratamiento. También se ha relacionado con la aparición de tromboflebitis, celulitis, necrosis tisular, isquemia de miembros y gangrena, aunque su incidencia parece ser baja. El uso de NA periférica en niños parece llevarse a cabo sin complicaciones evidentes. Se sugiere el empleo de unas concentraciones estándares para reducir el riesgo de errores. Se recomienda emplear solución salina 0,9% como diluyente predeterminado para la NA periférica."}]}, {"#name": "abstract-sec", "$": {"id": "as0040", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0050"}, "_": "Conclusiones"}, {"#name": "simple-para", "$": {"id": "sp0080", "view": "all"}, "_": "Las infusiones periféricas de noradrenalina podrían ser una opción segura y beneficiosa en la reanimación temprana siempre y cuando se sigan una serie de directrices que reduzcan la probabilidad de las complicaciones asociadas a esta vía."}]}]}]}}