{"pii": "S1319157817301799", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "This paper explores the effectiveness of Particle Swarm Classification (PSC) for a classification task in the field of educational data mining. More specifically, it proposes PSC to design a classification model capable of classifying questions into the six cognitive levels of Bloom's taxonomy. To this end, this paper proposes a novel specialized initialization mechanism based on Rocchio Algorithm (RA) to mitigate the adverse effects of the curse of dimensionality on the PSC performance. Furthermore, in the design of the RA-based PSC model of questions classification, several feature selection approaches are investigated. In doing so, a dataset of teachers' classroom questions was collected, annotated manually with Bloom's cognitive levels, and transformed into a vector space representation. Using this dataset, several experiments are conducted, and the results show a poor performance of the standard PSC due to the curse of dimensionality. However, when the proposed RA-based initialization mechanism is used, a significant improvement in the average performance, from 0.243 to 0.663, is obtained. In addition, the results indicate that the feature selection approaches play a role in the performance of the RA-based PSC (average performance ranges from 0.535 to 0.708). Finally, a comparison between the performance of RA-based PSC (average performance"}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "="}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "0.663) and seven machine learning approaches (best average performance"}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "="}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "0.646) confirms the effectiveness of the proposed RA-based PSC approach."}]}]}]}]}}