{"pii": "S1319157823003026", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st135"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp005", "view": "all"}, "$$": [{"#name": "__text__", "_": "The relational triple extraction is a fundamental and essential information extraction task. The existing approaches of relation triple extraction achieve considerable performance but still suffer from 1) treating the relation between entities as a meaningless label while ignoring the relational semantic information of the relation itself and 2) ignoring the interdependence and inseparability of three elements of the triple. To address these problems, this paper proposes a "}, {"#name": "bold", "_": "R"}, {"#name": "__text__", "_": "elational "}, {"#name": "bold", "_": "P"}, {"#name": "__text__", "_": "rompt approach, based on which constructs a "}, {"#name": "bold", "_": "S"}, {"#name": "__text__", "_": "ingle-module "}, {"#name": "bold", "_": "S"}, {"#name": "__text__", "_": "ingle-step relational triple extraction model (RPSS). In particular, the proposed relational prompt approach consist of a relational hard-prompt and a relational soft-prompt, while provide take into account different level of relational semantic information, covering both the token-level and the feature-level relational prompt information. Then, we jointly encode entities and relational prompts to obtain a unified global representation. We mine deep correlations between different embeddings through attention mechanism and then construct a triple interaction matrix. Then, all triples could be directly extracted from a single module in a single step. Experiments demonstrate the effectiveness of the relational prompt approach, as well as relational semantics and triple integrity are essential for relation extraction. Experimental results on two benchmark datasets demonstrate our model outperforms current state-of-the-art models."}]}]}]}]}}