{"pii": "S1319157824002076", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e7145", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e7146"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e7148", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e7149", "view": "all"}, "_": "Requirements-to-code traceability link recovery (RC-TLR) can establish connections between requirements and target code artifacts, which is critical for the maintenance and evolution of large software systems. However, to the best of our knowledge, there is no existing experimental study focused on state-of-the-art (SOTA) methods for the RC-TLR problem, and there is also a lack of uniform benchmarks for evaluating new methods in the field. We developed a framework to identify SOTA methods using the Systematic Literature Review method and applied it to research in the RC-TLR field from 2018 to 2023. Through experiments replication on 13 datasets using 6 methods, we observed that for information retrieval-based methods, Close Relations between Target artifacts-based method (CRT), TraceAbility Recovery by Consensual biTerms (TAROT), and Fine-grained TLR (FTLR) performed well on COEST dataset, while Combining Part-Of-Speech with information-retrieval techniques (Conpos) and TAROT achieve promising results in large datasets. As concerns machine learning-based methods, Random Forest consistently exhibits strong performances on all datasets. We hope that this study can provide a comparative benchmark for performance evaluation in the RC-TLR field. The resource repository that we have established is expected to alleviate the workload of researchers in performance analysis, and promote progress of the field."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e7151", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e7152"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e7154", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e7155", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e7157"}, "$$": [{"#name": "list-item", "$": {"id": "d1e7158"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e7161", "view": "all"}, "_": "The first SOTA study in the requirements-to-code link recovery task."}]}, {"#name": "list-item", "$": {"id": "d1e7163"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e7166", "view": "all"}, "_": "Providing the software engineering community with a universal framework for identifying SOTA methods."}]}, {"#name": "list-item", "$": {"id": "d1e7168"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e7171", "view": "all"}, "_": "Systematically organized and open-sourced the relevant resources in the requirements-code traceability link recovery task."}]}]}]}]}]}]}}