{"pii": "S1319157824001587", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e5301", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e5302"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e5304", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e5305", "view": "all"}, "_": "The Internet of Things (IoT) provides a major contribution to the innovation of smart manufacturing and industrial automation. Due to IoT, network devices and intelligent machines exchange information through different types of Internet connection and processes are predominantly automated. This reduces significantly the need for more human intervention and supports high performance. Nevertheless, the utilization of IoT in industrial automation called Industrial IoT (IIoT) has several issues, including the management of applications and IIoT devices. Moreover, heterogeneous networks and tremendous devices deployed in the IIoT environment require flexible configuration and reconfiguration according to the change for ensuring dynamic performance. We argue that Software-Defined Networking (SDN) is one of the technologies that can be used to solve some of the previously mentioned issues. In this paper, we propose a survey for the implementation of SDN solutions in IIoT and discuss the pros and cons brought about by this synergy named “SDN-IIoT”. We explore the current articles on SDN-IIoT by considering different crucial domains such as flow installation techniques, fault tolerance, traffic routing optimization, resource management, energy efficiency, real-time, and network security. Furthermore, we analyze Artificial Intelligence (AI)/Machine Learning (ML) tasks to improve the performance of SDN-IIoT and the deployment of different technologies like Network Function Virtualization (NFV) and Time-Sensitive Networking (TSN) in SDN-IIoT. After observing the limitations of existing SDN-IIoT architectures, we propose an improved candidate architecture for SDN-IIoT based on a hierarchical distributed control plane. The new SDN-IIoT architecture contains AI, Industrial Backhaul Network (IBN), Dynamic Hash Table (DHT), AdaptFlow protocol, and edge/cloud storages. This paper selects the five most used SDN controllers by the literature review and identifies the features of each SDN controller. In the end, we provide open challenges and future research orientations in SDN-IIoT. We hope that this paper will be helpful for engineers, organizations, and researchers on the innovation of IIoT and SDN technologies."}]}]}]}}