{"pii": "S1319157824002131", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1378", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1379"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1381", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1382", "view": "all"}, "_": "The ECG signal is often accompanied by noise, which can affect its shape characteristics, so it is important to perform signal de-noising. However, the commonly used signal noise reduction methods, such as wavelet or filter transformation, often prioritize high-frequency signals over low-frequency ones, leading to the loss of low-frequency band features or difficulties in capturing them. We propose a fusion reconstruction framework that combines hash autoencoder and margin semantic reinforcement to enhance low-frequency band features. Specifically, for labeled samples, margin semantic reinforcement identifies and corrects weight discrepancies among bands with similar waveforms but different labels to amplify the low-frequency signals associated with the label and reduce irrelevant ones. Meanwhile, hash autoencoder utilizes a semantic hash dictionary to reconstruct the original signal and mitigate noise pollution. For unlabeled samples, the hash autoencoder is utilized to generate pseudo-labels, followed by the reproduction of the aforementioned enhanced reconstruction process. The final step involves weighting the two types of signals, enhanced with margin semantics and hash autoencoder reconstruction, to achieve the reconstruction objective of the original signal, facilitating recognition and detection tasks. Experiments conducted on different classical classifiers demonstrate that the reconstructed ECG signals can significantly improve their performance."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1385", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1386"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1388", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1389", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1391"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1392"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1395", "view": "all"}, "_": "An enhanced margin semantic reconstruction method is proposed to enhance the margin of the signal to highlight the ECG signal corresponding to the semantic."}]}, {"#name": "list-item", "$": {"id": "d1e1397"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1400", "view": "all"}, "_": "A concise supervised semantic hash autoencoder is designed to efficiently generate pseudo-labels for unlabeled data while effectively mitigating noise pollution."}]}]}]}]}]}]}}