{"pii": "S1319157824002064", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e923", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e924"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e926", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e927", "view": "all"}, "_": "In the context of the rapid development of Internet of Things (IoT) technology and the extensive proliferation of the global Internet, the authenticity of data has become a focal point of societal demand. It plays a decisive role in enhancing the quality of decision-making and operational efficiency. However, the storage and authenticity verification of large-scale IoT real-time data present unprecedented technical challenges. Faced with the inherent data security risks of traditional centralized cloud storage, blockchain technology reveals its unique potential for solutions with its inherent immutability and decentralization. Nevertheless, current blockchain-based data storage solutions are still restricted by high costs and inefficiency. To address these challenges, this paper innovatively proposes the BI-TSFID framework, which leverages the benefits of Ethereum and IPFS and optimizes the Merkle Tree structure and verification mechanisms. The BI-TSFID framework adopts a strategy of on-chain data summary storage and off-chain computation. This approach provides IoT with efficient and reliable data storage, reduces operational costs, and simplifies the verification process. This research has improved the data computation efficiency by refining the structure of the Merkle Tree and analyzed its optimal branch number. Additionally, the study introduces a sampling-based data integrity verification method that significantly reduces resource consumption during the verification process. Experimental results show that the solutions proposed in this paper effectively enhance the efficiency and security of IoT data management and provide valuable guidance for the theory and practice of real-time data storage and verification, further promoting the development and innovation in the related technological fields."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e930", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e931"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e933", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e934", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e936"}, "$$": [{"#name": "list-item", "$": {"id": "d1e937"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e940", "view": "all"}, "_": "Proposed BI-TSFID: a blockchain-based IoT data storage framework using Ethereum, improved Merkle tree, and edge computing."}]}, {"#name": "list-item", "$": {"id": "d1e942"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e945", "view": "all"}, "_": "Improved Merkle Mountain Range with multi-branch structure, optimizing network and computational efficiency."}]}, {"#name": "list-item", "$": {"id": "d1e947"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e950", "view": "all"}, "_": "Introduced sampling-based integrity verification to reduce network and computational overhead, highlighting advantages."}]}]}]}]}]}]}}