{"pii": "S1319157818311649", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st070"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0180", "view": "all"}, "_": "Sindhi is one of the oldest languages of the world having proper and complex grammar, morphological structure and big number of alphabet."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0185", "view": "all"}, "_": "This research study analyzes the sentiment based text corpus of Sindhi language."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0190", "view": "all"}, "_": "The purpose of this research study is to develop the Sindhi text corpus for analysis of feature distribution, language variation and sentiment analysis."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0195", "view": "all"}, "_": "This research study is derived from my research study on “sentiment analysis for Sindhi text” which is submitted at SZABIST Karachi Sindh Pakistan."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0200", "view": "all"}, "_": "This research study opens doors for research on word2vec, feature analysis and aspect based sentiment analysis."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st075"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp010", "view": "all"}, "_": "Sindhi language is a rich language with plenty of literary and general texts. There are number of books, newspapers, magazines and internet material available to develop Sindhi text corpus but yet proper and useful text corpus could not be developed and presented online for research, language features analysis, linguistics analysis and information retrieval systems. The lack of resources for research on computational linguistics and NLP applications for Sindhi language are challenging tasks at this stage. However, we have developed Sindhi text corpora in order to provide text resources to computational linguists, Natural Languages process (NLP) experts and researchers. Online books, newspapers, magazines, blogs and social websites are utilized to build Sindhi text corpus. Sindhi sentiment based text corpus is developed and analyzed with Document Term Matrix and TF-IDF models using 2-gram technique of n-gram model. The corpus may be useful for research on language variation analysis, sentiment analysis, aspect based sentiment analysis, semantic analysis, machine translation, information retrieval, Word2Vec, topic modeling and cluster analysis."}]}]}]}}