{"pii": "S131915782100358X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "attachments"}, {"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st095"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp005", "view": "all"}, "$$": [{"#name": "__text__", "_": "The purpose of this paper is to verify the functional correctness of a specific process mining algorithm and to validate the requirement satisfaction of the targeted algorithm, as well. The functional requirement of the process mining algorithm is to discover all the structural process patterns, such as linear (sequential), disjunctive (selective-OR), conjunctive (parallel-AND), and repetitive (iterative-LOOP) process patterns, from a dataset of process enactment event logs, and to eventually build a structured business process model by assembling all the discovered structural process patterns. The targeted algorithm to be verified and validated in this paper is called as "}, {"#name": "math", "$": {"xmlns:mml": true, "altimg": "si20.svg"}, "$$": [{"#name": "mrow", "$$": [{"#name": "mi", "_": "ρ"}]}]}, {"#name": "__text__", "_": "-"}, {"#name": "italic", "_": "Algorithm"}, {"#name": "__text__", "_": " that is especially devised for discovering a structured information control net process model (SICN-oriented process model) from a dataset especially prepared in the standardized IEEE XES event stream format. In order to carry out the verification and validation, we have successfully developed a process mining system based upon the "}, {"#name": "math", "$": {"xmlns:mml": true, "altimg": "si21.svg"}, "$$": [{"#name": "mrow", "$$": [{"#name": "mi", "_": "ρ"}]}]}, {"#name": "__text__", "_": "-"}, {"#name": "italic", "_": "Algorithm"}, {"#name": "__text__", "_": ", and through which four rounds of experiments are taken with four real datasets that are well fitted into the following situational mining and discovering scenarios: Faultlessness Process, Matched-Pairing Violation but Sound Process, Matched-Pairing and Proper-Nesting Violation but Sound Process, and Nebulous Process (Adaptive Cases). Conclusively, we strongly believe that the "}, {"#name": "math", "$": {"xmlns:mml": true, "altimg": "si22.svg"}, "$$": [{"#name": "mrow", "$$": [{"#name": "mi", "_": "ρ"}]}]}, {"#name": "__text__", "_": "-"}, {"#name": "italic", "_": "Algorithm"}, {"#name": "__text__", "_": " is theoretically safe as well as functionally operable, and that the implemented "}, {"#name": "math", "$": {"xmlns:mml": true, "altimg": "si23.svg"}, "$$": [{"#name": "mrow", "$$": [{"#name": "mi", "_": "ρ"}]}]}, {"#name": "__text__", "_": "-"}, {"#name": "italic", "_": "Algorithm"}, {"#name": "__text__", "_": " is also practically applicable to a process mining system as one of the business process and workflow intelligence solutions."}]}]}]}]}}