{"pii": "S1319157823001714", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The ubiquitous and layout-friendly PDF documents have multiple elements for disseminating knowledge and require visual cues for interpretation. Users with visual impairments depend on assistive technologies that do not offer comprehensive information about non-textual elements such as tables. This emphasizes the importance of making PDF documents and their tables accessible to everyone. Hence, this study proposes to unveil the hidden semantics of PDF tables to blind and visually inspired people for a comprehensive understanding. Therefore, a heuristic approach is used to extract the explicit and implicit features including metadata, functional, structural, content, and contextual information. The extracted features are utilized to provide insights into the PDF table to the intended users by providing a lay summary before navigating the rows and columns. The proposed solution is evaluated quantitatively for the visual features of a table including captions, headers, and structures, and obtained encouraging results using precision, recall, and F-score. Additionally, qualitative evaluation is conducted by domain experts to assess the functionalities of the developed prototype against the developed heuristics and the adherence to standard accessibility guidelines of Web Content Accessibility Guidelines (WCAG 2.1) and ICT accessibility section 508. The extracted features can be utilized in various downstream applications, such as table classification, integration, searching, recommendation, and gerontechnology. By providing insights into PDF tables, this research serves as a starting point to improve accessibility for blind or visually impaired people."}]}]}]}}