{"pii": "S1319157823002495", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st195"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp005", "view": "all"}, "$$": [{"#name": "__text__", "_": "Since the early 1980s, the legal domain has shown a growing interest in Artificial Intelligence approaches to tackle the increasing number of cases worldwide. TaSbeeb is a deep learning (DL)-based judicial decision support system (JDSS) designed for legal professionals in Saudi courts by retrieving judicial reasoning, Qur’anic verses, and hadiths from a knowledge base. The proposed system consists of three phases: annotation, classification, and information retrieval. To annotate judicial text, we developed Ann-Judicial, a semi-automatic method. To handle the imbalanced corpus for classification, we devised homogeneous and heterogeneous stacking DL models. For information retrieval, we proposed Jud_RoBERTa, a judicial language model. TaSbeeb achieved high accuracy and "}, {"#name": "italic", "_": "F"}, {"#name": "__text__", "_": "-scores in both the classification and information retrieval blocks, showing good accuracy despite complexities in the judicial field and interference between cases. Specifically, the classification phase achieved an accuracy and "}, {"#name": "italic", "_": "F"}, {"#name": "__text__", "_": "-score of 95.8%, while the information retrieval phase achieved an accuracy of 79.8% and "}, {"#name": "italic", "_": "F"}, {"#name": "__text__", "_": "-score of 79.3%. The proposed JDSS has potential for extension to other courts and can be used in judicial inspection. TaSbeeb represents a significant stride towards a more efficient and accurate judicial decision-making process in the Arabic legal system, which has been hindered by a lack of research on Arabic JDSS."}]}]}]}]}}