{"pii": "S1319157824001241", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1587", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1588"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1590", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1591", "view": "all"}, "_": "Aspect-Based Sentiment Analysis (ABSA) aims to identify the sentiment expressed towards a specific feature or aspect of a given text. Although certain ABSA techniques employ syntactic information to capture the connection between the opinion target and the sentiment word, they often do not incorporate data processing techniques such as dependency parsing, which can be beneficial in accurately capturing the sentiment expressed towards the opinion target. In this paper a method for ABSA that employs both syntax and semantic information and incorporates dependency parsing(Semantic-Syntactic Dependency Parsing (SSDP) Method) with Core Natural Language Processing (CoreNLP) which is a natural language processing library for processing the input text and identifying patterns effectively (according to the CoreNLP relations and part of speech tagging(POS)) to extract the critical relations that accurately reflect the sentiment conveyed regarding the opinion target is proposed. The results show that the proposed pattern captured approximately 75% of the data, and the rest were classified via Long Short-Term Memory (LSTM) based on semantic information. We illustrated the efficacy of SSDP, through experiments on the SemEval14,Semval15 and Semval16 datasets, which include two datasets (laptops and restaurants) carefully categorized by a human annotator into categories of positive, negative, or neutral attitudes. The experimental results reveal that SSDP is superior to the other state-of-the-art ABSA approaches, that use syntax information but do not utilize data processing techniques. Additionally, we highlight the limitations of ABSA methods that do not incorporate syntax information and the potential improvements that can be made through the use of data processing."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1593", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1594"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1596", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1597", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1599"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1600"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1603", "view": "all"}, "_": "The ABSA method leverages syntax, semantics, and CoreNLP’s parsing to gauge aspect sentiment."}]}, {"#name": "list-item", "$": {"id": "d1e1605"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1608", "view": "all"}, "_": "Captures the aspect polarity by identifying patterns and extracting critical relations."}]}, {"#name": "list-item", "$": {"id": "d1e1610"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1613", "view": "all"}, "_": "The method outperforms ABSA approaches using syntax without data processing techniques."}]}]}]}]}]}]}}