{"pii": "S1344622324001081", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "There is scant awareness of the identifying information that may be lost during an autopsy."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "A quantification attempt, after a comparison of the autopsy and anthropological examination findings of 29 skeletons, has been made in this study."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Three significant cases are presented."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The limitations of instrumental investigations and the importance of exhumation of unknown skeletal remains for identification purposes are discussed."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "The process of personal identification differs according to the state of preservation of the corpse, becoming more complicated when dealing with remains altered by taphonomic variables. Since 2015, the staff of the Laboratory of Forensic Anthropology and Odontology (LABANOF) of the University of Milan has been engaged in recovering the skeletons of 36 unknown people from the cemeteries of the city of Milan, to redraw their biological profiles and give them back the possibility of being identified. Of the 36 starting skeletons, 7 have been identified and therefore are not the object of this study, 25 individuals were previously subjected to an autopsy examination and 4 skeletons were studied for the first time in the present work. The post-mortem data of all the individuals who had previously undergone autopsy and had not yet been identified (n = 25) have been retrieved from the archives of the Institute of Forensic Medicine in Milan and allowed for a comparison with those obtained from the new anthropological study of each exhumed skeleton. The authors aim to present the three most interesting cases to better highlight the results that emerged from the comparison. The autopsy information alone lacked important details. In all cases, the anthropological examination proved to be capable of detailing the biological profile of the unknowns even after a long period of inhumation (even more than 20 years). The limitations of instrumental investigations in achieving the goal single-handedly and the importance of recovering the unknown skeletons from cemeteries for identification purposes are discussed."}]}]}]}}