{"pii": "S1359644612004011", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "graphical", "id": "aep-abstract-id15"}, "$$": [{"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id16"}, "$$": [{"#name": "section-title", "_": "Highlights"}, {"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "_": "► Review of data integration in the life sciences with emphasis on semantic web. ► Concept of a Virtual Knowledge Broker (VKB) is applied to the life sciences. ► Semantic Enrichment of the Scientific Literature (SESL) demonstrator is an exemplar. ► Successful integration of data from numerous structured and unstructured sources. ► The Pistoia Alliance precompetitive consortium delivered the pilot demonstrator."}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "aep-abstract-id17"}, "$$": [{"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id18"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0010", "view": "all"}, "_": "Research in the life sciences requires ready access to primary data, derived information and relevant knowledge from a multitude of sources. Integration and interoperability of such resources are crucial for sharing content across research domains relevant to the life sciences. In this article we present a perspective review of data integration with emphasis on a semantics driven approach to data integration that pushes content into a shared infrastructure, reduces data redundancy and clarifies any inconsistencies. This enables much improved access to life science data from numerous primary sources. The Semantic Enrichment of the Scientific Literature (SESL) pilot project demonstrates feasibility for using already available open semantic web standards and technologies to integrate public and proprietary data resources, which span structured and unstructured content. This has been accomplished through a precompetitive consortium, which provides a cost effective approach for numerous stakeholders to work together to solve common problems."}]}]}]}}