{"pii": "S1350630723001917", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e3196", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e3197"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e3199", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e3200", "view": "all"}, "_": "The challenge of the research work presented in the paper is to combine the growing interest in monitoring the health condition of existing bridge heritage through systematic and periodic visual inspections with automated recognition of typical bridge defects, which can greatly facilitate the assessment of defect evolution over time. The study focused on the automated identification of defects in existing Reinforced Concrete (RC) bridges exploiting different Deep Learning (DL) approaches and techniques to interpret the obtained predictions. Ensuring the safety of infrastructures is typically a technical and economic issue. Still, in the case of the engineering infrastructure heritage, there are existing bridges and viaducts with a high historical, cultural, and symbolic value. For them, accurate knowledge and characterization of possible degradation processes become particularly important in order to define intervention strategies that combine safety and conservation requirements. With the aim to develop systematic and non-invasive investigation protocols for continuous and effective control of defects and their evolution, a database of existing RC bridge defect images was collected, and the most recurrent defect typologies were classified by domain experts. Some existing Convolutional Neural Networks (CNNs) algorithms were applied to the dataset for automatically recognizing all defects, but the specific novel contribution of the research work is the interpretation of the obtained results in a form that is humanly explainable and directly implementable in new tools for bridge inspections. To interpret the results, Class Activation Maps (CAMs) approaches were employed within available eXplainable Artificial Intelligence (XAI) techniques, which allow to observe the activation zones and nearly perfectly highlight the type of specific defect in a given image. The obtained results, besides suggesting which network works better than others and if the specific defect is effectively recognized, have been evaluated through a quasi-quantitative procedure that compared a qualitative assessment of the CNNs models reliability with two novel indexes representing new explaining metrics of the obtained results. In the end, the outcomes of the proposed study were observed also in a real-life case study. The proposed discussion opens new scenarios in the application of these techniques for supporting road management companies and public organizations in the evaluation of the road networks health state."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e3204", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e3205"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e3207", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e3208", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e3210"}, "$$": [{"#name": "list-item", "$": {"id": "d1e3211"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e3214", "view": "all"}, "_": "Application of AI-based techniques for Risk management of existing Bridge Heritage."}]}, {"#name": "list-item", "$": {"id": "d1e3216"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e3219", "view": "all"}, "_": "Eight existing CNN models were used to automatically identify all defects."}]}, {"#name": "list-item", "$": {"id": "d1e3221"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e3224", "view": "all"}, "_": "Two Class Activation Maps approaches were used to visually explain obtained results."}]}, {"#name": "list-item", "$": {"id": "d1e3226"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e3229", "view": "all"}, "_": "A quasi-quantitative interpretation of results was provided through two novel indexes."}]}, {"#name": "list-item", "$": {"id": "d1e3231"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e3234", "view": "all"}, "_": "The methodology was tested on a real existing RC bridge, characterized by heritage value."}]}]}]}]}]}]}}