{"pii": "S1364661320300565", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0040", "view": "all"}, "_": "Human action control relies on representations that integrate perception and action, but the relevant research is scattered over various experimental paradigms and the theorizing is overly paradigm-specific. To overcome this obstacle we propose BRAC (binding and retrieval in action control), an overarching, integrative framework that accounts for a wide range of seemingly unrelated findings by assuming ‘two core processes: feature binding and retrieval’. In contrast to previous approaches, we define binding and retrieval as functionally different and separable processes that independently contribute to the observed effects. Furthermore, both processes are independently modulated by top-down and/or bottom-up processes. BRAC organizes the literature on action control in novel ways, and relates diverse independently investigated action-related phenomena from different research fields to each other."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0045", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "para", "$": {"id": "p0075", "view": "all"}, "_": "We introduce the BRAC framework. The framework is tailored to the sequential structure of action-control tasks and thus can integrate the vast paradigm-specific literature on action control."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "para", "$": {"id": "p0080", "view": "all"}, "_": "BRAC is based on two core processes: feature binding and retrieval. We present evidence that these processes operate independently of each other and are separately modulated by top-down and bottom-up influences."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "para", "$": {"id": "p0085", "view": "all"}, "_": "BRAC emphasizes the need to disentangle the processing level from the level of observation. Previously published results in action control should be re-evaluated against the framework because previous research did not separately modulate the two core processes."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "para", "$": {"id": "p0090", "view": "all"}, "_": "BRAC provides a framework for discussing action-related phenomena beyond the research area of action control, including attention, memory and learning, and motivation."}]}]}]}]}]}]}}