{"pii": "S1367578824000038", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e403", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e404"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e406", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e407", "view": "all"}, "_": "In the digital transformation era, and particularly in Industry 5.0, humans play an active role in industrial cyber–physical systems (CPS) since they are the most flexible piece in such automated systems. However, their integration is not easy and constitutes a relevant challenge, presenting different requirements according to the activities they execute and the related integration levels, i.e., Human-in-the-Loop (HitL) and Human-in-the-Mesh (HitM). Besides the use of human-centric design approaches, the use of digital technologies, namely Internet of Things, Artificial Intelligence, virtual and augmented reality and collaborative robotics, can contribute to empower humans to perform their operations in a faster and more efficient manner. This paper discusses how emergent digital technologies can enhance a more symbiotic integration of humans in industrial CPS, contributing with the analysis of different aspects and concerns that must be considered to properly enable the HitL and HitM integration levels in CPS. Four experimental case studies are presented to demonstrate the feasibility of using digital technologies to enhance the human-CPS integration, covering HitL and HitM levels. Furthermore, some challenges related to the human-integration factors affected by the digital technologies in such environments are briefly discussed and pointed out as research directions."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e409", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e410"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e412", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e413", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e415"}, "$$": [{"#name": "list-item", "$": {"id": "d1e416"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e419", "view": "all"}, "_": "Discuss how digital technologies can contribute to integrating humans in industrial cyber–physical systems in the context of Industry 5.0."}]}, {"#name": "list-item", "$": {"id": "d1e421"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e424", "view": "all"}, "_": "Four experimental examples demonstrate the feasibility of using digital technologies to empower human activities."}]}, {"#name": "list-item", "$": {"id": "d1e426"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e429", "view": "all"}, "_": "Discussion of the challenges for adopting digital technologies to enhance the human-CPS integration."}]}]}]}]}]}]}}