{"pii": "S1364032115009909", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0080", "view": "all"}, "_": "Integration of Distributed Renewable Generation (DRG) to the future Smart Grid (SG) is one of the important considerations that is highly prioritized in the SG development roadmap by most of the countries including Malaysia. The plausible way of this integration is the enhancement of information and bidirectional communication infrastructure for energy monitoring and controlling facilities. However, urgency of data delivery through maintaining critical time condition is not crucial in these facilities. In this paper, we have surveyed state-of-the-art protocols for different Wireless Sensor Networks (WSNs) with the aim of realizing communication infrastructure for DRG in Malaysia. Based on the analytical results from surveys, data communication for DRG should be efficient, flexible, reliable, cost effective, and secured. To meet this achievement, IEEE802.15.4 supported ZigBee PRO protocol together with sensors and embedded system is shown as Wireless Sensor (WS) for DRG bidirectional network with prospect of attaining data monitoring facilities. The prospect towards utilizing ZigBee PRO protocol can be a cost effective option for full integration of intelligent DRG and small scale Building-Integrated Photovoltaic (BIPV)/Feed-in-Tariff (FiT) under SG roadmap (Phase4: 2016–2017) conducted by Malaysia national utility company, Tenaga Nasional Berhad (TNB). Moreover, we have provided a direction to utilize the effectiveness of ZigBee-WS network with the existing optical communication backbone for data importing from the end DRG site to the TNB control center. A comparative study is carried out among developing countries on recent trends of SG progress which reveals that some common projects like smart metering and DRG integration are on priority."}]}]}]}}