{"pii": "S1364032121008467", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Meeting the energy goals of the European Union requires new ways of managing energy. Decentralized energy management, cross-commodity energy production and usage optimization are promising means. Future neighbourhoods will include multiple forms of energy such as electricity, heat, and cooling. According to our vision, the smart neighbourhoods, can optimize energy across different vectors by sharing resources in a controlled way."}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "The first contribution of this paper is a comprehensive review on market, regulatory and technological status to support the transition towards distributed cross-commodity energy management with focus on Germany and Finland. Markets disruption could lead to more decentralized structures. Mechanisms therefore have been proposed, but mostly without sector integration."}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "Clean Energy Package includes legislation that is supportive towards cross-commodity energy sharing solutions. Corresponding implementation in Germany and Finland may be successful in both countries even though it differs."}, {"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "Regarding technology, the article identifies required technical components (IoT, AI and blockchain) focusing on their support decentralized and cross-sector energy systems. Key components of IoT are wireless communication and interoperability middleware. AI provides key technologies for modelling and optimization of sector-integrated and distributed energy systems. Even if there has been lots of research, practical implementations are still lacking. Furthermore, many technical challenges still exist for blockchain based solutions in decentralized energy systems. Moreover, organizational, and legal responsibilities need to be clarified to support the adoption of blockchains in decentralized energy systems. Finally, the article gives recommendations regarding an increasing implementation of cross-commodity sharing and how it can contribute to the energy transition."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0030", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Giving an overview of cross-commodity energy sharing in Finland and Germany."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "It is shown how recent energy market development support energy transition."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Comparing the regulatory framework for smart components in energy markets."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Combination of IoT, AI and Blockchain to enable decentralized energy markets."}]}]}]}]}]}]}}