{"pii": "S1364815223002475", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e427", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e428"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e430", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e431", "view": "all"}, "_": "This work focuses on developing a software system for concurrently analyzing co-located multibeam echo sounder (MBES) datasets and seafloor imagery, fulfilling the need for a unified seafloor data exploration and analysis platform. The system comprises a graphical user interface where image browsing and geospatial data are linked and several toolboxes for extracting backscatter distribution, its angular response, and bathymetric derivatives to ultimately build detailed quantitative reports. The overall objective is to provide an efficient means of understanding the relationships between morphology, backscatter, and the observed biota and, thus, understanding the relationship between the physical and ecological elements of the seafloor. In addition, Groundtruther provides new ways to interpret remotely sensed information derived from MBES and aid the development of spatial distribution models. Furthermore, it could lead to the enrichment of ground-truth databases used to develop formal geophysical models that link acoustic backscatter observations to intrinsic properties of the seafloor."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e433", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e434"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e436", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e437", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e439"}, "$$": [{"#name": "list-item", "$": {"id": "d1e440"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e443", "view": "all"}, "_": "A graphical user interface to link image browsing and geospatial data."}]}, {"#name": "list-item", "$": {"id": "d1e445"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e448", "view": "all"}, "_": "A set of toolboxes for extracting multibeam backscatter distribution and its angular response."}]}, {"#name": "list-item", "$": {"id": "d1e450"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e453", "view": "all"}, "_": "Compiling detailed and reproducible quantitative report to document seafloor characteristics."}]}, {"#name": "list-item", "$": {"id": "d1e455"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e458", "view": "all"}, "_": "Enrichment of ground-truth databases to link acoustic backscatter observation to intrinsic properties of the seafloor."}]}]}]}]}]}]}}