{"pii": "S1364032115007431", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0070", "view": "all"}, "_": "The UAE per capita energy consumption is one of the highest in the world. Since the energy sector is the center of most ecological problems facing the world today, eco-efficiency and eco-innovations are at the top of the sustainability agenda in most countries. The UAE “Green Economy for Sustainable Development” (2012–2021) aims to position the country as a center for the export and re-export of green products and technologies. In light of the above, the focus of this paper is to present a smart plug system for monitoring and controlling household energy consumption using a mobile application. The smart plug system is an essential component in smart grids as it provides real-time high-resolution information for distribution companies to aid them in decision-making. In addition, the study measures the perceived usefulness and satisfaction of the smart plug system and its mobile application in the UAE. The paper makes an important theoretical contribution by including environmental concern as an additional variable to a well-established information systems success model. Our findings suggest that the smart plug system provides users with convenient access to information regarding their personal energy consumption and allows them to control their per capital energy consumptions via the mobile application at very low costs. Further, we validated our theoretical model using structural equation modeling and conclude that environmental concern has an indirect impact on the perceived satisfaction and both an indirect and a direct impact on the perceived usefulness of the smart plug system. The practical implications of our study suggest that per capita energy consumption is likely to significantly decrease with wide adoption of the smart plug system in the UAE."}]}]}]}}