{"pii": "S1364815223002888", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Recent decades have witnessed a massive increase in the volume and quality of hydrologic data available to aid water resources decision makers, managers, and scientists. This has been accompanied by exponential growth in both desktop and cloud computing, as well as data storage capabilities. As a result, there are abundant opportunities to drastically change how water data is collected, managed, disseminated, and analyzed – which should ultimately have significant positive impacts on water science, engineering, and management. We are at the cusp of a new era in water data science which brings with it many exciting technological and scientific challenges and opportunities. Many of these challenges are alleviated and opportunities are multiplied when hydrology is viewed as a “team sport” rather than as an individual activity. These factors formed the motivation for the development of the HydroShare open-source software and the hydroshare.org operational system. This retrospective paper reviews a decade of HydroShare development and operation by presenting the general architecture, functionality, key contributions of the project to earth science and cyberinfrastructure research, current usage metrics, and future directions."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "We present a review of the design and development of HydroShare for publishing water data and models."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The design and current functionality of this open source and open access software system is presented."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "We review specific scientific and technical contributions of the project in both information science and modeling."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Current usage statistics and future directions of the system are discussed."}]}]}]}]}]}]}}