{"pii": "S1364032117308924", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0120", "view": "all"}, "_": "Urban microclimate studies are gaining popularity due to rapid urbanization. Many studies documented that urban microclimate can affect building energy performance, human morbidity and mortality and thermal comfort. Historically, urban microclimate studies were conducted with observational methods such as field measurements. In the last decades, with the advances in computational resources, numerical simulation approaches have become increasingly popular. Nowadays, especially simulations with Computational Fluid Dynamics (CFD) is frequently used to assess urban microclimate. CFD can resolve the transfer of heat and mass and their interaction with individual obstacles such as buildings. Considering the rapid increase in CFD studies of urban microclimate, this paper provides a review of research reported in journal publications on this topic till the end of 2015. The studies are categorized based on the following characteristics: morphology of the urban area (generic versus real) and methodology (with or without validation study). In addition, the studies are categorized by specifying the considered urban settings/locations, simulation equations and models, target parameters and keywords. This review documents the increasing popularity of the research area over the years. Based on the data obtained concerning the urban location, target parameters and keywords, the historical development of the studies is discussed and future perspectives are provided. According to the results, early CFD microclimate studies were conducted for model development and later studies considered CFD approach as a predictive methodology. Later, with the established simulation setups, research efforts shifted to case studies. Recently, an increasing amount of studies focus on urban scale adaptation measures. The review hints a possible change in this trend as the results from CFD simulations can be linked up with different aspects (e.g. economy) and with different scales (e.g. buildings), and thus, CFD can play an important role in transferring urban climate knowledge into engineering and design practice."}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0125", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "A total of 183 CFD studies on urban microclimate are investigated."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Yearly number of studies on the topic increased rapidly from 1998 till 2015."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Investigated cities, target parameters and keywords are summarized for every study."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Past achievements on the field are documented and future perspectives are provided."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "The keywords used in the reviewed studies are evaluated based on their popularity."}]}]}]}]}]}]}}