{"pii": "S1367578824000051", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e454", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e455"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e457", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e458", "view": "all"}, "_": "The use of wireless communication within the civil nuclear industry can bring many benefits over wired solutions, such as reducing lifecycle costs and enabling new applications in asset and process management. This paper will discuss aspects of wireless communication in industrial control systems, i.e. termed wireless control systems, of the civil nuclear industry. In this respect, we will review previous use of wireless communication in the nuclear industry, and provide the results of a recent feasibility study of wireless communication for an industrial, civil nuclear control system. The studied use case was of an advanced nuclear modular reactor, the Stable Salt Reactor (SSR), and the augmentation of one of its control systems, the refuelling control system, with wireless communication. Hence, in contrast to previous work on wireless control systems, this paper here will focus on the complex and rigorous processes required for regulated safety which have to be followed to allow for wireless control to be implemented in the nuclear civil sector. The following analysis and design procedure was followed: (a) the decision process for choosing the refuelling control system, (b) the review for a suitable communication protocol and technology, the analysis for placement of wireless transceivers for sensors and actuators, (c) the analysis for wireless communication integrity, (d) the basic analysis and guidelines for control system robustness under packet loss, (e) the discussion of possible self-powering options and (f) the safety analysis of the control system under communication failure. Our initial hypothesis is that wireless control systems in Nuclear Applications can improve asset integrity. Control systems can be made more robust and secure to external influences by securely communicating control responses and asset information within a Nuclear Plant. Safety is also improved by reducing the number of operator interactions required for servicing connections, as failures are reduced overall. The removal of power/data harnesses from in-reactor applications can enable faster deployment and replacement of instrumentation for new builds, existing plants and decommissioning."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e460", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e461"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e463", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e464", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e466"}, "$$": [{"#name": "list-item", "$": {"id": "d1e467"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e470", "view": "all"}, "_": "Review of wireless communication and its use in nuclear energy systems."}]}, {"#name": "list-item", "$": {"id": "d1e472"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e475", "view": "all"}, "_": "Non-critical systems are potential candidates for wireless-enabled control loops."}]}, {"#name": "list-item", "$": {"id": "d1e477"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e480", "view": "all"}, "_": "Wireless Networked Control System (WNCS) would first be used as system redundancy."}]}, {"#name": "list-item", "$": {"id": "d1e482"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e485", "view": "all"}, "_": "WNCS could provide channel failure alleviation to allow for constant operation."}]}, {"#name": "list-item", "$": {"id": "d1e487"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e490", "view": "all"}, "_": "WNCSs in the nuclear sector are aimed at improving reliability and reducing costs."}]}, {"#name": "list-item", "$": {"id": "d1e492"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e495", "view": "all"}, "_": "Initial safety analysis highlights technological and regulatory challenges remaining."}]}]}]}]}]}]}}