{"pii": "S1389128623002682", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara019", "view": "all"}, "_": "The Satellite-Terrestrial Integrated Networks (STINs) is considered as a reliable and agile next-generation communication network scheme, because it is flexible to deploy and robust to disasters (e.g., earthquakes, floods, and volcanic eruptions). The routing and resource allocation directly affect the power consumption of satellites in the STINs. However, most of existing research works study these two issues separately, and neglect the impact of path selection on the satellite power consumption. This paper investigates the joint optimization problem of routing, bandwidth allocation, user association, channel allocation, and power allocation of the STINs. We aim at minimizing satellites’ power consumption while satisfying user's Quality of Service (QoS). Because the power consumption of satellites for routing in the space segment is involved with the data rate through satellite gateways in the user segment, this optimization problem is a Multi-Objective Optimization (MOO) problem. To this end, we convert the MOO problem to a Single-Objective Optimization (SOO) problem by linear weighted method. Considering that the SOO problem is a Mixed Integer Nonlinear Programming (MINLP) problem, we decompose it into the resource allocation sub-problem in the user segment and the routing optimization sub-problem in the space segment. And we solve these two sub-problems iteratively. Specifically, we convert the first sub-problem into a convex optimization problem and obtain the current user association and channel allocation. Then we formulate the second sub-problem into a multi-commodity flow problem and solve it based on the obtained user association and channel allocation. The SOO problem is solved by iteratively optimizing these two sub-problems. Experimental results demonstrate that our proposed algorithm is able to get an approximate optimal solution quickly and effectively reduce the power consumption of satellites compared with benchmark algorithms in the STINs."}]}]}]}}