{"pii": "S1389128623006059", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e622", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e623"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e625", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e626", "view": "all"}, "_": "Wi-Fi 7, based on the IEEE 802.11be amendment, is designed to increase the maximum achievable throughput, expand the range of operating frequencies, and improve latency and jitter in worst-case scenario. In the context of the discussions to shape what Wi-Fi 8 will be, the IEEE 802.11 WG is evaluating multi-AP coordination as a strategy to further improve network performance in several aspects. MAC-driven multi-AP coordination strategies include coordinated Orthogonal Frequency Division Multiple Access (c-OFDMA), coordinated Time Division Multiple Access (c-TDMA), and coordinated Spatial Reuse (c-SR). In c-OFDMA, a set of APs transmit during a Transmission Opportunity on different channels, whereas in c-TDMA, the APs take turns transmitting on the same channel during a Transmission Opportunity. Instead, in c-SR, a set of APs transmit simultaneously on the same channel and during the same Transmission Opportunity."}, {"#name": "simple-para", "$": {"id": "d1e628", "view": "all"}, "_": "In this paper, we focus on c-SR. We introduce a c-SR interference model and present a strategy based on the proposed model for estimating groups of APs that can transmit successfully simultaneously. We implemented the proposed approach in the multi-AP coordination framework of ns-3 that we developed to analyze c-TDMA. We then thoroughly evaluate the performance of the proposed c-SR scheme via ns-3 simulations. The proposed scheme allows increasing the system throughput of a dense deployment up to 2.3 times as well as substantially reducing the Head of Line delay."}]}]}]}}