{"pii": "S1389128623000087", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e752", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e753"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e755", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e756", "view": "all"}, "_": "Mobile edge computing emerges as a new paradigm to provide low-latency network services in the close proximity to users. Based on the network function virtualization (NFV) technology, network services can be flexibly provisioned as service function chain (SFC) deployed at edge servers. In some scenarios, such as the vehicular or UAV-assisted edge computing, the network topology varies rapidly due to the mobile edge servers, which changes the routing path between adjacent VNFs in an SFC. Migrating SFC to adapt to the frequent topology change can reduce the SFC latency, and improve the quality of users’ experience. However, frequent SFC migration will unavoidably increase the operation cost. In this paper, to optimize the system performance in a cost-efficient manner, we study the SFC migration problem in dynamic networks with a long-term cost budget constraint. We then propose the Topology-aware Min-latency SFC Migration (TMSM) method to strike a desirable balance between the SFC latency and the migration cost. Specifically, we first apply the Lyapunov optimization to decompose the long-term optimization problem into a series of real-time optimization sub-problems. Since the decomposed problem is still NP-hard, a Markov approximation based heuristic is proposed to seek a near-optimal solution for each sub-problem. Compared with the rerouting-only strategy, which does not migrate any VNF, our TMSM reduces the latency by at least 21% on average in each time slot. Extensive evaluations show that the proposed algorithm achieves a better tradeoff between the SFC latency and migration cost than the baselines."}]}]}]}}