{"pii": "S1389128624005978", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e737", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e738"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e740", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e741", "view": "all"}, "$$": [{"#name": "__text__", "_": "The advent of Wi-Fi in the 1990s stimulated the creation of Community networks (CNs), a new networking paradigm deployed and maintained by their users. The non-profit and grassroots self-organization of CNs has shown significant potential in enhancing communication technologies grounded in ethical values, transcending mere Internet expansion to contribute to broader social impacts. Since its conception, hundreds of CNs have been deployed worldwide. However, many have faltered, primarily due to a lack of solid economic models and legal setup. This paper presents "}, {"#name": "italic", "_": "Expansió Xarxa Oberta (eXO)"}, {"#name": "__text__", "_": " association, a commons Internet Service Provider (ISP). In contrast to commercial ISPs, eXO follows the same grassroots principles of CNs. Establishing a commons-based ISP is challenging, yet it is a key component for the sustainability and success of CNs. Therefore, our paper aims to dissect the complexity of a commons ISP by explaining eXO, a pioneering example that has already been in production for more than 14 years. To the best of our knowledge, this is the first time that a commons ISP is described in all its components."}]}, {"#name": "simple-para", "$": {"id": "d1e746", "view": "all"}, "_": "To describe eXO, we have proceeded in two parts. In the first one, we delineate the organizational structure, economics, funding mechanisms, activities, legal framework, and infrastructure. To gain more insight on eXO, in the second part, we conduct a technical analysis of traffic data collected from eXO’s core router, elucidating subscriber usage patterns. Our study encompasses various subscriber categories, including regular and financially subsidized users, Wi-Fi and optical fiber access, and traffic characteristics such as volume, TCP/UDP usage, services accessed, and traffic distribution across countries."}]}]}]}}