{"pii": "S1389128623001652", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e921", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e922"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e924", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e925", "view": "all"}, "_": "Innovative services with strict requirements are expected in the fifth generation (5G) of mobile networks and beyond. For example, the Ultra-Reliable Low-Latency Communication (URLLC) requires up to 1 ms latency, end-to-end security, and reliability of up to 99.999%. The Multi-access Edge Computing (MEC) promises to support the delivery of URLLC services by providing computing and storage resources in the proximity of user equipment. The data which previously needed to be processed and stored in the cloud systems can be kept at the edge network, decreasing the total latency and increasing the context-awareness, security, and dependability. Vastly available resources, which are available from cloud to edge, must be appropriately allocated to deliver a service efficiently. The resource allocation problem in MEC for 5G-and-beyond networks can be formulated differently, depending on the nature of the problem. This survey outlines the resource allocation problem as a proper problem formulation, which can be addressed by target, resource type, resource issue, and the considered assumptions. Moreover, this paper also describes the open issues and future directions for MEC resource allocation based on the state of the art on this research topic."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e927", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e928"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e930", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e931", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e933"}, "$$": [{"#name": "list-item", "$": {"id": "d1e934"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e937", "view": "all"}, "_": "New 5G MEC resource allocation problems classified based on problem nature: target, resource type, issue, assumptions. Characterization not only based on existing works but also presents future opportunities."}]}, {"#name": "list-item", "$": {"id": "d1e939"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e942", "view": "all"}, "_": "Proposes a method classification for MEC resource allocation. Categorized by solved resource issues."}]}, {"#name": "list-item", "$": {"id": "d1e944"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e947", "view": "all"}, "_": "The paper summarizes the main findings for each problem category (e.g., target, resource type, resource issue, assumption) and the corresponding methods, and relates them to future research opportunities and open issues."}]}, {"#name": "list-item", "$": {"id": "d1e949"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e952", "view": "all"}, "_": "This is the first study on 5G-MEC resource allocation that discusses the state-of-the-art and future challenges for URLLC services in 5G and 6G."}]}]}]}]}]}]}}