{"pii": "S1389128623002992", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e518", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e519"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e521", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e522", "view": "all"}, "_": "Recently, the use of unmanned aerial vehicles (UAVs) for wireless communications has attracted much research attention. However, most applications of UAVs for wireless communication provisioning are not feasible as researchers fail to consider some vital aspects of their deployment, especially the energy requirements of both the UAV and communication system. The considerable energy consumption overhead involved in flying or hovering UAVs makes them less appealing for green wireless communications. Therefore, in this work, we examine the feasibility of an alternative energy-efficient deployment scheme where UAVs can be made to land-on designated locations, also known as landing stations (LSs). The idea of LS makes the UAV-based wireless communication more durable and advantageous, since the total energy consumption is reduced by minimizing the flying/hovering energy consumption, which, in turn, enables diverse set of applications including emergency and pop-up networking. We evaluate the impact of the separation distance between these LSs and the Optimal Hovering Position (OHP) on the network performance. Specifically, we develop mathematical frameworks to model the relationship between UAV power consumption, coverage probability, throughput, and separation distance. Numerical results reveal that a significant energy reduction can be achieved when the LS concept is exploited with a slight compromise in coverage probability and throughput. However, the choice of a suitable LS location depends on the users’ service requirements, transmit power, and frequency band utilized."}]}]}]}}