{"pii": "S1385894724093902", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Wearable electronics are driving interest in highly sensitive, flexible, and stretchable gas sensors."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Significant advancements in wearable gas sensors for on-body, within-clothing, and accessory applications."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Highly selective and rapid gas detection performance with low power consumption for diverse application."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Future research focuses on sensor miniaturization, enhanced wearable integration, and advanced data processing techniques."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Increasing concerns about public safety and quality of life have made maintaining optimal air quality, both indoors and outdoors, critically important. Detecting toxic gaseous compounds is vital for a sustainable future. With the rise of the Internet of Things (IoT), wearable technologies are becoming integral to daily life, spurring interest in developing highly sensitive, flexible, and stretchable electronic gas sensors. This review highlights the use of advanced nanomaterials such as graphene, metal oxides, carbon nanotubes, and conducting polymers, which enhance sensor performance. It explores the integration of these sensors into wearable textiles and direct body applications, which are crucial for advancing wearable gas sensing technology. The review also examines the progression of wearable substrates, sensing materials, electrodes, and sensor types, addressing key challenges like improving sensitivity, selectivity, stability, and power efficiency. The advancements in these areas lead to discussions on their applications in diverse fields, including environmental monitoring, human health diagnostics, food quality assessment, and public safety monitoring, showcasing the broad potential of wearable gas sensors. The conclusion offers insights and recommendations for the future development of intelligent wearable nanosensors, emphasizing the need to overcome current challenges and continue research to enhance integration, miniaturization, and functionality for societal benefits."}]}]}]}}