{"pii": "S1389128622003553", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "attachments"}, {"#name": "abstract", "$": {"class": "author", "id": "d1e1995", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1996"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1998", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1999", "view": "all"}, "$$": [{"#name": "__text__", "_": "Next-generation cellular networks, i.e., beyond fifth generation (B5G) and sixth generation (6G) networks, aim at significantly increasing capacity by deploying a massive number of small cells (SCs) and leveraging millimeter wave (mmWave) links that have large bandwidth availability. However, as optical connections to a large number of base stations (BSs) are not cost effective, wireless backhaul (BH) links may be used to connect SCs to the core network using mmWave frequencies and forming multihop mesh BH paths. While very flexible in deployment, the uncertainty in user demand, which varies over time and place, makes network planning and management challenging. In this work, we propose novel algorithms to solve the joint problem of energy-efficient user association, BH traffic routing and BS/BH link on/off switching. We first formulate an exact model assuming user traffic demand uncertainty leveraging "}, {"#name": "math", "$": {"xmlns:mml": true, "altimg": "si228.svg", "display": "inline", "id": "d1e2002"}, "$$": [{"#name": "mi", "_": "Γ"}]}, {"#name": "__text__", "_": "-robustness theory. As the model is intractable for large-scale instances, we develop a novel greedy robust heuristic (P-HEUR), which includes a robustifying step to effectively cope with demand uncertainty. Our evaluation demonstrates that P-HEUR provides robust and energy-efficient solutions quickly for different scenarios and traffic demand uncertainty levels, and it significantly outperforms state-of-the-art approaches while achieving up to 83% of the optimal capacity, even in the most demanding scenarios in terms of traffic load and demand uncertainty, with up to 200k times lower complexity."}]}]}]}]}}