{"pii": "S1440244023000701", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab0005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Objectives"}, {"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The physical demands of military service place soldiers at risk of musculoskeletal injuries and are major concerns for military capability. This paper outlines the development new training technologies to prevent and manage these injuries."}]}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st2015"}, "_": "Design"}, {"#name": "simple-para", "$": {"id": "sp5010", "view": "all"}, "_": "Narrative review."}]}, {"#name": "abstract-sec", "$": {"id": "as0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st5020"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "sp0015", "view": "all"}, "_": "Technologies suitable for integration into next-generation training devices were examined. We considered the capability of technologies to target tissue level mechanics, provide appropriate real-time feedback, and their useability in-the-field."}]}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st5025"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "sp0020", "view": "all"}, "_": "Musculoskeletal tissues' health depends on their functional mechanical environment experienced in military activities, training and rehabilitation. These environments result from the interactions between tissue motion, loading, biology, and morphology. Maintaining health of and/or repairing joint tissues requires targeting the “ideal” in vivo tissue mechanics (i.e., loading and strain), which may be enabled by real-time biofeedback. Recent research has shown that these biofeedback technologies are possible by integrating a patient's personalised digital twin and wireless wearable devices. Personalised digital twins are personalised neuromusculoskeletal rigid body and finite element models that work in real-time by code optimisation and artificial intelligence. Model personalisation is crucial in obtaining physically and physiologically valid predictions."}]}, {"#name": "abstract-sec", "$": {"id": "as0025", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0030"}, "_": "Conclusions"}, {"#name": "simple-para", "$": {"id": "sp0025", "view": "all"}, "_": "Recent work has shown that laboratory-quality biomechanical measurements and modelling can be performed outside the laboratory with a small number of wearable sensors or computer vision methods. The next stage is to combine these technologies into well-designed easy to use products."}]}]}]}}