{"pii": "S1462901123001661", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0040", "view": "all"}, "_": "Transdisciplinary research requires improved knowledge exchange between science and practice. Such improvements include diversifying and scaling up knowledge accessing and sharing through online platforms. We conducted twenty interviews informed by behavioral science methods to clarify the aim, components, and participants' perspectives on the usefulness of the proposed components for an envisioned platform. Participants were members of a Dutch community of practice for river studies and a research programme into integrated and collaborative management. The proposed concept included storylines, data repositories, user profiles, interactive visualisations, and collaborative sessions. Interview results include drivers and barriers from prospective users that we translated into requirements to increase the potential adoption and effective use of online platforms with similar components. From the experiences with implementing these requirements, we provide recommendations for enabling primary drivers: (i) Combining online and offline interactions to provide various options for knowledge exchange between disciplines and organisations. (ii) Sharing the content and application of the research with a non-scientific audience. (iii) Reusing existing online platforms as much as possible without restricting any to improve the reuse of research methods and results. We further provide recommendations to overcome the main barriers: (i) Partnering with various communities to extend knowledge exchange. (ii) Following a participatory approach to improve the design and content while considering the time and resources that such a process entails. (iii) Providing flexible options to contribute and tailor overviews of available knowledge in different ways according to prospective users' roles in practice. (iv) Purposefully facilitating online interactions according to the transdisciplinary process-intended attributes."}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0045", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Accessibility, reusability, and applicability positively influence usage intentions."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "The main barriers relate to the platforms' management, content, and design."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Improved knowledge exchange requires access and sharing beyond a single platform."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Tailored overviews of available knowledge can improve accessibility for non-scientific audiences."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Effective knowledge exchange requires purposeful online and face-to-face interaction."}]}]}]}]}]}]}}