{"pii": "S1470160X24005508", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Assessment and routing for karst basin areas to promote karst area development."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Extend the indicators of landscape visual quality, ecology, traffic and resource point assessment to the scenic route alignment planning."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Constructing a minimum cumulative resistance model for alignment planning in karst areas."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Linkagemapper tool is applied to scenic byway routing planning."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "A study of scenic byways, a new form of integrated tourism and transport developing in karst areas, is of great significance for promoting the rational use of landscape resources and sustainable development in karst areas. The rocky karst desertification area of Yunnan-Guangxi-Guizhou in the Nanpan–Beipan River Basin was taken as an example. Here, 16 factors in four dimensions of landscape visual quality, ecological suitability, transport convenience, and accessibility to resource points were selected to construct the evaluation index system of scenic byway routing. Next, a comprehensive resistance surface model was constructed based on the minimum cumulative resistance, which was then combined with the source location to simulate the optimal path and plan route selection for a scenic byway. The study shows that: (1) influenced by topography, traffic network, and resource points, the spatial distribution pattern of resistance in the Nanpan–Beipan River Basin was “low in the middle and high in the surrounding areas;” the low resistance area was mainly distributed in the central part of the watershed around the first-class scenic spots and the traffic network, while the high resistance area was distributed in the southeastern and northwestern parts of the watershed; (2) a total of 494 ecotourism corridors were generated with 273 attractions as the ecological sources, generally showing a distribution pattern of “high in the middle and low in the surrounding areas. Among them, 44 key ecological corridors were centered on valleys, 196 important ecological corridors were centered on water areas with good habitat quality, and 254 general ecological corridors were mainly important landscape types such as woodland, grassland, wetland, etc. and (3) the Karst Scenic Byway constructed in the Nanpan and Beipan River Basins as a whole formed a ring-shaped network, which was divided into the Karst Landscape Ethnic Scenic Byway and the Karst Summer Resort Three-Line Cultural Scenic Byway. This study provides a reference for the planning and construction of the Karst Mountain Scenic Byway in China."}]}]}]}}