{"pii": "S1474034624002301", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "Selecting an appropriate data persistent system for a specific use case necessitates a thorough examination of the application domain and the characteristics of the data expected to be stored. While comparative studies of data persistent systems exist in various domains, there is a notable absence of such studies concerning building and environmental data management. This research aims to bridge this gap by conducting a comparative evaluation based on building and environmental datasets and use cases. The study primarily focuses on two types of database systems, namely relational database systems and graph-based database systems. Two building and two city models are employed in the evaluation. The building data sets are extracted from IFC models, and environmental data are extracted from CityGML and OpenStreetMap. The assessment involves qualitatively analysing the database design process of the systems and quantitatively evaluating the efficiency of retrieving data from those systems. The comparative evaluation identifies at least two crucial aspects to consider when selecting a suitable data-persistent system for managing building and environmental data. The first aspect pertains to the stability of the data to be stored, along with the complexity of interrelationships within the building and environmental dataset. The second aspect involves the manner in which data is retrieved to accomplish different tasks within the particular business case. The findings demonstrate that use cases that typically manage interrelated data and necessitate the traversal of complex relationships between building and environmental features are better managed by graph-based database systems, particularly when dealing with large datasets. Conversely, relational databases exhibit superior performance for use cases requiring minimal or no relationship traversal, regardless of dataset size. The contributions of this study can serve as valuable input when designing information management tools and systems for building and environmental data management."}]}]}]}}