{"pii": "S1474034624003008", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "An augmented reality-based 5G enabled real-time structural health monitoring system is proposed."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Two use cases were conducted, one on a reinforced beam in a lab setting and another on a full-scale city bridge."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The proposed methodology enables remote collaboration between on-site and off-site users through cloud storage and databases."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The system is proven to achieve faster performance on 5G network as opposed to 4G."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Civil structures worldwide are confronted with a growing threat of structural deterioration, aggravated by various factors such as climate change, population growth, and increased traffic. The latent nature of these issues often leads to undetected vulnerabilities until a catastrophic failure occurs, resulting in substantial losses. To address this challenge, there is a critical need for improved structural monitoring, condition assessment, and maintenance practices. Traditional inspection methods, relying on visual estimation and heavy equipment for inaccessible areas, present formidable obstacles to inspectors. These methods impede the safe and fast examination of structural damage, complicating tracking of structural deterioration, and hindering efficient condition assessment. Recognizing these challenges, this paper proposes a remote collaborative framework to enhance the efficiency of structural inspections by leveraging the capabilities of Augmented Reality (AR), QR code, and 5G network. The proposed framework centers on real-time remote collaboration among on-site and off-site inspectors, aiming to elevate safety, accessibility, and overall inspection efficacy. The integration of real-time data sharing and collaboration facilitates immediate decision-making, enabling inspectors to proactively address structural vulnerabilities and prevent potential failures. This study concludes that the proposed framework effectively facilitates real-time structural condition assessment for on-site AR users. Simultaneously, off-site web users can instantly track the progression of data over time through the utilization of 5G technology. The proposed advanced AR framework effectively demonstrates real-time structural condition assessment through a lab-scale experimental beam and a full-scale bridge."}]}]}]}}