{"pii": "S1474034623004160", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e734", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e735"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e737", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e738", "view": "all"}, "_": "The lifecycle of the built environment is governed by complex regulations, requirements and standards. Ensuring compliance against these requirements is a complicated process, affecting the entire supply chain and often incurring significant costs, delay and uncertainty. Many of the processes, and elements within these processes, are formalised and supported by varying levels of digitisation and automation. This ranges from energy simulation, geometric checking, to building information modelling based checking."}, {"#name": "simple-para", "$": {"id": "d1e740", "view": "all"}, "_": "However, there are currently no unifying standards or integrating technology to tie regulatory efforts together to enable the widespread adoption of automated compliance processes. This has left many current technical approaches, while advanced and robust, isolated. However, the increasing maturity of asset datasets/information models, means that integration of data/tools is now feasible. This paper will propose and validate a new approach of solving the problem of automated compliance checking through the use of an ecosystem of compliance checking services."}, {"#name": "simple-para", "$": {"id": "d1e742", "view": "all"}, "_": "This work has identified a clear research gap. How automated compliance checking in the construction sector can move beyond sole reliance on BIM data, and tightly coupled integration with software tools, to provide an extensible enough system to integrate the current isolated software elements currently used within compliance checking processes."}, {"#name": "simple-para", "$": {"id": "d1e744", "view": "all"}, "_": "To test this approach, an architecture for an ecosystem of compliance services will be specified. To validate this architecture, a prototype version will be developed and validated against requirements derived from the weaknesses of current approaches."}, {"#name": "simple-para", "$": {"id": "d1e746", "view": "all"}, "_": "This validation has found that a distributed ecosystem can perform accurately and successfully, whilst providing advantages in terms of scalability and extensibility. This approach provides a route to the increased adoption of automated compliance checking, overcoming the issues of relying on one computer system/application to perform all aspects of this process."}]}]}]}}