{"pii": "S1476558613801285", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab1", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "SET005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "SP0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "Chemotherapy enhances the antitumor adaptive immune T cell response, but the immunosuppressive tumor environment often dominates, resulting in cancer relapse. Antigen-presenting cells such as tumor-associated macrophages (TAMs) and tumor dendritic cells (TuDCs) are the main protagonists of tumor-infiltrating lymphocyte (TIL) immuno-suppression. TAMs have been widely investigated and are associated with poor prognosis, but the immuno-suppressive activity of TuDCs is less well understood. We performed two-photon imaging of the tumor tissue to examine the spatiotemporal interactions between TILs and TuDCs after chemotherapy. In a strongly immuno-suppressive murine tumor model, cyclophosphamide-mediated chemotherapy transiently enhanced the antitumor activity of adoptively transferred ovalbumin-specific CD8"}, {"#name": "sup", "$": {"loc": "post"}, "_": "+"}, {"#name": "__text__", "_": " T cell receptor transgenic T cells (OTI) but barely affected TuDC compartment within the tumor. Time lapse imaging of living tumor tissue showed that TuDCs are organized as a mesh with dynamic interconnections. Once infiltrated into the tumor parenchyma, OTI T cells make antigen-specific and long-lasting contacts with TuDCs. Extensive analysis of TIL infiltration on histologic section revealed that after chemotherapy the majority of OTI T cells interact with TuDCs and that infiltration is restricted to TuDC-rich areas. We propose that the TuDC network exerts antigen-dependent unproductive retention that trap T cells and limit their antitumor effectiveness."}]}]}]}]}}