{"pii": "S1470160X23013250", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Zooplankton community was studied in the western Pacific Warm Pool."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "COI metabarcoding detected 2.3 times more zooplankton taxa than microscopy."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Sequence counts were significantly correlated to ZooScan data."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "COI metabarcoding detected greater seasonality under stable environment."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "The environment of the western Pacific Warm Pool is considered to be pronouncedly uniform and stable compared with other tropical ocean environments. Knowledge of the seasonal variations in the zooplankton community structure in this region with a high plankton species diversity remains limited. In this study, three methods, including identification using microscopy, ZooScan digital imaging, and DNA metabarcoding, were used to analyze zooplankton samples collected in three seasons, and to detect the seasonal variations in the community. The results show that the metabarcoding method based on the mitochondrial cytochrome "}, {"#name": "italic", "_": "c"}, {"#name": "__text__", "_": " oxidase I (COI) marker detected up to 2.3 times more zooplankton taxa than identification using microscopy. In contrast, the small subunit ribosomal RNA (18S) marker revealed fewer taxa than microscopy. Significantly positive correlations were observed between the sequence counts and three types of quantitative data, including the biovolume, dry weight biomass, and carbon biomass in all three seasons. The COI sequence counts exhibited a stronger correlation with the dry weight biomass than the biovolume and carbon biomass. Although both the microscopic and molecular methods detected seasonal variability of the zooplankton community, the COI metabarcoding method was more sensitive in detecting seasonal variations in the community, which was positively correlated with the taxonomic resolution of the different methods. In summary, the results of this study suggest that COI metabarcoding is an ideal tool for monitoring the seasonal variations in the diversity and community structure of zooplankton in the tropical open ocean regions with a stable environment all year round."}]}]}]}]}}