{"pii": "S1471490621001381", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0040", "view": "all"}, "_": "Fibroblastic reticular cells (FRCs) are a crucial part of the stromal cell infrastructure of secondary lymphoid organs (SLOs). Lymphoid organ fibroblasts form specialized niches for immune cell interactions and thereby govern lymphocyte activation and differentiation. Moreover, FRCs produce and ensheath a network of extracellular matrix (ECM) microfibers called the conduit system. FRC-generated conduits contribute to fluid and immune cell control by funneling fluids containing antigens and inflammatory mediators through the SLOs. We review recent progress in FRC biology that has advanced our understanding of immune cell functions and interactions. We discuss the intricate relationships between the cellular FRC and the fibrillar conduit networks, which together form the basis for efficient communication between immune cells and the tissues they survey."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0045", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "FRCs use polarized microtubule networks to direct the secretion of ECM components and construct the mammalian conduit network."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The conduit network functions as a filter that monitors fluid draining peripheral tissues, and as an export system for the systemic dissemination of locally produced molecules including antibodies."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Emerging evidence indicates that there are mechanosensitive mechanisms that control fluid flow through secondary lymphoid organs, and that are important for tissue homeostasis and immune function."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Fluid flow through conduit systems is robust, and the conduit network remains functional throughout the perturbation of lymph node expansion in response to immunogenic challenges."}]}]}]}]}]}]}}