{"pii": "S1470160X22011633", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Systematic review of PIT tag use in urodeles to optimize population monitoring."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "A lack of detailed reports and standardization of PIT tagging procedures was found."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Practices that could impact PIT tag retention and animal welfare were commonly used."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "PIT tags should be validated for each species and protocol prior to field studies."}]}, {"#name": "list-item", "$": {"id": "o0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "$$": [{"#name": "__text__", "_": "We validated a PIT tagging method for "}, {"#name": "italic", "_": "Salamandra salamandra"}, {"#name": "__text__", "_": " and "}, {"#name": "italic", "_": "Pleurodeles waltl."}]}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "The use of passive integrated transponder (PIT) tags in urodeles has become popular for individual marking in population and disease ecology studies. However, mark loss or mark-induced mortality can introduce biases and decrease precision in parameter estimates, leading to ineffective population management strategies. In this study we aimed to 1) analyze the existing literature on the use of PIT tags in urodeles; 2) determine whether species characteristics and PIT tagging methods influenced PIT tag rejection across studies; and 3) experimentally assess the adequacy of a subcutaneous PIT tagging method without anesthesia in three European urodele species. We systematically and quantitatively reviewed a database of literature related to the use of PIT tags in urodeles, classified and examined urodele species details, study design, PIT tagging methods, and outcomes across studies. Among the 51 peer-reviewed papers that fit our criteria, the most striking finding was the lack of reporting and standardization of the PIT tagging procedures. The majority of studies presented incomplete information on factors that could strongly influence the probability of PIT tag rejection as well as impact individual welfare (i.e. PIT tag size, its anatomical placement in the animal, anesthesia use, sterility or skin closure methods). We could not identify significant predictors of PIT tag loss, suggesting that the effectivity of PIT tags may be highly specific to the species and method used. Our PIT tagging method proved reliable in "}, {"#name": "italic", "_": "Salamandra salamandra"}, {"#name": "__text__", "_": " and "}, {"#name": "italic", "_": "Pleurodeles waltl"}, {"#name": "__text__", "_": ", whereas it did not seem a suitable technique for "}, {"#name": "italic", "_": "Calotriton asper"}, {"#name": "__text__", "_": " (PIT tag loss was 0% and 66.6%, respectively, and significantly different among species). Overall, we recommend a greater emphasis on reporting implantation methods, ensuring animal welfare and performing species and protocol specific laboratory trials before using PIT tags in urodeles in the field. Critically analyzing PIT tagging methods as well as testing their use in different species is essential to ensure the validity of future research studies and conservation strategies in urodeles."}]}]}]}]}}