{"pii": "S1470160X23004090", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Existing studies on RF-EMF effects focus on laboratory short-time exposed crop plants."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "We study 10 wild taxa under field conditions from seed germination to plant maturity."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Inter-specific variation in RF-EMF effects on plant morphology was observed."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "$$": [{"#name": "__text__", "_": "The strongest RF-EMF effects occurred for "}, {"#name": "italic", "_": "Trifolium arvense."}]}]}, {"#name": "list-item", "$": {"id": "o0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "$$": [{"#name": "__text__", "_": "Future studies should focus on keystone "}, {"#name": "italic", "_": "Trifolium"}, {"#name": "__text__", "_": " species in grassland ecosystems."}]}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Over the last three decades there has been an unprecedented increase in both the coverage of wireless communication networks and the resultant radiofrequency electromagnetic field (RF-EMF) exposure level. There is growing concern that this rapid environmental change may have unexpected consequences for living organisms. Existing research on plants has shown that RF-EMF radiation can affect their growth and development, gene expression and various metabolic activities. However, these findings are largely derived from short-time exposure of crop plants under laboratory conditions. It remains unclear to what extent plants are affected by artificial RF-EMFs in real ecosystems and what potential consequences this could have for ecosystems. This study attempts to assess these long-term effects of RF-EMF exposure on wild plants under controlled experimental field conditions. We investigated the impacts of RF-EMF exposure (866–868 MHz frequency band) from seed germination to maturation for ten common herbaceous plant species over a four-month period. The selected plant species belong to various families and have different functional and morphological traits that might affect a response to the applied RF-EMF."}, {"#name": "simple-para", "$": {"id": "sp0015", "view": "all"}, "$$": [{"#name": "__text__", "_": "For most of the considered species responses to RF-EMF were undetectable or weak, and where present restricted to a single trait. Only for one species, "}, {"#name": "italic", "_": "Trifolium arvense"}, {"#name": "__text__", "_": ", were effects observed at different plant development stages and for different plant characteristics. In this species RF-EMF stimulated growth and probably influenced leaf heliotropic movements, as indicated by a larger height, larger leaf area and altered leaf orientation one month after germination. However, over the growing season "}, {"#name": "italic", "_": "Trifolium arvense"}, {"#name": "__text__", "_": " plants exposed to RF-EMF entered the phase of senescence earlier, which was manifested through a reduction of green leaf area and an increase in the area of discolored leaf."}]}, {"#name": "simple-para", "$": {"id": "sp0020", "view": "all"}, "$$": [{"#name": "__text__", "_": "We conclude that the effects of RF-EMF exposure at environmentally relevant levels can be permanent and irreversible in plants growing in the open natural environment, however, these effects are restricted to specific species. This in turn suggests that future studies should examine whether the effects observed here occur also in more common "}, {"#name": "italic", "_": "Trifolium"}, {"#name": "__text__", "_": " species or other legumes that are a keystone component within European grasslands. Our findings also show that "}, {"#name": "italic", "_": "Trifolium arvense"}, {"#name": "__text__", "_": " could be a candidate indicator of man-made RF-EMFs in the environment."}]}]}]}]}}