{"pii": "S1476558623000519", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara007", "view": "all"}, "_": "The Sonic Hedgehog (Hh) signal transduction pathway plays a critical role in many developmental processes and, when deregulated, may contribute to several cancers, including basal cell carcinoma, medulloblastoma, colorectal, prostate, and pancreatic cancer. In recent years, several Hh inhibitors have been developed, mainly acting on the Smo receptor. However, drug resistance due to Smo mutations or non-canonical Hh pathway activation highlights the need to identify further mechanisms of Hh pathway modulation. Among these, deacetylation of the Hh transcription factor Gli1 by the histone deacetylase HDAC1 increases Hh activity. On the other end, the KCASH family of oncosuppressors binds HDAC1, leading to its ubiquitination and subsequent proteasomal degradation, leaving Gli1 acetylated and not active."}, {"#name": "simple-para", "$": {"id": "spara008", "view": "all"}, "_": "It was recently demonstrated that the potassium channel containing protein KCTD15 is able to interact with KCASH2 protein and stabilize it, enhancing its effect on HDAC1 and Hh pathway."}, {"#name": "simple-para", "$": {"id": "spara009", "view": "all"}, "_": "KCTD15 and KCTD1 proteins share a high homology and are clustered in a specific KCTD subfamily. We characterize here KCTD1 role on the Hh pathway. Therefore, we demonstrated KCTD1 interaction with KCASH1 and KCASH2 proteins, and its role in their stabilization by reducing their ubiquitination and proteasome-mediated degradation. Consequently, KCTD1 expression reduces HDAC1 protein levels and Hh/Gli1 activity, inhibiting Hh dependent cell proliferation in Hh tumour cells. Furthermore, analysis of expression data on publicly available databases indicates that KCTD1 expression is reduced in Hh dependent MB samples, compared to normal cerebella, suggesting that KCTD1 may represent a new putative target for therapeutic approaches against Hh-dependent tumour."}]}]}]}}