{"pii": "S1535947620333806", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ceab10", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara70", "view": "all"}, "$$": [{"#name": "__text__", "_": "The Mass Spec Studio package was designed to support the extraction of hydrogen-deuterium exchange and covalent labeling data for a range of mass spectrometry (MS)-based workflows, to integrate with restraint-driven protein modeling activities. In this report, we present an extension of the underlying Studio framework and provide a plug-in for crosslink (XL) detection. To accommodate flexibility in XL methods and applications, while maintaining efficient data processing, the plug-in employs a peptide library reduction strategy via a presearch of the tandem-MS data. We demonstrate that prescoring linear unmodified peptide tags using a probabilistic approach substantially reduces search space by requiring both crosslinked peptides to generate sparse data attributable to their linear forms. The method demonstrates highly sensitive crosslink peptide identification with a low false positive rate. Integration with a Haddock plug-in provides a resource that can combine multiple sources of data for protein modeling activities. We generated a structural model of porcine transferrin bound to TbpB, a membrane-bound receptor essential for iron acquisition in "}, {"#name": "italic", "_": "Actinobacillus pleuropneumoniae"}, {"#name": "__text__", "_": ". Using mutational data and crosslinking restraints, we confirm the mechanism by which TbpB recognizes the iron-loaded form of transferrin, and note the requirement for disparate sources of restraint data for accurate model construction. The software plugin is freely available at "}, {"#name": "inter-ref", "$": {"xmlns:xlink": true, "id": "interrefs10", "href": "http://www.msstudio.ca", "type": "simple"}, "_": "www.msstudio.ca"}, {"#name": "__text__", "_": "."}]}]}]}]}}