{"pii": "S1535947620335209", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ceab10", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara110", "view": "all"}, "$$": [{"#name": "__text__", "_": "Expanding efforts to develop preventive gonorrhea vaccines is critical because of the dire possibility of untreatable gonococcal infections. Reverse vaccinology, which includes genome and proteome mining, has proven very successful in the discovery of vaccine candidates against many pathogenic bacteria. However, progress with this approach for a gonorrhea vaccine remains in its infancy. Accordingly, we applied a comprehensive proteomic platform—isobaric tagging for absolute quantification coupled with two-dimensional liquid chromatography and mass spectrometry—to identify potential gonococcal vaccine antigens. Our previous analyses focused on cell envelopes and naturally released membrane vesicles derived from four different "}, {"#name": "italic", "_": "Neisseria gonorrhoeae"}, {"#name": "__text__", "_": " strains. Here, we extended these studies to identify cell envelope proteins of "}, {"#name": "italic", "_": "N. gonorrhoeae"}, {"#name": "__text__", "_": " that are ubiquitously expressed and specifically induced by physiologically relevant environmental stimuli: oxygen availability, iron deprivation, and the presence of human serum. Together, these studies enabled the identification of numerous potential gonorrhea vaccine targets. Initial characterization of five novel vaccine candidate antigens that were ubiquitously expressed under these different growth conditions demonstrated that homologs of BamA (NGO1801), LptD (NGO1715), and TamA (NGO1956), and two uncharacterized proteins, NGO2054 and NGO2139, were surface exposed, secreted via naturally released membrane vesicles, and elicited bactericidal antibodies that cross-reacted with a panel of temporally and geographically diverse isolates. In addition, analysis of polymorphisms at the nucleotide and amino acid levels showed that these vaccine candidates are highly conserved among "}, {"#name": "italic", "_": "N. gonorrhoeae"}, {"#name": "__text__", "_": " strains. Finally, depletion of BamA caused a loss of "}, {"#name": "italic", "_": "N. gonorrhoeae"}, {"#name": "__text__", "_": " viability, suggesting it may be an essential target. Together, our data strongly support the use of proteomics-driven discovery of potential vaccine targets as a sound approach for identifying promising gonococcal antigens."}]}]}]}]}}