{"pii": "S1535947620344194", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ceab10", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara50", "view": "all"}, "$$": [{"#name": "__text__", "_": "Protein complexes and protein-protein interactions are essential for almost all cellular processes. Here, we establish a mammalian affinity purification and lentiviral expression (MAPLE) system for characterizing the subunit compositions of protein complexes. The system is flexible ("}, {"#name": "italic", "_": "i.e."}, {"#name": "__text__", "_": " multiple N- and C-terminal tags and multiple promoters), is compatible with Gateway"}, {"#name": "sup", "$": {"loc": "post"}, "_": "TM"}, {"#name": "__text__", "_": " cloning, and incorporates a reference peptide. Its major advantage is that it permits efficient and stable delivery of affinity-tagged open reading frames into most mammalian cell types. We benchmarked MAPLE with a number of human protein complexes involved in transcription, including the RNA polymerase II-associated factor, negative elongation factor, positive transcription elongation factor b, SWI/SNF, and mixed lineage leukemia complexes. In addition, MAPLE was used to identify an interaction between the reprogramming factor Klf4 and the Swi/Snf chromatin remodeling complex in mouse embryonic stem cells. We show that the SWI/SNF catalytic subunit "}, {"#name": "italic", "_": "Smarca2"}, {"#name": "__text__", "_": "/"}, {"#name": "italic", "_": "Brm"}, {"#name": "__text__", "_": " is up-regulated during the process of induced pluripotency and demonstrate a role for the catalytic subunits of the SWI/SNF complex during somatic cell reprogramming. Our data suggest that the transcription factor "}, {"#name": "italic", "_": "Klf4"}, {"#name": "__text__", "_": " facilitates chromatin remodeling during reprogramming."}]}]}]}]}}