{"pii": "S1568494621008371", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e602"}, "$$": [{"#name": "section-title", "$": {"id": "d1e603"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e605"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e606"}, "_": "Nowadays, the automatic text summarization is a highly relevant task in many contexts. In particular, query-focused summarization consists of generating a summary from one or multiple documents according to a query given by the user. Additionally, sentiment analysis and opinion mining analyze the polarity of the opinions contained in texts. These two issues are integrated in an approach to produce an opinionated summary according to the user’s query. Thereby, the query-focused sentiment-oriented extractive multi-document text summarization problem entails the optimization of different criteria, specifically, query relevance, redundancy reduction, and sentiment relevance. An adaptation of the metaheuristic population-based crow search algorithm has been designed, implemented, and tested to solve this multi-objective problem. Experiments have been carried out by using datasets from the Text Analysis Conference (TAC) datasets. Recall-Oriented Understudy for Gisting Evaluation (ROUGE) metrics and the Pearson correlation coefficient have been used for the performance assessment. The results have reported that the proposed approach outperforms the existing methods in the scientific literature, with a percentage improvement of 75.5% for ROUGE-1 score and 441.3% for ROUGE-2 score. It also has been obtained a Pearson correlation coefficient of +0.841, reporting a strong linear positive correlation between the sentiment scores of the generated summaries and the sentiment scores of the queries of the topics."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e608"}, "$$": [{"#name": "section-title", "$": {"id": "d1e609"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e611"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e612"}, "$$": [{"#name": "list", "$": {"id": "d1e614"}, "$$": [{"#name": "list-item", "$": {"id": "d1e615"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e618"}, "_": "The sentiment-oriented query-focused text summarization problem is tackled."}]}, {"#name": "list-item", "$": {"id": "d1e620"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e623"}, "_": "Query relevance, redundancy reduction, and sentiment relevance are maximized."}]}, {"#name": "list-item", "$": {"id": "d1e625"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e628"}, "_": "A multi-objective crow search algorithm (QSO-MOCSA) is designed for solving the task."}]}, {"#name": "list-item", "$": {"id": "d1e630"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e633"}, "_": "Experiments consider the Text Analysis Conference datasets and the ROUGE metrics."}]}, {"#name": "list-item", "$": {"id": "d1e635"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e638"}, "_": "This new approach shows an important improvement compared with the existing methods."}]}]}]}]}]}]}}