{"pii": "S1566253523000398", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1355", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1356"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1358", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1359", "view": "all"}, "_": "Navigation/positioning systems have become critical to many applications, such as autonomous driving, Internet of Things (IoT), Unmanned Aerial Vehicle (UAV), and smart cities. However, it is difficult to provide a robust, accurate, and seamless solution with single navigation/positioning technology. For example, the Global Navigation Satellite System (GNSS) cannot perform satisfactorily indoors; consequently, multi-sensor integrated systems provide the solution, as they compensate for the limitations of single technology by using the complementary characteristics of different sensors. This article describes a thorough investigation into multi-sensor data fusion, which over the last ten years has been used for integrated positioning/navigation systems. In this article, different navigation/positioning systems are classified and elaborated upon from three aspects: (1) sources, (2) algorithms and architectures, and (3) scenarios, which we further divide into two categories: (i) analytics-based fusion and (ii) learning-based fusion. For analytics-based fusion, we discuss the Kalman filter and its variants, graph optimization methods, and integrated schemes. For learning-based fusion, several supervised, unsupervised, reinforcement learning, and deep learning techniques are illustrated in multi-sensor integrated positioning/navigation systems. Design consideration of these integrated systems is discussed in detail from several aspects and their application scenarios are categorized. Finally, future directions for their research and implementation are discussed."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1361", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1362"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1364", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1365", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1367"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1368"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1371", "view": "all"}, "_": "Classifying integrated navigation systems with sources, algorithms, and scenarios."}]}, {"#name": "list-item", "$": {"id": "d1e1373"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1376", "view": "all"}, "_": "Classifying multi-sensor fusion based on absolute and relative positioning sources."}]}, {"#name": "list-item", "$": {"id": "d1e1378"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1381", "view": "all"}, "_": "Analytics-based and learning-based algorithms are discussed and classified."}]}, {"#name": "list-item", "$": {"id": "d1e1383"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1386", "view": "all"}, "_": "Design considerations include state selection, observability, time synchronization."}]}, {"#name": "list-item", "$": {"id": "d1e1388"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1391", "view": "all"}, "_": "Classifying application scenarios into 6 categories, including automated driving."}]}]}]}]}]}]}}