{"pii": "S1568494623005586", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e2022"}, "$$": [{"#name": "section-title", "$": {"id": "d1e2023"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e2025"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e2026"}, "_": "Public institutions, such as law enforcement agencies or health centers, have a vast volume of unstructured text documents, e.g. police reports. Currently, before this data can be shared (e.g. with research institutions), it must go through a lengthy and costly human anonymization procedure."}, {"#name": "simple-para", "$": {"view": "all", "id": "d1e2028"}, "_": "This paper addresses this issue by presenting AGORA, a cutting-edge tool that automatically identifies key entities and anonymizes sensitive data in text documents. AGORA has been developed in partnership with the Spanish National Office Against Hate Crimes and validated in the police and medical domains. This tool allows to export both anonymized texts and identified entities to structured files, thus, simplifying its exploitation for analysis purposes. Also, AGORA is capable of plotting the location entities identified in the documents, as well as obtaining and displaying relevant information from their geographical surroundings. Thus, it simplifies the task of generating comprehensive datasets for subsequent data analysis or predictive tasks. Its main goal is to foster cooperation between public institutions and research centers by easing document sharing as well as serving as a foundation for addressing succeeding phases in data science."}, {"#name": "simple-para", "$": {"view": "all", "id": "d1e2030"}, "_": "The paper conducts a comprehensive assessment of the literature on Named Entity Recognition methodologies and technologies. Followed by extensive computational experiments to identify the best configuration for the NER models embedded in AGORA which include both successful state-of-the-art model setups and novelly proposed ones. Finally, the methodology, conclusions and software provided can be easily reused in similar application scenarios."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e2032"}, "$$": [{"#name": "section-title", "$": {"id": "d1e2033"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e2035"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e2036"}, "$$": [{"#name": "list", "$": {"id": "d1e2038"}, "$$": [{"#name": "list-item", "$": {"id": "d1e2039"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e2042"}, "_": "First tool to combine document anonymization, geoparsing, geocoding & visualization."}]}, {"#name": "list-item", "$": {"id": "d1e2044"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e2047"}, "_": "Extensive literature review on NER, anonymization, geoparsing & geocoding."}]}, {"#name": "list-item", "$": {"id": "d1e2049"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e2052"}, "_": "First anonymization model in the police context."}]}, {"#name": "list-item", "$": {"id": "d1e2054"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e2057"}, "_": "Methodical NER comparison of Tensorflow, FlairNLP, Transformers & pretrained models."}]}, {"#name": "list-item", "$": {"id": "d1e2059"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e2062"}, "_": "Cross-domain evaluation of NER models in the Spanish language."}]}]}]}]}]}]}}