{"pii": "S1569843224001377", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "First proposal to generate the screened backbone map from the 3D map."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "First proposal to use the screened backbone map to correct dispersed trajectory."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Introduce a new perspective to the positioning approach."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "As a commonly used indoor internet-of-things (IoT) positioning method, fingerprinting is frequently carried out through the fusion of inertial and WiFi or magnetic data. Nevertheless, signals like magnetic intensity and WiFi received signal strength tend to fluctuate and cannot always provide high accuracy. Thus, other available data can be introduced to maintain positioning continuity and reliability. Among available data sources, 3D point clouds can be used to provide high-accuracy geospatial information. However, applying it directly in positioning leads to considerable memory, computational consumption, and restriction in use patterns. To address this challenge, this paper proposed a lightweight localization method that uses 3D point clouds to reliably correct the dispersed user trajectory to assist indoor IoT localization. Within this approach, the point cloud is transformed into a screened backbone map, diminishing data volume and computational demands. Subsequently, considering the fact that mass-market users do not always follow the route-screened backbone map, a screened backbone map-based user trajectory correction algorithm is presented to enhance localization accuracy and reliability. Within a 100 m * 60 m indoor parking lot, the proposed approaches reduced the memory from over 1 GB in point clouds to 500 kB in screened backbone map, provided 100 % correct matching between user trajectory and generated screened backbone map, and improved magnetic positioning accuracy by over 80 % when aiding with the generated route-screened backbone map."}]}]}]}}