{"pii": "S1569843223002649", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Digital twins for cities represent a new trend for urban and geospatial fields."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Some Digital twins for city implementations are taking place."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Analysis of the gap between theoretical definitions and current implementations."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Classification of digital twin implementations according to 9 categories."}]}, {"#name": "list-item", "$": {"id": "o0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Classification of digital twin initiatives based on the level and method of data integration."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Digital Twins for cities represent a new trend for urban and geospatial fields. Currently, some DTs implementations are taking place. Nevertheless, the whole concept remains ambiguous and presents some differences that need to be addressed. The aim of this article is to bridge the gap between DTs definitions and current implementations. This review was conducted through a scientific literature review and an online survey. The study collects Digital Twins for cities definitions and compares them with related concepts used jointly in the literature. It puts them together through an in-depth analysis since they express similarities and various discrepancies. As our study highlights the most documented DTs initiatives for cities according to 9 comprehensive categories, a new approach assessing the initiatives is proposed to evaluate the data integration methods used in the current realizations. Three levels are suggested: a conceptual schema model-based level (the data are integrated into the top level of the DT, i.e., extending the schema model to cover new features or themes); a database-based level (data are integrated in order to feed or update specific attributes or classes); and an application-based level (the data are integrated into the application generally at the viewer level)."}]}]}]}}