{"pii": "S1569843222002539", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Indoor trajectory reconstruction model using limited reference points is proposed."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Uncertainty prediction model uses the combination of 1D-CNN and LSTM is proposed."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Enhanced training dataset contains sampling and measurement errors is generated."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Uncertainty region considers both sampling and measurement errors is established."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Modelling pedestrian movement uncertainty in complex urban environments is regarded as a meaningful and challenging task regarding the promotion of geospatial data mining and analysis. However, the traditional uncertainty prediction model only takes the movement distance or speed into consideration and is not able to adapt well to time-varying measurement errors. In this paper, a deep-learning framework is proposed for modelling pedestrian movement uncertainty in large-scale indoor areas, in which a hybrid deep-learning model combines a one-dimensional Convolutional Neural Network (1D-CNN) with a long short-term memory (LSTM) network is proposed for enhancing feature extraction performance and reducing time correlation errors. The proposed framework takes human motion related measurement features into consideration, in which the moving step-length and heading information during a time period are also reconstructed and modelled as the input to the deep-learning model. Compared with state-of-art algorithms applied to different real-world trajectory datasets, the proposed deep-learning approach demonstrates much better performance of uncertainty region prediction, including the different indexes (Euclidean error distance, completeness and density) This study has leaded to the provision of an effective and practical framework for modelling trajectory uncertainty of the pedestrian in challenging urban environments, and which is expected to benefit smart city and spatial perception related applications."}]}]}]}}