{"pii": "S1568494624010949", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1581", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1582"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1584", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1585", "view": "all"}, "_": "This paper introduces a transformative edge computing-based approach for enhancing driver attention and road safety using EEG-driven deep reinforcement learning (DRL). As driver inattention remains a significant factor in accidents, real-time cognitive state monitoring enabled by in-vehicle edge devices offers new promise. Our method leverages EEG data collected from drivers using headsets, analyzing signals related to visual attention. Edge computing resources in the vehicle extract features and classify attention levels using Deep Q-Network (DQN) and Proximal Policy Optimization (PPO) models trained to approximate optimal driving decisions. A novel reward structure combining driving performance and attention guides the models. Our edge computing-powered framework reacts within critical time latencies to maximize attention through interventions adapting to the driving environment. Results demonstrate the effectiveness of this approach, with PPO agent on edge devices achieving high average rewards up to 489,752.4 and 99.3% reward as accuracy in classifying attention states, thereby significantly outperforming traditional methods. This underscores edge computing’s potential to enable real-time integration of neuroscience and AI, advancing road safety. The edge resources deliver time-critical analysis and adaptation, while connectivity to the fog and cloud allows optimizing and learning at scale across populations. This research pioneers a new epoch for road safety powered by edge intelligence."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1587", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1588"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1590", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1591", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1593"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1594"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1597", "view": "all"}, "_": "The paper introduces a novel approach that uses EEG-informed DRL to enhance driver attention and road safety."}]}, {"#name": "list-item", "$": {"id": "d1e1599"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1602", "view": "all"}, "_": "A key innovation is the integration of attention mechanisms derived from neuroscience with DQN and real-time EEG data."}]}, {"#name": "list-item", "$": {"id": "d1e1604"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1607", "view": "all"}, "_": "The proposed methodology uses EEG data and applies DRL algorithms like DQN and PPO to approximate optimal driving decisions."}]}, {"#name": "list-item", "$": {"id": "d1e1609"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1612", "view": "all"}, "_": "Results demonstrate PPO’s superiority over DQN, with average rewards of 9.93 and cumulative rewards of 489,752.4."}]}]}]}]}]}]}}