{"pii": "S1569843224001985", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e689", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e690"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e692", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e693", "view": "all"}, "_": "Loop closure detection (LCD) plays an essential role in the Simultaneous Localization and Mapping (SLAM) process, effectively reducing cumulative trajectory errors. However, conventional LCD methods often encounter challenges when dealing with variations in illumination, changes in viewpoint, and environments with weak textures. This is due to their reliance on low-level geometric or image features. To address these issues, we propose a robust LCD method named SL-LCD, which integrates semantic information and line features to fully leverage the semantic content and line attributes within indoor scenes, thereby establishing a reliable feature correspondence between query images and loop closure images. For the retrieval of candidate closed-loop images, we construct a semantic-line-segment topological graph and introduce a graph matching algorithm to perform the LCD task. This approach fully exploits image features and spatial information to achieve closed-loop detection in complex indoor scenes. Furthermore, we present a semantic voxel-based generalized ICP (SVGICP) closed-loop relocalization algorithm tailored for challenging and complex indoor scenes, enhancing the accuracy of closed-loop relocalization in such scenarios. Experimental results demonstrate that the SL-LCD algorithm proposed in this paper surpasses state-of-the-art methods, accurately detecting closed loops, and effectively eliminating trajectory drift."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e695", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e696"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e698", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e699", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e701"}, "$$": [{"#name": "list-item", "$": {"id": "d1e702"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e705", "view": "all"}, "_": "Robust LCD method integrates 3D semantic-line features for loop closure detection and relocalization."}]}, {"#name": "list-item", "$": {"id": "d1e707"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e710", "view": "all"}, "_": "Graph node affinity matrix fuses semantic and line features, aiding accurate graph matching."}]}, {"#name": "list-item", "$": {"id": "d1e712"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e715", "view": "all"}, "_": "Coarse-to-fine relocalization leverages Sim(3) and semantic-enhanced VGICP algorithms."}]}]}]}]}]}]}}