{"pii": "S1569843222001856", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "A method to construct fine-grained navigation networks in urban areas is proposed."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Remote sensing images and vector data are used to construct fine navigation mesh."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "A computational model of traversability is developed to guide path planning."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Urban road networks and fine navigation mesh are integrated."}]}, {"#name": "list-item", "$": {"id": "o0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Experiments with real data are carried out to evaluate its performance."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Fine-grained navigation is becoming increasingly demanded in urban areas. However, current navigation software fails to provide accurate paths on grounds without roads (GWR) like residential communities, squares, parks, etc. In this work, a method for the construction of fine-grained navigation networks for urban environments is developed. Remote sensing images are used to estimate the traversability of GWR. A Voronoi diagram that conforms to important shapes, such as buildings, is created for the spatial partitioning of GWR into meaningful atomic regions. A computational model of traversability is constructed based on the Voronoi diagram to construct the navigation mesh of GWR. A fine-grained navigation network is then generated by integrating the GWR navigation mesh and urban road networks. Two experiments are performed to evaluate the effectiveness and efficiency of the proposed method. The results show that the proposed method performs well in both the representation of traversability in GWR and fine-grained path planning in urban areas. Moreover, the integration of the fine navigation mesh and urban road networks proves that such a method has the potential to provide fine-grained navigation services."}]}]}]}}