{"pii": "S1566253524000472", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1198", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1199"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1201", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1202", "view": "all"}, "$$": [{"#name": "__text__", "_": "Internet memes, while often humorous in nature, can be used to spread hate speech, toxic content, and disinformation across the digital information ecosystem. As a result, detecting harmful memes has become a crucial task for maintaining online safety and fostering responsible online behavior. Prior research in this field has mainly targeted multimodal internal aspects of memes, specifically the image and text modalities, and has sought to interpret their significance by analyzing intra- and inter-modality signals via sophisticated visual-language models. However, understanding the message of a (harmful) meme entails tacit background knowledge, which is not explicitly expressed in the meme itself, but rather relies on cultural references, shared knowledge, and social context. In this paper, we propose KERMIT (Knowledge-EmpoweRed Model In harmful meme deTection), a novel framework which incorporates and uses external knowledge into the process of identifying harmful memes. Specifically, KERMIT builds the meme’s "}, {"#name": "italic", "_": "knowledge-enriched information network"}, {"#name": "__text__", "_": " by integrating internal entities of the meme with relevant external knowledge obtained from ConceptNet. Subsequently, the framework employs a dynamic learning mechanism that leverages memory-augmented neural networks and attention mechanisms to discern the most informative knowledge for accurate classification of harmful memes. Our experiments on four benchmark datasets demonstrate that KERMIT effectively utilizes external knowledge to improve classification performance compared to several state-of-the-art baselines. Overall, the findings of this study shed light on the complex nature of Internet memes and highlight the importance of knowledge-informed decision-making for harmful meme detection."}]}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1207", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1208"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1210", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1211", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1213"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1214"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1217", "view": "all"}, "_": "We propose KERMIT, a novel approach for detecting harmful memes."}]}, {"#name": "list-item", "$": {"id": "d1e1219"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1222", "view": "all"}, "_": "We design a pipeline to integrate meme’s entities and external knowledge."}]}, {"#name": "list-item", "$": {"id": "d1e1224"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1227", "view": "all"}, "_": "We employ a dynamic learning mechanism to extract knowledge for classification."}]}, {"#name": "list-item", "$": {"id": "d1e1229"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1232", "view": "all"}, "_": "Our experiments show that KERMIT improves classification performance."}]}]}]}]}]}]}}