{"pii": "S1574013722000120", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e663"}, "$$": [{"#name": "section-title", "$": {"id": "d1e664"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e666"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e667"}, "_": "The last two decades have experienced a steady rise in the production and deployment of sensing-and-connectivity-enabled electronic devices, replacing “regular” physical objects. The resulting Internet-of-Things (IoT) will soon become indispensable for many application domains. Smart objects are continuously being integrated within factories, cities, buildings, health institutions, and private homes."}, {"#name": "simple-para", "$": {"view": "all", "id": "d1e669"}, "_": "Approximately 30 years after the birth of IoT, society is confronted with significant challenges regarding IoT security. Due to the interconnectivity and ubiquitous use of IoT devices, cyberattacks have widespread impacts on multiple stakeholders. Past events show that the IoT domain holds various vulnerabilities, exploited to generate physical, economic, and health damage. Despite many of these threats, manufacturers struggle to secure IoT devices properly."}, {"#name": "simple-para", "$": {"view": "all", "id": "d1e671"}, "$$": [{"#name": "__text__", "_": "Thus, this work overviews the IoT security landscape with the intention to emphasize the demand for secured IoT-related products and applications. Therefore, "}, {"#name": "italic", "_": "(a)"}, {"#name": "__text__", "_": " a list of key challenges of securing IoT devices is determined by examining their particular characteristics, "}, {"#name": "italic", "_": "(b)"}, {"#name": "__text__", "_": " major security objectives for secured IoT systems are defined, "}, {"#name": "italic", "_": "(c)"}, {"#name": "__text__", "_": " a threat taxonomy is introduced, which outlines potential security gaps prevalent in current IoT systems, and "}, {"#name": "italic", "_": "(d)"}, {"#name": "__text__", "_": " key countermeasures against the aforementioned threats are summarized for selected IoT security-related technologies available on the market."}]}]}]}]}}