{"pii": "S1574119222001559", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e1157"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1158"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e1160"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e1161"}, "_": "Owing to the recent proliferation of smartphones and the SNS, a large number of images taken by smartphones at various places have been uploaded to SNSs. In addition, smartphones are equipped with various sensors such as Wi-Fi modules that enable us to generate an image associated with the sensory information that represents the context in which the image was captured. This study demonstrates the benefits of images associated with Wi-Fi signals in the automated construction of a Wi-Fi-based indoor logical location classifier that predicts a semantic location label of a user’s position for shopping complexes. In this study, a logical location class refers to the store class label in a shopping complex, such as Starbucks and H&M. Given a collection of images associated with Wi-Fi signals taken at a shopping complex and the complex’s floor plan, the proposed method first estimates the store label at which an image was taken by analyzing the image and crawled online images of branch stores. Then, the 2D coordinates of the images taken at branch stores on the floor coordinate system can be estimated using the floor plan. Subsequently, by using the Wi-Fi signals of the branch store images and their estimated 2D coordinates, we construct a transformation function that maps Wi-Fi signals onto the 2D coordinates, and we adopt this function to predict an indoor location class of an observed Wi-Fi scan from a smartphone possessed by an end user. The proposed transformation function comprises an ensemble of sub-functions designed based on CVAEs. Finally, we demonstrate the effectiveness of the proposed method for three actual shopping complexes."}]}]}]}}