{"pii": "S157087051530007X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectt0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "Catastrophic disasters can destroy large regions and, in the process, leave many victims isolated from the rest of the world. Recovering the communication infrastructure is typically slow and expensive, which is not suitable for emergency response. Multihop wireless access networks have the potential to quickly provide Internet connectivity to victims, but so far no simple and practical solution has been proposed to help people configure these networks easily. We are pursuing the approach of utilizing wireless virtualization techniques to establish wireless access networks on-the-fly using on-site mobile devices. While our previous work has demonstrated proof-of-concept solutions, it lacked fundamental communication abstractions, a rigorous design, and a thorough analysis on the effectiveness of these solutions. The main new contributions of this article are: (1) the "}, {"#name": "italic", "_": "wireless multihop communication abstraction"}, {"#name": "__text__", "_": " (WMCA) as a fundamental communication concept for a practical "}, {"#name": "italic", "_": "tree-based disaster recovery access network"}, {"#name": "__text__", "_": " (TDRAN), (2) the complete design and implementation details of TDRAN, and (3) a comprehensive analysis of the effectiveness of the proposed approach based on field experiments, both in indoor and outdoor settings, at different sites in Japan. The results demonstrate the effectiveness of the proposed solution for on-site configuration of wireless access networks, as it can easily extend to 20 hops by 15 m-distance and 16 hops by 30 m-distance networks, which result in 300 m and 480 m (respectively) in radius or about 1 km in diameter. This work also confirms that our approach is ready for realization as a real disaster recovery solution."}]}]}]}]}}