{"pii": "S1573427721000163", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "abs0010", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "For several decades, optical networks, due to their high capacity and long-distance transmission range, have been used as the major communication technology to serve network traffic, especially in the core and metro segments of communication networks. Unfortunately, our society has often experienced how the correct functioning of these critical infrastructures can be substantially hindered by massive failures triggered by natural disasters, weather-related disruptions and malicious human activities."}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "In this position paper, we discuss the impact on optical networks of all major classes of disaster events mentioned above, and we overview recent relevant techniques that have been proposed to increase the disaster resilience of optical networks against the various classes of disaster events. We start by presenting some proactive methods to be applied before the occurrence of a disaster. Then we move our focus also on other preparedness methods that can be executed in the (typically short) time frame between the occurrence of an early alert of an incoming disaster and the time a disaster actually hits the network. Finally, we discuss reactive procedures that allow performing post-disaster recovery operations effectively. The analysis of disaster resilience mechanisms provided in this paper covers both wired and optical wireless communication infrastructures and also contains explicit remarks covering the role of emerging technologies (e.g., fixed-mobile convergence in the 5G era and beyond) in disaster resilience."}]}]}]}}