{"pii": "S1570870524000295", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e749", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e750"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e752", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e753", "view": "all"}, "_": "Wi-Fi is a standard off-the-shelf solution for industrial robotics. The IEEE 802.11ax amendment extends it to support the 6 GHz band, 160 MHz bandwidth and bit-rates up to 9.6 Gbps. In this article, we evaluate the performance of Wi-Fi 6 compared to Wi-Fi 5 and Wi-Fi 4. We select 9 physical layers (PHYs) representing different Wi-Fi generations and we evaluate their performance in an industrial shipyard in the presence of high radio frequency interference and metallic obstructions. We deploy setup of a robotic station (STA) and a controller STA with three applications running in parallel: a robotic STA is sending a high throughput stream to a controller, a Robotic Operating System (ROS) application is sending time-critical control commands to the robotic STA, Precision Time Protocol (PTP) keeps synchronizing the clocks between both STAs. We evaluate the performance in terms of three Key Performance Indicators (KPIs): streaming throughput, IP-level delay using PTP, and Application-level delay of ROS control packets. The networks are run in: Short range Line of Sight (LoS), Medium range LoS, Long range None-LoS (NLoS), and Long range mixed settings. We note that depending on the PHY configuration, an older Wi-Fi generation may outperform Wi-Fi 6. We further observe trade-offs between the different PHYs: wide channel PHYs (e.g. 160 MHz) had best throughput reaching up to 900 Mbps while PHYs while 80 MHz or 20 MHz bandwidth achieved as low as 9 ms delay. This motivates further research in multi-PHY adaptation for KPIs specific to industrial robotics."}]}]}]}}