{"pii": "S157495411300068X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The short-term rate of coastal erosion and recession has been observed at island shoreline bluffs near waterways among Boston Harbor, Massachusetts, USA. This erosion has been hypothesized partially related to waves from high-speed wakes. Recording the physical erosion events during extreme high waves is significant to evaluate the dynamics of bluff erosion and to document these short-term processes. Still and motion imagery are important media to observe rare and extreme events in ecology, geology, and environmental condition. The study of coastal erosion requires recording devices for these modalities capable of long-term, low-cost, low-power operation with low maintenance, and with the ability to support a large dynamic range in both time and space. We describe recent work in the development of a wireless video camera network for an ecosystem observation platform. These cameras are enclosed in weatherproof housings and supported by solar energy harvesting. The cameras are Internet-enabled and thus live video can be accessed remotely. Video streams are transmitted via wireless network, and delivered to and stored at a remote server. This system has been functional as designed since installation in October 2012 on Thompson Island, Massachusetts, and is expected to operate indefinitely. To date, a number of erosion-related events have been successfully captured. This platform has shown the potential to be used in a large scale for a variety of environmental monitoring studies."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "ab0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0070"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0085", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0015"}, "$$": [{"#name": "list-item", "$": {"id": "u0055"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0170", "view": "all"}, "_": "Development of a wireless video camera network for studying coastal erosion."}]}, {"#name": "list-item", "$": {"id": "u0060"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0175", "view": "all"}, "_": "Implementation of the video camera network on Thompson Island, Boston Harbor."}]}, {"#name": "list-item", "$": {"id": "u0065"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0180", "view": "all"}, "_": "Documentation of effects of storm and tide events on cliff erosion."}]}]}]}]}]}]}}