{"pii": "S1570870522000087", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e1795"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1796"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e1798"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e1799"}, "_": "Unmanned Aerial Vehicles (UAVs), as a recently emerging technology, enabled a new breed of unprecedented applications in different domains. This technology’s ongoing trend is departing from large remotely-controlled drones to networks of small autonomous drones to collectively complete intricate tasks time and cost-effectively. An important challenge is developing efficient sensing, communication, and control algorithms that can accommodate the requirements of highly dynamic UAV networks with heterogeneous mobility levels. Recently, the use of Artificial Intelligence (AI) in learning-based networking has gained momentum to harness the learning power of cognizant nodes to make more intelligent networking decisions by integrating computational intelligence into UAV networks. An important example of this trend is developing learning-powered routing protocols, where machine learning methods are used to model and predict topology evolution, channel status, traffic mobility, and environmental factors for enhanced routing."}, {"#name": "simple-para", "$": {"view": "all", "id": "d1e1801"}, "$$": [{"#name": "__text__", "_": "This paper reviews AI-enabled routing protocols designed primarily for aerial networks, including topology-predictive and self-adaptive learning-based routing algorithms, with an emphasis on accommodating highly-dynamic network topology. To this end, we justify the importance and adaptation of AI into UAV network communications. We also address, with an AI emphasis, the closely related topics of mobility and networking models for UAV networks, simulation tools and public datasets, and relations to UAV swarming, which serve to choose the right algorithm for each scenario. We conclude by presenting future trends, and the remaining challenges in AI-based UAV networking, for different aspects of routing, connectivity, topology control, security and privacy, energy efficiency, and spectrum sharing."}, {"#name": "cross-ref", "$": {"refid": "fn1", "id": "d1e1803"}, "$$": [{"#name": "sup", "$": {"loc": "post"}, "_": "1"}]}, {"#name": "footnote", "$": {"id": "fn1"}, "$$": [{"#name": "label", "_": "1"}, {"#name": "note-para", "$": {"view": "all", "id": "d1e1809"}, "$$": [{"#name": "__text__", "_": "This material is based upon the work supported by the "}, {"#name": "grant-sponsor", "$": {"xmlns:xlink": true, "sponsor-id": "http://dx.doi.org/10.13039/100000001", "id": "GS1", "type": "simple", "role": "http://www.elsevier.com/xml/linking-roles/grant-sponsor"}, "_": "National Science Foundation"}, {"#name": "__text__", "_": " under Grant No. "}, {"#name": "grant-number", "$": {"refid": "GS1", "id": "d1e1814"}, "_": "2008784"}, {"#name": "__text__", "_": "."}]}]}]}]}]}]}}