{"pii": "S1570870522001512", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e412", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e413"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e415", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e416", "view": "all"}, "_": "Full-duplex (FD) wireless communication improves the attainable spectral efficiency of the wireless network with the simultaneous transmission and reception over the same frequency channel at a single timeslot. However, the effect of self-interference (SI) and inter-user interference (IUI) become crucial to take into consideration compared to the current half-duplex system. Many researches have been studied to suppress the SI and IUI, to design the medium access control (MAC) protocol, and to propose resource management techniques for realizing the FD system and truly achieving the double transmission capacity in the network. In this paper, we propose a novel FD MAC protocol with a mixture of concurrent and sequential transmission scheme, namely FD-MCST, for maximizing the transmission capacity in multihop wireless networks. Through FD-MCST, the transmitting node can cooperatively share the transmission capacity status for maximizing the network capacity. As a result, numerical simulations reveal that the proposed FD-MCST can accomplish a higher achievable network capacity of up to 1.7 times and nearly twice the achievable throughput with a reasonable amount of achievable transmission overhead about 7.7%, compared to the existing FD MAC protocols."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e418", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e419"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e421", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e422", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e424"}, "$$": [{"#name": "list-item", "$": {"id": "d1e425"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e428", "view": "all"}, "_": "Cooperative mixture of concurrent and sequential transmission (MCST) scheme"}]}, {"#name": "list-item", "$": {"id": "d1e430"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e433", "view": "all"}, "_": "Basic relaying flow transmission with the idea of the relaying node concept"}]}, {"#name": "list-item", "$": {"id": "d1e435"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e438", "view": "all"}, "_": "FD medium access control protocol with MCST scheme"}]}]}]}]}]}]}}