{"pii": "S1573427722000145", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Over the last decades, the emerging paradigms, e.g., centralized mobile cloud computing (MCC), multi-access edge computing (MEC), and collaborative computing offloading (CCO), have attracted extensive attention in adaptive 5G low latency communication for Tactile Internet. Besides, a novel integrated wireless optical transport network emerges in access networks and supports joint fronthaul and backhaul services. Therefore, considering that the task offloading response time, the needs of proximity, and the ultra-dense 5G small cell deployment, a novelty hybrid cloudlet deployment scheme over fiber and wireless backhaul-aware infrastructure is created with efficient cost optimization in mind. In this work, the envisioned Fiber Wireless networks (FiWi) consists of optical backhaul and wireless fronthaul (i.e., integrated access network and backhaul link), whereby base stations (BSs) with fiber and wireless backhauls are referred as wired-BS (WBS) and unwired-BS (UBS), respectively. Therefore, to meet the quality of service (QoS) delay constraints, cloudlets can be deployed in either UBSs, WBS, or remote node (RN). However, we apply mixed-integer line programming (MILP) to resolve the convex optimization problem in terms of minimization deployment cost. Besides, we describe the QoS-aware hybrid cloudlet placement cost algorithm for WBS and UBS coverage areas against different network conditions. It was shown through experimental measurements that the proposed architecture can achieve the scalability in different deployment scenarios. Also, the dependency of minimization cloudlet deployment cost on variable network parameters in terms of user density, network framework, and network QoS can be validated."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Given the IBFD self-backhauling, we develop a hybrid cloudlet deployment paradigm over the FiWi backhaul-aware network infrastructure to provide all the UEs with enough total task service rate, and further reduce the hybrid cloudlet deployment cost and achieve the optimal numbers of VMs in different location-based cloudlet."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "We formulate an optimization hybrid cloudlet deployment cost problem with objective function and several constraint conditions. To discard some constraints, we reconstruct Lagrange functions and KKT condition to achieve the variables’ optimal solution. Therefore, we propose QoS-aware hybrid cloudlet placement solution for WBS and UBS coverage area aiming at achieving the optimal solution."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "We demonstrate that the superiority of the proposed QoS-aware hybrid cloudlet placement algorithm to the meta-Heuristic algorithm under different cell planning scenarios. Besides, we perform the parameter analytical by the effect of population density and QoS delay constrain on hybrid cloudlet deployment cost."}]}]}]}]}]}]}}