{"pii": "S1570870524002154", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e4298", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e4299"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e4301", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e4302", "view": "all"}, "_": "The phenomenon of urbanization, characterized by the migration of people from rural to urban areas, has led to an expansion of existing urban challenges while introducing new ones. Among these, mobility is a primary concern due to its far-reaching impacts on personal health, safety, social, economic, and environmental aspects. Information and communication technologies (ICT) have been identified as effective solutions to address these issues, leveraging the Internet of Things (IoT) and smart city infrastructure. However, the mainstream approach in smart cities is characterized by a vertical-siloed pattern, addressing individual problems (mobility, pollution, energy management, healthcare, safety, and security) in isolation, without actively engaging citizens, people, and communities as stakeholders."}, {"#name": "simple-para", "$": {"id": "d1e4304", "view": "all"}, "_": "This paper proposes a paradigm shift towards a holistic, multilateral approach to address mobility, incorporating diverse perspectives, stakeholder needs, and problem-solving strategies. By integrating smart city infrastructure, smart vehicles, and personal devices, an all-encompassing solution is implemented through direct interaction and cooperation between these entities. The resulting City-Vehicle Participatory-Opportunistic Cooperative Route Navigation system (CV POp-CoRN) enables the enforcement of mobility policy trade-offs, reconciling city, vehicle, and people requirements across various domains, including safety, emergency response, traffic management, travel time optimization, vehicle maintenance, pollution mitigation, and special event management. The paper presents the CV POp-CoRN framework, comprising route navigation policies, a heuristics for trading them off, the system design and architecture, and a model for assessing and demonstrating the effectiveness of the proposed approach and the feasibility of the solution."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e4306", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e4307"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e4309", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e4310", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e4312"}, "$$": [{"#name": "list-item", "$": {"id": "d1e4313"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e4316", "view": "all"}, "_": "Taxonomy definition of multi-objective/perspective urban route navigation policies."}]}, {"#name": "list-item", "$": {"id": "d1e4318"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e4321", "view": "all"}, "_": "Heuristic to identify RN policy trade-offs combining city and citizen-vehicle needs."}]}, {"#name": "list-item", "$": {"id": "d1e4323"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e4326", "view": "all"}, "_": "A Cloud-Fog-Edge framework to enforce cooperative policies from city to vehicle devices."}]}, {"#name": "list-item", "$": {"id": "d1e4328"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e4331", "view": "all"}, "_": "Presentation of a parametric model of the overall system."}]}, {"#name": "list-item", "$": {"id": "d1e4333"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e4336", "view": "all"}, "_": "Modelization of Smart City infrastructure enabling the CV POp-CoRN System."}]}]}]}]}]}]}}