{"pii": "S1574954114000831", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "This paper presents the application of Data Warehouse (DW) and On-Line Analytical Processing (OLAP) technologies to the field of water quality assessment. The European Water Framework Directive (DCE, 2000) underlined the necessity of having operational tools to help in the interpretation of the complex and abundant information regarding running waters and their functioning. Several studies have exemplified the interest in DWs for integrating large volumes of data and in OLAP tools for data exploration and analysis."}, {"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Based on free software tools, we propose an extensible relational OLAP system for the analysis of physicochemical and hydrobiological watercourse data. This system includes: (i) two data cubes; (ii) an Extract, Transform and Load (ETL) tool for data integration; and (iii) tools for OLAP exploration. Many examples of OLAP analysis (thematic, temporal, spatiotemporal, and multiscale) are provided. We have extended an existing framework with complex aggregate functions that are used to define complex analysis indicators. Additional analysis dimensions are also introduced to allow their calculation and also for purposes of rendering information. Finally, we propose two strategies to address the problem of summarizing heterogeneous measurement units by: (i) transforming source data at the ETL tier, and (ii) introducing an additional analysis dimension at the OLAP server tier."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "ab0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st9005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as9005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp9005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l9005"}, "$$": [{"#name": "list-item", "$": {"id": "u9005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p9030", "view": "all"}, "_": "The paper presents an extensible relational OLAP system for the analysis of complex watercourse data."}]}, {"#name": "list-item", "$": {"id": "u9010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p9035", "view": "all"}, "_": "A physico-chemical and an hydro-biological data cube are presented."}]}, {"#name": "list-item", "$": {"id": "u9015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p9040", "view": "all"}, "_": "Definitions for complex analysis indicators are given."}]}, {"#name": "list-item", "$": {"id": "u9020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p9045", "view": "all"}, "_": "The paper presents two strategies for dealing with the summarizability problem of heterogeneous measurement units."}]}, {"#name": "list-item", "$": {"id": "u9025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p9050", "view": "all"}, "_": "It gives many examples of OLAP analysis : thematic, temporal, spatio-temporal, multi-scale, etc."}]}]}]}]}]}]}}