{"pii": "S1571064522000124", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "id": "ab0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0070", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ls0010"}, "$$": [{"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0010", "view": "all"}, "_": "Network science provides a toolset to study the structural design of living systems."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0020", "view": "all"}, "_": "Interactions between cells and organs can be described with the network formalism."}]}, {"#name": "list-item", "$": {"id": "li0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0030", "view": "all"}, "_": "Advances in imaging techniques enable us to assess morphology of biological systems."}]}, {"#name": "list-item", "$": {"id": "li0040"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0040", "view": "all"}, "_": "Progress in tissue engineering advances the need for structural connectivity analysis."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "ab0020", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0080", "view": "all"}, "_": "Technological advances in imaging techniques and biometric data acquisition have enabled us to apply methods of network science to study the morphology and structural design of organelles, organs, and tissues, as well as the coordinated interactions among them that yield a healthy physiology at the level of whole organisms. We here review research dedicated to these advances, in particular focusing on networks between cells, the topology of multicellular structures, neural interactions, fluid transportation networks, and anatomical networks. The percolation of blood vessels, structural connectivity within the brain, the porous structure of bones, and relations between different anatomical parts of the human body are just some of the examples that we explore in detail. We argue and show that the models, methods, and algorithms developed in the realm of network science are ushering in a new era of network-based inquiry into the morphology and structural design of living systems in the broadest possible terms. We also emphasize that the need and applicability of this research is likely to increase significantly in the years to come due to the rapid progress made in the development of bioartificial substitutes and tissue engineering."}]}]}]}}