{"pii": "S1574119221000353", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e537"}, "$$": [{"#name": "section-title", "$": {"id": "d1e538"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e540"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e541"}, "_": "The study of self organized networks is considered a key element in developing the new generation of cellular networks. Mobile service providers are adopting new technologies such as small cells and precoding to deploy their networks according to 5G standards. As these type of technologies gain more importance and popularity, network self organization become a more essential function in operating the network resources. Self organized networks have been classified into three main categorizes: self optimization, self configuration, and self healing. The first two categories showed further development and research interest when compared to self-healing. Due to the high density nature of small cells, using massive antennas in the network, and their susceptibility to failures for various reasons, the demand for a clear self-healing process and architecture is deemed urgent. In this paper the current self-healing process in addition to the fault tolerance aspects for the future 5G are studied and a new process model for organizing the self-healing process is proposed. The new process model is meant to map the different functionalities needed to perform a successful self healing process. The model with the proposed descriptive network architecture aims to identify the different functions within the self-healing process model. In order to test the operation ability of the model, a new big data aspect is added to the network architecture to aid in analyzing the huge amount of data needed to efficiently perform the self-healing process. Results show that the proposed precoding technique in conjunction with the machine learning algorithm based on a decision tree model that uses empirical data collected from the network can identify the status of cells (healthy, congested or failing) and suitable self-healing procedures can be triggered to recover the cell accordingly."}]}]}]}}