{"pii": "S1570870524001537", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e689", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e690"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e692", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e693", "view": "all"}, "_": "A wireless multihop network (WMN) is set of wirelessly connected nodes without an aid of centralized infrastructure that can forward any packets via intermediate nodes by a multihop fashion. In the WMN, there are still some issues that need to be resolved, like due to any source node may choose an uncertainty path to send their packets through the multihop fashion and this leads to the performance of network capacity can degrade drastically. To solve this problem, in this research, we propose two novel path selection algorithms called SNR-based learning path selection (NLPS) algorithm and SINR-based learning path selection (INLPS) algorithm, which are incorporated with the deep reinforcement learning (DRL) to select the best multihop path from any source node to a destination node with highest end-to-end (E2E) throughput. Besides that, a factor graph (FG) approach and a nested lattice code (NLC) representation are used to reduce the computation time. According to the numerical studies with the NLC is applied, our simulation results reveal that the proposed NLPS and INLPS algorithms can improve the overall average network capacity up to 3.1 times and 10.5 times compared to FG, respectively. However, the overall average computation time are highly increased for NLPS and INLPS, i.e., about 0.627 s and 1.221 s, respectively compared to FG, which is about 0.006 s. In other words, both NLPS and INLPS algorithms can achieve high network capacity and moderate computation time."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e695", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e696"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e698", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e699", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e701"}, "$$": [{"#name": "list-item", "$": {"id": "d1e702"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e705", "view": "all"}, "_": "Proposing a novel fDRL scheme to optimize network capacity and reduce computation time in WMNs;"}]}, {"#name": "list-item", "$": {"id": "d1e707"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e710", "view": "all"}, "_": "Using the FG approach, the fDRL scheme selects the best root node and reduces DRL computation time; and"}]}, {"#name": "list-item", "$": {"id": "d1e712"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e715", "view": "all"}, "_": "Applying NLC to data transmission in tree-based WMNs reduces the total number of transmissions."}]}]}]}]}]}]}}