{"pii": "S1574954113000988", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "Computer-based remote monitoring of our environment is increasingly based on combining data derived from in-situ-sensors with data derived from remote sources, such as satellite images or CCTV. In such deployments it is necessary to continuously monitor the accuracy of each of the sensor data streams so that we can account for sudden failures of sensors, or errors due to calibration drive or biofouling. In multimedia information retrieval (MMIR), we search through archives of multimedia artefacts like video programs, by implementing several independent retrieval systems or agents, and we combine the outputs of each retrieval agent in order to generate an overall ranking. In this paper we draw parallels between these seemingly very different applications and show how they share several similarities. In the case of environmental monitoring we also need some mechanism by which we can establish the trust and reputation of each contributing sensor, though this is something we do not need in MMIR. In this paper we present an outline of a trust and reputation framework we have developed and deployed for monitoring the performance of sensors in a heterogeneous sensor network."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "ab0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st9005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as9005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp9005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l9005"}, "$$": [{"#name": "list-item", "$": {"id": "u9005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p9025", "view": "all"}, "_": "Environmental monitoring requires fusion of data from heterogeneous sensors."}]}, {"#name": "list-item", "$": {"id": "u9010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p9030", "view": "all"}, "_": "Multimedia information retrieval fuses output from heterogeneous search systems."}]}, {"#name": "list-item", "$": {"id": "u9015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p9035", "view": "all"}, "_": "There are parallels and differences between the kinds of data fusion needed."}]}, {"#name": "list-item", "$": {"id": "u9020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p9040", "view": "all"}, "_": "We present a framework for managing issues of trust and reliability of the sensors."}]}]}]}]}]}]}}