{"pii": "S163107051500198X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "ab0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0190", "view": "all"}, "$$": [{"#name": "__text__", "_": "The electromagnetic field exposure of the population due to wireless communications originates from both down-link and up-link emissions. Although the main contribution comes generally from the latter (e.g., higher by three to five orders of magnitude for the 2G), the former must be considered as well, because they are continual, and as contributions can be competitive for some cases (e.g., in femtocells). Sensor and exposimeter networks (NW) can be deployed by the operators themselves (to enrich feedback information from their own NW) or by independent external stakeholders such as regulatory agencies or local authorities. When sensors are directly worn by a user, body proximity effects – notably the "}, {"#name": "italic", "_": "masking"}, {"#name": "__text__", "_": " effect – can introduce significant errors in the ambient field measurement. A methodology of the statistical assessment of this harmful effect is proposed in this article. It is mainly based on electromagnetic simulations (and partly on measurements) of a triaxial sensor – composed of three orthogonal wideband probes devoted to the evaluation of the field components – placed at different positions of a set of whole body phantoms. The main original contribution of the proposed approach is that both the isolated sensor calibration procedure and the assessment of the measurement errors are based on statistical analyses accounting for the propagation environment. The quantitative results are obtained using statistical channel models for polarimetric and non-polarimetric measurements in various propagation scenarios. Some quantitative results examples are presented. Eventually, preliminary corrections schemes are proposed."}]}]}]}, {"#name": "abstract", "$": {"lang": "fr", "id": "ab0020", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Résumé"}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0200", "view": "all"}, "$$": [{"#name": "__text__", "_": "L'exposition de la population aux ondes électromagnétiques dues aux communications radio émane tant des émissions descendantes que montantes. Bien que la contribution dominante provienne généralement de ces dernières (supérieures de trois à cinq ordres de grandeur pour la 2G par exemple), les premières doivent également être prises en compte, notamment parce qu'elles sont permanentes, mais aussi parce que les deux contributions peuvent être compétitives dans certains cas (par exemple dans les "}, {"#name": "italic", "_": "femtocells"}, {"#name": "__text__", "_": "). Des réseaux de capteurs et d'exposimètres peuvent être déployés par les opérateurs eux-mêmes (leur permettant d'enrichir les informations remontées par leur propre réseau) ou par des acteurs extérieurs indépendants, tels que des organismes de contrôle réglementaire ou des collectivités locales. Si les capteurs sont directement portés par l'utilisateur, les effets de proximité du corps – notamment l'effet de masquage – peuvent introduire des erreurs très significatives dans la mesure du champ ambiant. Nous proposons dans cet article une méthodologie d'estimation statistique de cet effet néfaste. L'approche est majoritairement fondée sur des simulations électromagnétiques (et partiellement sur des mesures) d'un capteur triaxial – constitué de trois sondes large bande placées orthogonalement dédiées à la mesure des composantes du champ – placé à différentes positions de fantômes « corps entier ». L'originalité principale de cette contribution est qu'elle repose sur des analyses statistiques prenant en compte les conditions de propagation, que ce soit dans la procédure de calibration du capteur isolé ou dans l'évaluation des erreurs de mesure. Les résultats quantitatifs sont obtenus à partir de modèles statistiques de canaux, pour des mesures polarimétriques ou non, pour différents scénarios de propagation. Quelques résultats quantitatifs sont présentés. Pour terminer, des méthodes envisageables de correction encore à l'étude sont présentées."}]}]}]}]}}