{"pii": "S1631070515001917", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "ab0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0120", "view": "all"}, "_": "On-body communication technology development requires a better knowledge of antenna radiation and wave propagation along the body, in both near and far fields. Therefore, Green's functions associated with penetrable cylinders are briefly reviewed, considering frequencies at which the body is not much larger than the wavelength and with a particular attention given to the near fields. A unified approach based on current sheets is provided and an acceleration technique is proposed. This is validated with the help of an FDTD software, which also allows the analysis of non-canonical cross-sections. The properties of creeping waves launched by sources parallel and perpendicular to the body are studied, in particular from the point of view of their phase velocity, and a very simple fitting model is proposed. It is also explained how the Green function can be exploited to analyze antennas very efficiently with the help of an integral-equation approach."}]}]}, {"#name": "abstract", "$": {"lang": "fr", "id": "ab0020", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Résumé"}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0130", "view": "all"}, "_": "La technologie de communication corporelle nécessite une meilleure connaissance du rayonnement des antennes et de la propagation le long du corps humain, tant en champs proches qu'en champs lointains. Par conséquent, les fonctions de Green associées aux cylindres pénétrables sont brièvement revues pour des fréquences où le corps n'est pas beaucoup plus grand que la longueur d'onde, avec une attention particulière portée aux champs proches. Une approche unifiée, fondée sur des nappes de courant, est adoptée, et une technique d'accélération est proposée. Ceci est validé à l'aide d'un logiciel FDTD, qui permet aussi l'analyse de sections non canoniques. Les propriétés des ondes rampantes excitées par des sources parallèles et perpendiculaires au corps sont étudiées : en particulier, leur vitesse de phase. Un modèle d'interpolation très simple est proposé. Nous expliquons également comment les antennes en présence du corps peuvent être analysées en exploitant les fonctions de Green via la résolution d'équations intégrales."}]}]}]}}