{"pii": "S163107050800131X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "class": "author", "id": "aep-abstract-id5"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id6"}, "$$": [{"#name": "simple-para", "$": {"view": "all"}, "$$": [{"#name": "__text__", "_": "This article presents first the history of the optical fiber transport networks, from the introduction of the first high capacity systems in the 1990s to the 10 Gbit/s per channel WDM (Wavelength Division Multiplexing) systems deployed today, and the tremendous evolution of performance within this period. The effects of propagation in optical fibers and their consequences for optical system engineering, the architecture of today's optical transport networks, the choices made in France are recalled. We then have a look at the future of optical transport networks from an operator's point of view: the expected evolutions in terms of transmission system capacity and network architecture are presented. We conclude that capacity, transparency, and agility are the main drivers of the evolution of optical fiber transport systems and networks and that a lot of changes have yet to be expected in these domains during the next decade. "}, {"#name": "bold", "$$": [{"#name": "italic", "_": "To cite this article: M. Joindot, S. Gosselin, C. R. Physique 9 (2008)."}]}]}]}]}, {"#name": "abstract", "$": {"lang": "fr", "class": "author", "id": "aep-abstract-id7"}, "$$": [{"#name": "section-title", "_": "Résumé"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id8"}, "$$": [{"#name": "simple-para", "$": {"view": "all"}, "$$": [{"#name": "__text__", "_": "Cet article présente d'abord l'histoire des réseaux de transport à fibre optique, depuis l'introduction des premiers systèmes à grande capacité dans les années 1990, jusqu'aux systèmes actuels utilisant le multiplexage en longueur d'onde (WDM) à 10 Gbit/s par canal, et l'évolution fantastique des performances durant cette période. Les effets liés à la propagation dans les fibres et leurs conséquences sur l'ingénierie des systèmes optiques, l'architecture des réseaux de transport optiques actuels, les choix faits en France sont rappelés. Nous examinons ensuite l'avenir des réseaux de transport optiques du point de vue de l'opérateur : les évolutions attendues en termes de capacité des systèmes de transmission et d'architecture de réseaux sont présentées. Nous concluons que capacité, transparence et agilité sont les principaux moteurs de l'évolution des systèmes et réseaux de transport à fibre optique et que beaucoup de changements sont encore attendus dans ces domaines durant la prochaine décennie. "}, {"#name": "bold", "$$": [{"#name": "italic", "_": "Pour citer cet article : M. Joindot, S. Gosselin, C. R. Physique 9 (2008)."}]}]}]}]}]}}