{"pii": "S1631070508001461", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "class": "author", "id": "aep-abstract-id12"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id13"}, "$$": [{"#name": "simple-para", "$": {"view": "all"}, "$$": [{"#name": "__text__", "_": "The emergence of new devices and technologies introduces new trends and design issues for optical transport networks. The higher performance of transmission and switch systems enables the reduction of optoelectronic conversions in intermediate nodes with the introduction of transparency in the network. Simultaneously, the system of Automatic Switched Optical Networks (ASON) describes the rules for the construction of a network enabling cost reduction, above all for maintenance, and fast and automatic reconfiguration. Two axes have to evolve to make possible all these proprieties: the control plane and its relative set of protocols, to manage the network working for the network automation, and also the systems and tools enabling transparency and reconfigurability. In this article we focus on the second axis applied to an automatic transparent network. "}, {"#name": "bold", "$$": [{"#name": "italic", "_": "To cite this article: A. Morea et al., C. R. Physique 9 (2008)."}]}]}]}]}, {"#name": "abstract", "$": {"lang": "fr", "class": "author", "id": "aep-abstract-id14"}, "$$": [{"#name": "section-title", "_": "Résumé"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id15"}, "$$": [{"#name": "simple-para", "$": {"view": "all"}, "$$": [{"#name": "__text__", "_": "L'apparition de nouveaux dispositifs et de nouvelles technologies permet d'envisager de façon nouvelle la conception des réseaux de transport optiques. L'amélioration des performances des systèmes de transmission et de commutation a permis de s'affranchir de conversions optoélectronique dans les nœuds intermédiaires et a ainsi rendu possible l'introduction de la transparence dans les réseaux. En parallèle, le concept de Réseaux Optiques à Commutation Automatique (Automatic Switched Optical Networks (ASON)) définit les règles de fonctionnement d'un réseau favorisant la réduction des coûts, principalement les coûts de maintenance, une plus grande disponibilité, ainsi qu'une reconfiguration plus rapide et automatique du réseau. Pour mettre en œuvre ces propriétés, deux axes de recherche sont envisagés : le plan de contrôle et ses différents protocoles dédiés à la gestion du réseau pour le rendre automatique comme les systèmes et les outils apportant transparence et reconfigurabilité. Dans cet article, nous analysons ce second axe appliqué à un réseau transparent automatique. "}, {"#name": "bold", "$$": [{"#name": "italic", "_": "Pour citer cet article : A. Morea et al., C. R. Physique 9 (2008)."}]}]}]}]}]}}