{"pii": "S1665642314716025", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0060", "view": "all"}, "_": "AnaPro is software that solves direct anaphora in Spanish, specifically pronouns: it finds the noun or group of words to which the pronoun refers. It locates in the previous sentences the referent or antecedent which the pronoun replaces. An example of a direct anaphora solved is the pronoun “he” in the sentence “He is sad.” Much of the work on anaphora has been done for texts in English; thus, we specifically focus on Spanish documents."}, {"#name": "simple-para", "$": {"id": "spar0065", "view": "all"}, "_": "AnaPro directly supports text analysis (to understand what a document says), a non trivial task since there are different writing styles, references, idiomatic expressions, etc. The problem grows if the analyzer is a computer, because they lack “common sense” (which persons possess). Hence, before text analysis, its preprocessing is required, in order to assign tags (noun, verb,…) to each word, find the stems, disambiguate nouns, verbs, prepositions, identify colloquial expressions, identify and resolve anaphora, among other chores."}, {"#name": "simple-para", "$": {"id": "spar0070", "view": "all"}, "_": "AnaPro works for Spanish sentences. It is a novel procedure, since it is automatic (no user intervenes during the resolution) and it does not need dictionaries. It employs heuristics procedures to discover the semantics and help in the decisions; they are rather easy to implement and use limited knowledge. Nevertheless, its results are good (81% of correct answers, at least). However, more tests will give a better idea of its goodness."}]}]}, {"#name": "abstract", "$": {"id": "abs0010", "lang": "es", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Resumen"}, {"#name": "abstract-sec", "$": {"id": "abst0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0075", "view": "all"}, "_": "AnaPro es un software que resuelve problemas con anáforas directas en español, especialmente pronombres: la herramienta encuentra el sustantivo o grupo de palabras al cual se refiere el pronombre. Localiza en oraciones previas la referencia o antecedente y lo reemplaza por el pronombre que le corresponde. Un ejemplo de anáfora directa resuelta es el pronombre “él”, en la oración “Él está triste”."}, {"#name": "simple-para", "$": {"id": "spar0080", "view": "all"}, "_": "AnaPro apoya directamente el análisis de textos (para entender lo que el documento dice), tarea no trivial ya que existen diferentes formas y estilos de escribir, referenciar, expresiones regionales (mexicanismos, argentinismos, etc.). Todavía se complica más si el analizador es una máquina porque no tiene “sentido común” (que cualquier persona puede tener). Así, antes de analizar el texto, se requiere pre-procesarlo para asignar etiquetas (sustantivos, y verbos, entre otros) a cada palabra, encontrar las derivaciones, desambiguar sustantivos, verbos, preposiciones, identificar expresiones coloquiales, identificar y resolver anáforas, entre otras tareas."}, {"#name": "simple-para", "$": {"id": "spar0085", "view": "all"}, "$$": [{"#name": "__text__", "_": "AnaPro trabaja con oraciones en español. Es un proceso novedoso porque es totalmente automático (no requiere la intervención de un usuario) y tampoco necesita de diccionarios. Emplea un procedimiento heurístico para descubrir la semántica y apoyarse en las decisiones que debe de tomar. Ha resultado ser bueno (con un 81–100% de aciertos); sin embargo, más ejemplos nuevos darán mejor idea de su desempeño."}, {"#name": "anchor", "$": {"id": "p15"}}]}]}]}]}}