{"pii": "S1665642314716177", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "A new class of applications can now be envisaged with the emergence of both mobile ad hoc computing and ubiquitous computing, which imposes a number of new unsolved challenges. Examples of such applications include automatic car control systems and air traffic control systems. Applications of such kind have real-time constraints and are characterised by being highly mobile and proactive, i.e. able to operate without human intervention. Moreover, this kind of applications requires multiple-source multicasting. However, current approaches mainly focus on offering support for continuous flows in low mobile environments where single-source multicasting is assumed. In this paper, we present the QoSMMANET ("}, {"#name": "bold", "_": "QoS M"}, {"#name": "__text__", "_": "anagement in "}, {"#name": "bold", "_": "M"}, {"#name": "__text__", "_": "obile Ad hoc "}, {"#name": "bold", "_": "N"}, {"#name": "__text__", "_": "etworks) framework, which offers QoS support for real-time event systems in highly mobile ad hoc environments. Our approach is validated by a number of experiments carried out in the ns-2 network simulator."}]}]}]}, {"#name": "abstract", "$": {"id": "abs0010", "lang": "es", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0015"}, "_": "Resumen"}, {"#name": "abstract-sec", "$": {"id": "abst0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0010", "view": "all"}, "_": "Una nueva clase de aplicaciones ahora puede ser prevista con la aparición tanto de la computación Ad-hoc móvil y la computación ubicua, que impone una serie de nuevos desafíos sin resolver. Ejemplos de tales aplicaciones son sistemas de control automático de automóviles y sistemas de control de tráfico aéreo. Aplicaciones de este tipo tienen restricciones de tiempo real y son caracterizadas por ser altamente móviles y activas, es decir, capaz de operar sin intervención humana. Además, este tipo de aplicaciones requiere una multidifusión con múltiples fuentes. Sin embargo, los enfoques actuales se centran principalmente en ofrecer soporte a flujos continuos en ambientes de baja movilidad donde se asume una multidifusión con una sola fuente. En este artículo, presentamos el QoSMMANET (QoS Management in Mobile Ad hoc Networks) framework, el cual ofrece soporte en calidad de servicio (QoS) para sistemas de eventos en tiempo real en entornos Ad-hoc altamente móviles. Nuestro enfoque ha sido validado por una serie de experimentos llevados a cabo en el simulador de red NS-2."}]}]}]}}