{"pii": "S167420522200185X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Plants have evolved a sophisticated set of mechanisms to adapt to drought stress. Transcription factors play crucial roles in plant responses to various environmental stimuli by modulating the expression of numerous stress-responsive genes. However, how the crosstalk between different transcription factor families orchestrates initiation of the key transcriptional network and the role of posttranscriptional modification of transcription factors, especially in cellular localization/trafficking in response to stress in rice, remain still largely unknown. In this study, we isolated an "}, {"#name": "italic", "_": "Osmybr57"}, {"#name": "__text__", "_": " mutant that displays a drought-sensitive phenotype through a genetic screen for drought stress sensitivity. We found that OsMYBR57, an MYB-related protein, directly regulates the expression of several key drought-related "}, {"#name": "italic", "_": "OsbZIPs"}, {"#name": "__text__", "_": " in response to drought treatment. Further studies revealed that OsMYBR57 interacts with a homeodomain transcription factor, OsHB22, which also plays a positive role in drought signaling. We further demonstrate that OsFTIP6 interacts with OsHB22 and promotes the nucleocytoplasmic translocation of OsHB22 into the nucleus, where OsHB22 cooperates with OsMYBR57 to regulate the expression of drought-responsive genes. Our findings have revealed a mechanistic framework underlying the OsFTIP6-OsHB22-OsMYBR57 module-mediated regulation of drought response in rice. The OsFTIP6-mediated OsHB22 nucleocytoplasmic shuttling and OsMYBR57-OsHB22 regulation of "}, {"#name": "italic", "_": "OsbZIP"}, {"#name": "__text__", "_": " transcription ensure precise control of expression of "}, {"#name": "italic", "_": "OsLEA3"}, {"#name": "__text__", "_": " and "}, {"#name": "italic", "_": "Rab21"}, {"#name": "__text__", "_": ", and thereby regulate the response to water deficiency in rice."}]}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0015", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "__text__", "_": "OsMYBR57 and OsHB22 interact with each other and synergistically regualte the expression of several "}, {"#name": "italic", "_": "OsbZIP"}, {"#name": "__text__", "_": " genes in response to drought stress. OsFTIP6 interacts with OsHB22 and promotes its translocation from the cytoplasm to the nucleus. The OsFTIP6-mediated OsHB22 nucleocytoplasmic shuttling and OsMYBR57-OsHB22-mediated regulation of "}, {"#name": "italic", "_": "OsbZIP"}, {"#name": "__text__", "_": " transcription ensure precise control of expression of "}, {"#name": "italic", "_": "OsLEA3"}, {"#name": "__text__", "_": " and "}, {"#name": "italic", "_": "Rab21"}, {"#name": "__text__", "_": " and thereby regulate the response to water deficit in rice."}]}]}]}]}}