{"pii": "S1674205219300589", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Organ function is at least partially shaped and constrained by the organization of their constituent cells. Extensive investigation has revealed mechanisms explaining how these patterns are generated, with less being known about their functional relevance. In this paper, a methodology to discretize and quantitatively analyze cellular patterning is described. By performing global organ-scale cellular interaction mapping, the organization of cells can be extracted and analyzed using network science. This provides a means to take the developmental analysis of cellular organization in complex organisms beyond qualitative descriptions and provides data-driven approaches to inferring cellular function. The bridging of a structure–function relationship in hypocotyl epidermal cell patterning through global topological analysis provides support for this approach. The analysis of cellular topologies from patterning mutants further enables the contribution of gene activity toward the organizational properties of tissues to be linked, bridging molecular and tissue scales. This systems-based approach to investigate multicellular complexity paves the way to uncovering the principles of complex organ design and achieving predictive genotype–phenotype mapping."}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs5515", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec5515", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara5515", "view": "all"}, "_": "Viewing plant organs as complex systems of interacting cells provides the opportunity to quantitatively investigate their properties using network science. Both cellular function and gene expression can be predicted at single cell resolution by understanding the principles of organ design."}]}]}]}}