{"pii": "S1674862X24000028", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The fingerprinting-based approach using the wireless local area network (WLAN) is widely used for indoor localization. However, the construction of the fingerprint database is quite time-consuming. Especially when the position of the access point (AP) or wall changes, updating the fingerprint database in real-time is difficult. An appropriate indoor localization approach, which has a low implementation cost, excellent real-time performance, and high localization accuracy and fully considers complex indoor environment factors, is preferred in location-based services (LBSs) applications. In this paper, we proposed a fine-grained grid computing (FGGC) model to achieve decimeter-level localization accuracy. Reference points (RPs) are generated in the grid by the FGGC model. Then, the received signal strength (RSS) values at each RP are calculated with the attenuation factors, such as the frequency band, three-dimensional propagation distance, and walls in complex environments. As a result, the fingerprint database can be established automatically without manual measurement, and the efficiency and cost that the FGGC model takes for the fingerprint database are superior to previous methods. The proposed indoor localization approach, which estimates the position step by step from the approximate grid location to the fine-grained location, can achieve higher real-time performance and localization accuracy simultaneously. The mean error of the proposed model is 0.36 ​m, far lower than that of previous approaches. Thus, the proposed model is feasible to improve the efficiency and accuracy of Wi-Fi indoor localization. It also shows high-accuracy performance with a fast running speed even under a large-size grid. The results indicate that the proposed method can also be suitable for precise marketing, indoor navigation, and emergency rescue."}]}]}]}}