{"pii": "S1672022921002254", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "The Brodmann area (BA)-based map is one of the most widely used cortical maps for studies of human brain functions and in clinical practice; however, the molecular architecture of BAs remains unknown. The present study provided a global multiregional proteomic map of the human "}, {"#name": "bold", "_": "cerebral cortex"}, {"#name": "__text__", "_": " by analyzing 29 BAs. These 29 BAs were grouped into 6 clusters based on similarities in proteomic patterns: the motor and sensory cluster, vision cluster, auditory and Broca’s area cluster, Wernicke’s area cluster, "}, {"#name": "bold", "_": "cingulate cortex"}, {"#name": "__text__", "_": " cluster, and heterogeneous function cluster. We identified 474 cluster-specific and 134 BA-specific signature proteins whose functions are closely associated with specialized functions and disease vulnerability of the corresponding cluster or BA. The findings of the present study could provide explanations for the functional connections between the anterior cingulate cortex and "}, {"#name": "bold", "_": "sensorimotor cortex"}, {"#name": "__text__", "_": " and for anxiety-related function in the sensorimotor cortex. The brain transcriptome and proteome comparison indicates that they both could reflect the function of cerebral cortex, but show different characteristics. These proteomic data are publicly available at the Human Brain Proteome Atlas ("}, {"#name": "inter-ref", "$": {"xmlns:xlink": true, "href": "http://www.brain-omics.com", "type": "simple", "id": "ir010"}, "_": "www.brain-omics.com"}, {"#name": "__text__", "_": "). Our results may enhance our understanding of the molecular basis of brain functions and provide an important resource to support human brain research."}]}]}]}]}}