{"pii": "S1673852722000066", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Translational regulation, especially tissue- or cell type-specific gene regulation, plays essential roles in plant growth and development. Thermo-sensitive genic male sterile (TGMS) lines have been widely used for hybrid breeding in rice ("}, {"#name": "italic", "_": "Oryza sativa"}, {"#name": "__text__", "_": "). However, little is known about translational regulation during reproductive stage in TGMS rice. Here, we use translating ribosome affinity purification (TRAP) combined with RNA sequencing to investigate the reproductive tissue-specific translatome of TGMS rice expressing FLAG-tagged ribosomal protein L18 (RPL18) from the germline-specific promoter "}, {"#name": "italic", "_": "MEIOSIS ARRESTED AT LEPTOTENE1"}, {"#name": "__text__", "_": " ("}, {"#name": "italic", "_": "MEL1"}, {"#name": "__text__", "_": "). Differentially expressed genes at the transcriptional and translational levels are enriched in pollen and anther-related formation and development processes. These contain a number of genes reported to be involved in tapetum programmed cell death (PCD) and lipid metabolism during pollen development and anther dehiscence in rice, including several encoding transcription factors and key enzymes, as well as several long non-coding RNAs (lncRNAs) that potentially affect tapetum and pollen-related genes in male sterility. This study represents the comprehensive reproductive tissue-specific characterization of the translatome in TGMS rice. These results contribute to our understanding of the molecular basis of sterility in TGMS rice and will facilitate further genetic manipulation of TGMS rice in two-line breeding systems."}]}]}]}]}}