{"pii": "S167477552030072X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The flow properties of geomechanically generated discrete fracture networks are examined in the context of channelling. Fracture networks are generated by growing fractures in tension, modelling the low permeability rock as a linear elastic material. Fractures are modelled as discrete surfaces which grow quasi-statically within a three-dimensional (3D) volume. Fractures may have their locations specified as a simulation input, or be generated as a function of damage, quantified using the local variation in equivalent strain. The properties of the grown networks are shown to be a product of in situ stress, relative orientation of initial flaws, and competitive process of fracture interaction and growth. Fractures grow preferentially in the direction perpendicular to the direction of maximum tension and may deviate from this path due to mechanical fracture interaction. Flow is significantly channelled through a subset of the fractures in the full domain, consistent with observations of other real and simulated fractures. As the fracture networks grow, small changes in the geometry of the fractures lead to large changes in the locations and scale of primary flow channels. The flow variability and formation of channels are examined for two growing networks, one with a fixed amount of fractures, and another with nucleating fractures. The interaction between fractures is shown to modify the local stress field, and in turn the aperture of the fractures. Pathways for single-phase flow are the results of hydro-mechanical effects in fracture networks during growth. These are the results of changes to the topology of the network as well as the result of mechanical self-organisation which occurs during interaction leading to growth and intersection."}]}]}]}}