{"pii": "S1746809424003641", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "A method focusing on the sitting area pressures for classifying sitting postures."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Double-checked tagged database of three complex sitting postures."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Transfer Learning approach to interpret pressure maps of different systems."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "This study aimed to identify correct sitting postures during prolonged periods using a pressure mapping system on the seat along with Convolutional Neural Networks (CNN). The study was conducted in three stages. In the first stage, twenty-two volunteers participated to obtain a dataset of pressure maps of three correct postures (flat, short lordosis, and long lordosis) using two pressure mapping systems and validating with two methods. This involved angle measurement through an Inertial Measurement Unit (IMU) system and image recognition. In the second stage, a CNN model was trained using data from the first stage that represented each posture, and then Transfer Learning was implemented using a different pressure mapping system. In the third stage, the system was used for long-term monitoring based on the model, and feedback on the number of correct postures was provided to two healthy individuals during prolonged sitting periods for at least 2 h. The system provided feedback on posture recognition to the participants. Additionally, the participants evaluated their experience with the system using a Likert-5 questionnaire. The results showed that the system accurately identified the three postures with an accuracy of 0.854, precision of 0.856, and recall of 0.854. The study found that the data collection methodology was non-invasive and unobtrusive. Moreover, the participants found the system’s feedback understandable and helpful in improving their posture. The approach presented in this study has the potential to facilitate further research on sitting posture since it can be easily adapted to various pressure mapping systems without altering the methodology."}]}]}]}}