{"pii": "S1751731123002185", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Missing values are common in data collection on farms."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Data imputation is a helpful technique to cope with missing values."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "A total of 13 imputation methods were applied to compare."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Random Forest method performed better than other imputation methods."}]}, {"#name": "list-item", "$": {"id": "o0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "The method reported in the current study may improve downstream on-farm data analyses."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Nowadays, vast amounts of data representing feed intake, growth, and environmental impact of individual animals are being recorded in on-farm settings. Despite their apparent use, data collected in real-world applications often have missing values in one or several variables, due to reasons including human error, machine error, or sampling frequency misalignment across multiple variables. Since incomplete datasets are less valuable for downstream data analysis, it is important to address the missing value problem properly. One option may be to reduce the dataset to a subset that contains only complete data, but considerable data may be lost via this process. The current study aimed to compare imputation methods for the estimation of missing values in a raw dataset of dairy cattle including 454 553 records collected from 629 cows between 2009 and 2020. The dataset was subjected to a cleaning process that reduced its size to 437 075 observations corresponding to 512 cows. Missing values were present in four variables: concentrate DM intake ("}, {"#name": "bold", "_": "CDMI"}, {"#name": "__text__", "_": ", missing percentage = 2.30%), forage DM intake ("}, {"#name": "bold", "_": "FDMI"}, {"#name": "__text__", "_": ", 8.05%), milk yield ("}, {"#name": "bold", "_": "MY"}, {"#name": "__text__", "_": ", 15.12%), and BW (64.33%). After removing all missing values, the resulting dataset (n = 129 353) was randomly sampled five times to create five independent subsets that exhibit the same missing data percentages as the cleaned dataset. Four univariate and nine multivariate imputation methods (eight machine learning methods and the MissForest method) were applied and evaluated on the five repeats, and average imputation performance was reported for each repeat. The results showed that Random Forest was overall the best imputation method for this type of data and had a lower mean squared prediction error and higher concordance correlation coefficient than the other imputation methods for all imputed variables. Random Forest performed particularly well for imputing CDMI, MY, and BW, compared to imputing FDMI."}]}]}]}]}}