{"pii": "S1865921722002288", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Zusammenfassung"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "Die Betrachtung verschiedener versorgungsbezogener Daten, wie zum Beispiel der Patient:innen-zufriedenheit, kann für eine Gesundheitseinrichtung wichtige Informationen zur Verbesserung des Angebots beinhalten. Durch eine regelmäßige und automatische Erhebung dieser Daten im Internet kann Zeit und Geld gespart werden. Diese Datenerhebung kann mithilfe von Web Scraping erfolgen. Web Scraping ist für die Erhebung und Verknüpfung von (Sekundär-)Daten aus dem Internet sehr gut geeignet. In diesem Beitrag wird eine niedrigschwellige Möglichkeit für das Web Scraping illustriert: Web Scraping mit der kommerziellen Software OutWit. Diese Methode ist auch für Forscher:innen ohne Erfahrung im Bereich des Web Scrapings geeignet. Nach einem Web Scraping können bei quantitativen Daten klassische Methoden der Statistik oder bei qualitativen Daten Methoden der qualitativen Inhaltsanalyse genutzt werden. Vor einer Datenerhebung mithilfe von Web-Scraping-Verfahren sollten rechtliche Rahmenbedingungen für das individuelle Forschungsprojekt geklärt werden, und es sollte eine ethische Betrachtung stattfinden, denn nicht immer ist das automatisierte Auslesen von Daten mit den geltenden Nutzungsbedingungen der jeweiligen Datenhalter vereinbar."}]}]}, {"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Reviewing various care-related data, such as patient satisfaction, can provide valuable information for a health care organization to improve its services. Regular and automatic data collection of internet data can save time and money. This data collection can be performed using web scraping. Web scraping is well-suited for collecting and linking (secondary) data from the internet. In this paper, a low-threshold option for web scraping is illustrated: Web scraping using the commercial software OutWit. This method is also suitable for researchers with no experience in web scraping. Following web scraping, classical statistical methods can be used for quantitative data or qualitative content analysis for qualitative data. Before collecting data using web scraping methods, the legal framework for the individual research project should be clarified. Additionally, ethical considerations should be addressed because the automated extraction of data is not always compatible with the respective data holder’s applicable terms of use."}]}]}]}}