{"pii": "S1877050924020994", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara001", "view": "all"}, "_": "With the development of Internet and AI technology, university education is facing more and more challenges and opportunities. In this paper, an intelligent learning solution based on deep neural network (DNN) and WeChat applet is proposed to solve the problems of insufficient information acquisition and difficult to meet the personalized learning needs in the learning process of college professional basic courses. To start, we construct a comprehensive knowledge map for foundational university courses across various majors utilizing deep learning techniques. This map encompasses key concepts and interconnections spanning disciplines such as mathematics, physics, and computer science. Subsequently, we devise and deploy an intelligent recommendation algorithm leveraging DNN architecture. Drawing insights from user historical data and the intricate subject interrelations within the knowledge map, our algorithm tailors personalized recommendations for learning resources. Integrating this intelligent recommendation system into the WeChat applet platform, we realize a dynamic resource recommendation service tailored to university students' foundational coursework. Empirical findings demonstrate the superior performance of our algorithm over traditional methods, showcasing enhanced accuracy, recall rates, and F1 values. Notably, users benefit from an improved recommendation efficacy and overall learning experience. This research offers a novel framework for advancing the personalized and intelligent facets of university education, bearing both theoretical significance and practical implications."}]}]}]}}