{"pii": "S1877050919314796", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0084", "view": "all"}, "_": "The multidisciplinary textual-data are often disorganized and misinterpreted in many documents, which can obscure the information retrieval and its interpretation in company networks and even the World Wide Web. Managing textual information in particular with large-size alphanumeric data sources is challenging and at times can preclude the prompt delivery of good quality document services to diverse customers. Optimizing the words, sentences and alphanumeric characters of a script is the purpose of research, without losing intelligibility, semantics, perception, content flow and the contextual scenarios, represented as dimensions. We interpret the manuscript as a document ecosystem, within which different dimensions are construed. We choose different lexes, sentences, paragraphs and pages that possess frequent alphanumeric characters, interpreted in multiple domains and contexts. The ontologies of alphanumeric textual-data dimensions and their metaphors are presented in several data schemas, connecting various contexts of document ecosystems. The domain ontologies that can deliver text-mining, the semantic and schematic information of textual data, can expedite the textual-data integration process in the multidimensional warehouse modelling procedure. Diverse views and contexts that are generic within the document ecosystems are analysed for contextual knowledge. The ontologically structured document ecosystems that can facilitate more legibility and reproducibility to a variety of document designers are research outcomes. Data analysts, text mining experts and document managers can benefit the current research."}]}]}]}}