{"pii": "S1877050920308188", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0150", "view": "all"}, "_": "With the dawn of the information age, the number of choices that each person has to make each day has seen an explosive growth. Every minute, users are bombarded with so many different options for everything user do, from buying clothes to watching TV, that one live in a state of constant information overload, feeling stressed out by this imposed free will then be liberated by it. One ways in which user have now become used to mitigating this constant barrage of incessant information is by the usage of Recommender Systems. These systems are software components that use some form of rating provided by a user to generate recommendations for items that they may be interested in. Unfortunately, recommender systems face a major problem called the “Cold – Start problem”, which essentially means that a recommender system in an online setting has no information about the user when the user first signs up. Many approaches have been proposed to solve this, but the one this paper shall be taking is to use information from social networks, specifically Twitter, to get this initial information. Implicitly infer user interest with good accuracy is proposed here and this understanding of interests can later be updated by observing user actions as they interact with the system. We leverage the power of the categorical information stored in the Wikipedia database to allow us to assign relative weights to entities that a user follows on Twitter. This proposed approach for creating the rating vector for each user by mining the Twitter account of the users’ is evaluated using the RMSE and MAE metrics."}]}]}]}}