{"pii": "S1871519221001128", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "role": "background", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "_": "Digital media such as Apps, Internet and social networks have become integral parts of the maternity experience for more than a decade. These media can support or undermine women’s experiences as has been shown in digital sociology research. Using Immediate Messaging Applications to provide information and support to women during the perinatal period is an emerging practice."}]}, {"#name": "abstract-sec", "$": {"id": "abst0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0015"}, "_": "Aim"}, {"#name": "simple-para", "$": {"id": "spar0010", "view": "all"}, "_": "This article analyses how health and social care professionals – with a focus on community midwives – and women communicate between postpartum home visits through Immediate Message Applications in Switzerland."}]}, {"#name": "abstract-sec", "$": {"id": "abst0015", "role": "materials-methods", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0020"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "spar0015", "view": "all"}, "_": "A socio-anthropological study that relied on qualitative methods including semi-directed interviews with midwives and health and social care professionals (n = 30) and immigrant women (n = 20)."}]}, {"#name": "abstract-sec", "$": {"id": "abst0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0025"}, "_": "Findings"}, {"#name": "simple-para", "$": {"id": "spar0020", "view": "all"}, "_": "Since the introduction of Immediate Messaging Applications, women and their carer converse more regularly between post-partum home visits. Women send questions, pictures and videos to them, often allowing swift responses to their concerns. Midwives encounter difficulties answering women’s questions when they cannot be solved through quick communication (e.g. infant crying). To them, texting frequency forms a clinical clue to women’s mental health. Not all women contact their carer through digital messages; immigrant women are less likely to know and use this service."}]}, {"#name": "abstract-sec", "$": {"id": "abst0025", "role": "conclusion", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0030"}, "_": "Discussion and conclusion"}, {"#name": "simple-para", "$": {"id": "spar0025", "view": "all"}, "_": "Immediate Messaging Applications form a promising communication tool, complementary to home visits, and contribute to woman-centered care and continuity of care. As an emergent practice, it has not been framed by a guideline yet. Policy makers and practitioners should ensure that its use does not contribute to unequal access to care."}]}]}]}}