{"pii": "S1877050914011752", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "This paper proposes a novel approach to explore collection of documents in the maritime domain. Documents are reports created by experts in charge of analyzing suspicious behaviors in the maritime field. The goal of this work is twofold: it improves knowledge exploitation and reuse for situation assessment and it provides support to analysts in charge of incident interpretation. Semantic integration is at the core of our navigation model. Semantic integration is the process of interrelating information from diverse sources, by using a commonly adopted description of the application field. For this work, reports are not enriched by semantic annotations, but they are processed in order to represent each document in the form of vectors of numerical values and sets of concepts augmented by corresponding weight values. Weight values are used to take into account the relevance of each concept for a given document. In a similar way, user queries are defined by numerical values and sets of ontological entities. The navigation model implements two information retrieval strategies: "}, {"#name": "italic", "_": "finding"}, {"#name": "__text__", "_": " retrieves specific events occurring in specific areas while "}, {"#name": "italic", "_": "explaining"}, {"#name": "__text__", "_": " highlights clues to explain abnormal vessel behaviors. Search results are provided by a ranking scheme based on both the semantic similarity between document and query and values of weights. Supported with complex domain knowledge, our navigation model o"}, {"#name": "italic", "_": "ff"}, {"#name": "__text__", "_": "ers intelligent means to assist experts while exploring the collection of interpretation reports. The paper also presents remarks on model validation and evaluation of its performances."}]}]}]}]}}