{"pii": "S1877050922014946", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara001", "view": "all"}, "_": "In view of the current demand of heterogeneous, cross domain, many service platforms, wide distribution and low-cost resource sharing platform construction of agricultural public welfare information service resources, this paper puts forward a set of standardized and orderly data acquisition and interpretation sharing methods. Methods combined with the characteristics of multi domain resource sharing, metadata semantic modeling based on cognition is proposed to establish the mapping between metadata cognition and metadata semantics to resource description model, build a basic framework of resource sharing, extract the minimum core metadata required for resource sharing, define the basic rules for the existence of resource sharing data, and give the resource sharing description model. At the same time, in order to clearly explain the semantic annotation information in the model, the construction method of shared resource semantics is introduced. In order to reduce the difficulty of resource description, sharing and publishing on heterogeneous platforms, a shared resource description tool based on \"resource sharing semantic description model\" is introduced. This method combines the advantages of existing methods. At the same time, through the production of description tools and the introduction of semantics, the development difficulty and development volume of each service platform are reduced, the development cost is saved, the data sharing efficiency is improved, and the requirements of low-cost, cross domain, light dependence, resource readability and machine solvability for the construction of agricultural public welfare information service resource sharing platform are better solved."}]}]}]}}