{"pii": "S1877750324002096", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e688", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e689"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e691", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e692", "view": "all"}, "_": "The brain is a complex system with functional and structural networks. Different neuroimaging methods have been developed to explore these networks, but each method has its own unique strengths and limitations, depending on the signals they measure. Combining techniques like electroencephalography (EEG) and functional near-infrared spectroscopy (fNIRS) has gained interest, but understanding how the information derived from these modalities is related to each other remains an exciting open question. The multilayer network model has emerged as a promising approach to integrate different sources data. In this study, we investigated the hemodynamic and electrophysiological data captured by fNIRS and EEG to compare brain network topologies derived from each modality, examining how these topologies vary between resting state (RS) and task-related conditions. Additionally, we adopted the multilayer network model to integrate EEG and fNIRS data and evaluate the benefits of combining multiple modalities compared to using a single modality in capturing characteristic brain functioning."}, {"#name": "simple-para", "$": {"id": "d1e694", "view": "all"}, "_": "A small-world network structure was observed in the rest, right motor imagery, and left motor imagery tasks in both modalities. We found that EEG captures faster changes in neural activity, thus providing a more precise estimation of the timing of information transfer between brain regions in RS. fNIRS provides insights into the slower hemodynamic responses associated with longer-lasting and sustained neural processes in cognitive tasks. The multilayer approach outperformed unimodal analyses, offering a richer understanding of brain function. Complementarity between EEG and fNIRS was observed, particularly during tasks, as well as a certain level of redundancy and complementarity between the multimodal and the unimodal approach, which depends on the modality and the specific brain state. Overall, the results highlight differences in how EEG and fNIRS capture brain network topology in RS and tasks and emphasize the value of integrating multiple modalities for a comprehensive view of brain connectivity and function."}]}]}]}}