{"pii": "S1877050922024486", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara001", "view": "all"}, "_": "This research addresses one of the key challenges facing the horticulture industry, disruption. Disruption both on farm and post-harvest through the supply chain. Caused by exogenous factors such as wars, trade sanctions and the Covid-19 pandemic, the small and medium sized horticulture farming businesses which represent most of the supply to the sector are faced with daily decisions in attempts to mitigate the disruption. A research gap was identified in the data available to these horticulture farmers to inform their supply chain decisions. Using action design research methodology, the gap and problem were defined with a stakeholder group of subject matter experts from the horticulture industry in Australia. Through ongoing cycles of feedback with this group, a framework, the Horticulture Supply Chain Analytics (HSCA) framework was developed with a supporting IT (Information Technology) artifact. The stakeholder group strongly recommended that a level of autonomy be developed in the solution as the farmers are time poor, requiring actionable insights from the supply chain data. A novel concept was developed to achieve this level of autonomy using geospatial enhancements to the supply chain event logs, generated by the GPS (Global Position System) trackers, to allow for autonomous supply chain monitoring and compliance checking. A banana farm was selected for evaluation of the framework, which required deployment of IoT (Internet of Things) sensors, both on the farm and the consignments being transported to customers. The HSCA framework was found to deliver actionable insights for the banana business, improving on farm productivity, reduction in key input costs as well as improving post-harvest quality and yield. Results and learnings from the banana farm use case have been captured and generalized for the horticulture sector."}]}]}]}}