{"pii": "S187661021732283X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0001", "view": "all"}, "_": "Fluctuating power production in combined heat and power (CHP) plants may cause unwanted disturbances in district heating (DH) systems. DH -systems are often automated, however, supply temperature (ST) is still primarily chosen manually by the operator because of uncertain heat demand in near future and uncertain delay from heat supplier to consumers. In this work, future heat demand and return water temperature are predicted based on outdoor temperature forecast and process data history using neural network estimators. Consumers in network are presumed to be similar, but their distances from production site vary thus creating a distribution of range. Delay is modelled as a distribution function based on the distances between heat consumers and the suppliers, which weights the ST from last few hours calculating the average ST received by the consumers. The derived function models how the temperatures develop along the network. A brute force optimizer was developed to minimize pumping costs and heat losses and to smooth temperature gradient originated thermal stresses. System delays are fixed during an optimization cycle, and after each iteration, the delays are updated according to new system flowing rates. The resulting ST curve is a discrete curve that cuts the heat load peaks by charging and discharging the energy content of the DH network. Optimization keeps the ST and flow rates in control and stabilizes the network smoothly and efficiently after disturbances. Optimization is demonstrated by using case data of one year from a district heating system in Finland."}]}]}]}}