{"pii": "S1877050922020853", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara001", "view": "all"}, "_": "Data mining is the hearth of most modern day cyber physical deployments. Due to such large-scale use cases, selection of these models is of primary importance while developing cyber physical systems. But mining models are highly variant in terms of their internal performance characteristics, which makes it difficult for researchers to identify optimum models for their application-specific & performance-specific deployments. Moreover, these data mining models also vary in terms of their internal qualitative & quantitative performance measures. These measures include, precision, accuracy, recall, sensitivity, deployment cost, computational complexity, scalability, etc. Due to such a wide variation in performance, it is ambiguous for researchers to identify optimum models for their application deployments. To reduce this ambiguity, a comparison of these models in terms of their performance-level nuances, function advantages, deployment-specific limitations, and context-specific future scopes is described in this text. Researchers will be able to identify optimum models for their functional-specific deployments. It was observed that Neural Network (NN) based models including Convolutional NNs, Region based NNs, Recurrent NNs, etc. showcased better functional characteristics when compared with linear mining models for large-scale use cases. To further simplify model selection, this text compared the underlying models in terms of their performance metrics including accuracy, complexity, scalability, etc. Depending on this performance-specific evaluation, it was observed that bioinspired models when combined with deep learning techniques can outperform existing models for multiple application scenarios. This will further allow readers to identify optimum models based on their performance-specific characteristics. This text also evaluates a novel Mining Scalability Metric (MSM), which combines primary & secondary performance measures, and assists in identification of mining techniques that have higher accuracy, with lower complexity, and faster response, thereby reducing the ambiguity of model selection process."}]}]}]}}