{"pii": "S1877050924007312", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara001", "view": "all"}, "_": "In the current era of internet, a huge volume of opinionated sentiment reviews is generated on a daily basis. Normally, such reviews are enriched with deep sentiments and express the opinions on various features of a product or service under consideration. Identification of a set of important domain features opens an opportunity to build automatic product and service summarization system. It is observed that the common phenomena is to consider the frequently appearing words as the domainb features. However, not all frequently appearing words can be domain-specific features. In this paper, a novel Domain Feature Miner (DOMINER) approach is proposed for robust extractive summarization. The entire domain feature set mining problem is modelled as a clustering problem. Firstly, the bond energy based clustering technique is employed to cluster the domain features based on their frequency and co-appearance counts. Later, relevant clusters are extracted for the final set of domain feature set retrieval. The Proposed DOMINER scheme is extensively evaluated against quantitative performance metrics such as precision, recall, and F-score for six diversified domains such as Cellphone, Camera, Laptop, Tablet, Television, and Hotel. Experimental results on benchmark data sets reveal that proposed DOMINER scheme mines high quality of domain feature from unstructured reviews evident from precision, recall, and F-score values as 78.10%, 64.21%, and 70.48%, respectively against state of the art existing schemes. The high quality domain features extraction from DOMINER help generate the robust extractive summaries for product and services."}]}]}]}}