{"pii": "S1877050915026368", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "Most recently, the concept of business documents has started to play double role. On one side, a business document (word processing text or calculation sheet) can be used as specification tool, on the other side the business document is an immanent constituent of business processes, thereby essential component of business information systems. The recent tendency is that the majority of documents and their contents within business information systems remain in semi-structured format and a lesser part of documents is transformed into schemas of structured databases. The semi structured documents can be stored and processed in the modern database management systems, in compliance with the requirements of business processes. In order to keep in hand the emerging situation, we suggest the creation (1) a "}, {"#name": "italic", "_": "theoretical framework"}, {"#name": "__text__", "_": " for modelling business information systems; (2) and a "}, {"#name": "italic", "_": "design method"}, {"#name": "__text__", "_": " for practical application based on the theoretical model that provides the structuring principles. The modelling approach that focuses on "}, {"#name": "italic", "_": "documents"}, {"#name": "__text__", "_": " and their interrelationships with business "}, {"#name": "italic", "_": "processes"}, {"#name": "__text__", "_": " assists in perceiving the activities of modern information systems. The interrelationships between documents-centric modelling, the Enterprise Architecture and systematic approach for design provides an opportunity for a "}, {"#name": "italic", "_": "unified modelling"}, {"#name": "__text__", "_": "."}]}]}]}]}}