{"pii": "S1877050922016131", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara001", "view": "all"}, "_": "Network infrastructures have not ceased to develop over time, and this is justified by the appearance of new kinds of communication, such as (augmented reality, telemedicine, video on demand), the ceaseless need for bandwidth and the demand for better quality of service. SD-WAN is one of the innovations brought to the telecommunications sector, thus offering good exploitation of the company's network resources in order to guarantee quality transfer. However, modern networks are experiencing an increase in terms of sites to be connected and an evolution in terms of the need for exchange security, encrypted VPN technology is the most opted solution. The Automatic tunneling VPN allows connecting an important number of sites in a flexible way, dynamically and automatically. Better managing exchanges through these multiple tunnels was a major challenge for the engineers. SD-WAN offers itself as the best solution to meet this requirement. To better design and implement its network architecture based on SD-WAN and automatic VPN, it is necessary to take in consideration the good practices of engineering. Optimizing and evaluating the performance of its architecture can extend the life of the infrastructure and ensure quality traffic delivery. In order to upgrade the network infrastructure of our institute and contribute to its evolution, this paper presents the proposed architecture with an evaluation of the performance of the transported traffic. The study is based on the simulation of an infrastructure based on the Fortigate firewall."}]}]}]}}