{"pii": "S1877050915007048", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "In this era of modernization, lots of systems have been introduced by which the human effort has been limited to a certain level. In this Paper a data acquisition system has been proposed for factories and industries or environment monitoring, which will measure the certain parameters like temperature, humidity, the level of gases present in atmosphere, motion of any person near the restricted areas at a time and transmit these parameters to the control room wirelessly as well as to the concerned person of the area by the latest smartphone/tablets. Through the smartphone, the person can give command to the control room in case of any parameter crosses a certain level. The data is collected from sensor nodes to the control room node using ZigBee network and then retransmit the desired data to smart phones, tabs and PCs using Bluetooth network. Sensor node contains analog output sensors like temperature, gas and Digital output sensors like sound and metal. The LCD is used to display the sensor parameters. The RF modem is used to transmit the values to the control room node using star and mesh network topologies. The control room node contains ZigBee transceiver module to receive the information and Bluetooth modem to make available the desired data to the smart phones, tabs and PCs. The ZigBee and Bluetooth network are working at 9600 baud rate and 2.4"}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "GHz frequency in ISM band. The ZigBee nodes are capable to transmit the information upto 100meteres and for long distance communication, multi-hopping is used. Bluetooth modem is capable to transmit the information upto 30 feet distance."}]}]}]}]}}