{"pii": "S1877050919313535", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0020", "view": "all"}, "_": "This paper describes two types of relationships of some information items in a collection of minutes of meetings. The relationships between persons and themes, and ones between two subjects in the minutes are dealt with, which are essential items to analyze minutes. Meeting minutes record reports and discussions with respect to certain themes in meetings. These reports and discussions are arranged into suitable subjects with appropriate headings. To develop a system which analyzes the collection of meeting minutes is required. Then, to show relationships among information items described in the collection of minutes is one of important problems. By complying with this requirement, it is able to find facts which are not found so far, and to assist users to interpret the collection of minutes. In order to understand the minutes, some information items play important roles. In especial, it is necessary to make clear two types of relationships in a collection of minutes. They are relationships between members of a meeting and themes which the members are interested in, and between two subjects described in two minutes for consecutive meetings, which discussed on similar themes. Then, themes are treated as a collection of named entities and keywords. The former is implemented based on latent semantic indexing. The latter is realized by relating two subjects in different consequent minutes from a viewpoint that two subjects treated similar themes. The similarities between two subjects are measured base on occurrences of named entities and keywords. By realizing these mechanisms, intuitive understandability of the relationships among some information items is improved for interpreting a set of minutes, which are persons, named entities and subjects."}]}]}]}}