{"pii": "S187705092031509X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0024", "view": "all"}, "_": "In this new era of the internet world, long-distance effective communication depends on the choice of IP and routing protocols. Various decisions are considered to find the optimal routing protocol for network deployment. The routing protocol which gives the best performance on some objective parameters (convergence, jitter, delay, bandwidth utilization, throughput, etc.) have opted for deployment. Also, according to the network and traffic demands, these routing protocols decide the performance of real-time applications. As IPv4 addresses are exhausting, moving to IPv6 is expected and challenging. This next-generation internet protocol brings new modified routing protocols which are enhanced versions of the existing ones. In this paper, the IS-ISv6 routing protocol is considered as it is scalable, more flexible towards IPv6 addresses, robust, support larger areas and can give better performance than other existing routing protocols. The IPv6 network is configured to measure the performance of real-time applications-voice and video using IS-ISv6 routing protocol and the network is simulated on riverbed modeler academic edition 17.5. The main objective of this paper is to find the performance of IS-ISv6 for routing the traffic. For both, the applications, the traffic sent and received are present to calculate the maximum throughput of the network. The results are also present for end-to- end delay and packet delay variations for voice and video applications. The simulation results for IPv6 traffic dropped and jitter in voice are also obtained in this paper. This research paper finds that the IS-ISv6 routing protocol enhances the throughput of video applications in the IPv6 network. However, the average performance for voice application is achieved with less end-to-end delay and packet delay variations. Thus IS-ISv6 routing protocol can be used efficiently for high-performance real-time application networks."}]}]}]}}