{"pii": "S1877050919322252", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0103", "view": "all"}, "_": "This research paper aims to investigate the relationship between learners’ profiles as analysed according to MBTI and Belbin and their behaviour during group presentations while not being the active presenter. This paper is part of a research study in the field of video tagging as a mechanism for analysing individual behaviour in learning activities. As part of this study, the authors analysed videos of student group presentation and associated behavioural patterns to individual student profiles as produced by the Belbin and MBTI analysis models. The aim of the study was to identify how social and teamwork characteristics of individual learners can relate to certain behaviours. Such relations would help to better assess video content of learning activities including meetings and presentations. A primary aim of the study is to identify associations between human behaviour and individual’s teamwork characteristics. Such associations could facilitate the judgment of learners’ ability to work in a team. The study included quantitative research methods for analysing videos in combination with personality profiling analysis, with emphasis on social and teamwork activities. The Belbin and Myers–Briggs Type Indicator (MBTI) models were used for the purpose of this study. Furthermore, the behavioural patterns monitored during the video analysis included ‘eye contact with presenter’ and ‘eye focus out’ as the most prominent observable behaviours. The paper’s conclusion is that based on the analysis results, learners classified as Coordinators (Belbin) or Virtuosos (MBTI) are less likely to lose focus while they are not presenting, and students classified as Monitor Evaluators (Belbin) or Logisticians (MBTI) are more likely to look and take care of their team members while presenting."}]}]}]}}