{"pii": "S187705092400526X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara001", "view": "all"}, "_": "The lack of internet access in underdeveloped nations, including the Philippines, has significant impact on the digital divide. One of the challenges faced by students in underdeveloped nations, particularly those in far-flung and hinterland schools, is the lack of access to up-to-date educational resources due to their geographic isolation. This can lead to a significant disadvantage in terms of academic performance and future opportunities. Thus, a Remote Learning Management System (RLMS) is proposed. The study includes the development and testing of the RLMS system, as well as an evaluation of its acceptance through the Technology Acceptance Model survey questionnaire. This system utilizes intranet networks and a Network File System to provide distant learning and teaching-based eLearning in far-flung and hinterland schools. The system intends to make sharing educational resources easier, such as to let students access their lessons, modules, and assignments, take exams and quizzes and even watch video lessons on their laptops, smartphones, and tablets, even without an internet connection. The results show that the RLMS system is fully functional and accessible, with positive acceptance and intention to use from teachers and students. Future studies can focus on enhancing the RLMS capabilities, improving user-friendliness, and providing in-depth training to teachers to maximize the system's potential. Overall, the RLMS system provides a viable alternative for blended learning in areas with slow and limited internet access."}]}]}]}}