{"pii": "S187705092300354X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara001", "view": "all"}, "_": "The management of an online footwear retail store - also known as marketplace - usually involves activities that directly or indirectly end up to interface with customers, wherein communication efficiency and effectiveness is crucially relevant. Critical factors concerning entities developing remote business in these areas or similar include: (i) production of appealing catalogues and (ii) digital tools to shorten the distance between customers and marketplaces. The former requires using specific third parties - often technically complex - to arrange and prepare photographic entries acquired in studio-like environments. This can delay the diffusion of products supply that may result in financial losses. The latter prevents the retailer of reaching critical mass at a higher potential. Considering such issues, this paper proposes a couple of modules for footwear marketplaces, powered by deep learning: one to segment shoes as a fully automatic background removal tool for easing and quickening catalogue creation activities in a back-office perspective; and another to provide visual search services that allow a customer to submit photographs of footwear of interest to obtain recommendations of similar products directly retrieved from online retail databases, establishing another digital bridge with potential buyers. Preliminary implementation and pilot tests point out Mask-RCNN as a promising approach for shoes segmentation. The same applies to ResNet101 and Xception, but for shoes recommendation, based on multi-label classification."}]}]}]}}