{"pii": "S1877050922002526", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0050", "view": "all"}, "_": "The COVID-19 pandemic has forced a sudden change of traditional office works to smart working models, which however force many workers staying at home with a significant increase of sedentary lifestyle. Metabolic disorders, mental illnesses, and musculoskeletal injuries are also caused by the physical inactivity and chronic stress at work, threatening office workers’ physical and physiological health. In the modern vision of smart workplaces, cyber-physical systems play a central role to augment objects, environments, and workers with integrated sensing, data processing, and communication capabilities. In this context, a work engagement system is proposed to monitor psycho-physical comfort and provide health suggestion to the office workers. Recognizing their activity, such as sitting postures and facial expressions, could help assessing the level of work engagement. In particular, head and body posture could reflects their state of engagement, boredom or neutral condition. In this paper we proposed a method to recognize such activities using an infrared sensor array by analyzing the sitting postures. The proposed approach can unobstructively sense their activities in a privacy-preserving way. To evaluate the performance of the system, a working scenario has been set up, and their activities were annotated by reviewing the video of the subjects. We carried out an experimental analysis and compared Decision Tree and k-NN classifiers, both of them showed high recognition rate for the eight postures. As to the work engagement assessment, we analyzed the sitting postures to give the users suggestions to take a break when the postures such as lean left/right with arm support, lean left/right without arm support happens very often."}]}]}]}}