{"pii": "S1878522009001623", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "aep-abstract-id12"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id13"}, "$$": [{"#name": "simple-para", "$": {"view": "all"}, "_": "Coal mine industry, which produces the most abundant and widely-distributed fossil fuel, is the deadliest in casualties. A recent report shows that the casualty rates of coal production per million tones are 4.36 in China, 2.14 in Ukraine, 2.03 in Russia, 0.088 in USA and 0.08 in Australia respectively. Consequently, safety is a critical issue for the mining industry, especially for the underground mining companies. The modernization and informatization of mining companies have significantly improved the operational environments (and hence safety) for the underground miners. Some advanced technologies, such as the intelligent response and rescue systems, have contributed significantly to the reduction of mining fatalities and accidents. Typical underground positioning and three dimensional (3D) modelling techniques are discussed in this paper first. A RFID/INS integrated positioning system has been tested to evaluate its performance and different positioning algorithms have been implemented. Experiments show that the simple centre of origin (CoO) positioning algorithm can achieve a positioning accuracy of 7.9 m. The integrated fingerprinting algorithm can achieve 1.7 m accuracy by using an Extended Kalman Filter. A new underground structure modelling method and a collision detecting method are developed. A prototype intelligent response and rescue system has been implemented in Da Zhuang coal mine, China. The results indicate that both the underground positioning technique and the 3D modelling and representing technique developed can satisfy the requirements of underground rescue in an emergency situation."}]}]}]}}