{"pii": "S1877705816004215", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "_": "Mining companies are shifting their strategies and adopting new business and operating models to include new technologies and are doing so on a more rapid and global basis than ever before. A combination of market volatility, changing global demand, radically different input economics, new locations in search of more reserves, a focus on a longer asset lifecycle and a commitment to operational excellence as well as policy shifts around the globe are all contributing to a seismic shift in the industry."}, {"#name": "simple-para", "$": {"id": "spar0010", "view": "all"}, "_": "Decades of cost reduction and the aging workforce have left mining companies with limited resources to adjust. Now, a rapidly evolving set of new technologies – the Digital Transformation – open new possibilities to improve operating efficiency, develop more accurate and agile planning, heighten vendor awareness and collaborate with business partners throughout the value chain. The mining industry is at the epicenter of this digital transformation, which is very real and can drive considerable differentiation and competitive advantage within the industry. Automation of the mines, new analytic capabilities, digital workers, remote and autonomous operation are just some of the examples where the technologies are disrupting the mining industry today. All of these need to be looked at very closely to drive growth and increase efficiencies."}, {"#name": "simple-para", "$": {"id": "spar0015", "view": "all"}, "_": "It is critical for mining companies to understand the digital transformation and its associated opportunities and risks. A more inter-connected and information based operation will continue to push the envelope of what needs human interaction. The possibilities for new operating models and new levels of optimization will create the next wave of differentiation in the industry."}]}]}]}}