{"pii": "S1877050924007701", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara001", "view": "all"}, "_": "In the present scenario, Internet communities, forum and blogging sites play a very crucial role to present opinions, views and the comments on various events. As the reachability of sites are beyond the control of national boundaries, sometimes this leads to the conviction and persuasion of thoughts without considering any legal subsequences, and also influence the belief of others as well, thus finding or identifying the sentiments of public from the social media content is one of the major research issue. Analysis of the sentiments of social media data is very difficult to understand as this typically does not exhibit a suspicious pattern in the flow of information like individual's actual opinion on a specific occasion etc. With the advancement of methodology and easy to use, the users of social media sites are now expressing their opinions, sharing their views and experiences through images, text, animation, audio, video etc. Because of the complexity the conventional text based sentiment analysis procedure, a lot of methods have been evolved, however studies suggest mostly more complicated procedure and approaches. Twitter® (or X), is one of the most common platform used widely by individual to express their opinions and sentiments on various events. Twitter sentiment analysis basically deals with the analysis of twitter quotes to find the hidden pattern in the sentiments expressed by the users in past. This paper aims to takes the challenges regarding social media sentiments analysis and developed a hybrid approach (Text and visual sentiment) on twitter data for sentiment analysis by using NLP-based opinion clustering, textual mining, emotion API and some machine learning techniques for visual ontology. Simulation result shows the significance of work."}]}]}]}}