{"pii": "S1877050920319803", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0096", "view": "all"}, "_": "A recommendation system (RS) provides users with a list of recommended tags or resources that they may like. Still, most systems are vulnerable with certain limitations and gaps related to the recommendation environment. Several RSs do not take into account the changes of the user preference over time to ensure his satisfaction. Thus, the role of these systems is limited to define the general orientations of each user according to their observed preferences without shading light on the importance of the user preferences in short time. In this regard, we propose a new approach of recommendation for the entertainment industry that permits to guide the user towards suggestions that are more relevant according to their previous interactions. That means, we offer our users suggestions to decrease the time and frustration of discovering engaging content. Thereby, we have created our own solution, a Recommendation System based on Markov Chains and Grouping of Genres (RSMCG). It is a simple method that enables to construct an intelligent system which explores the Markov chains to predict the following actions taking into consideration the most recent actions of the user. Also, we adapt a machine learning algorithm DBSCAN clustering in order to exactly identify the interest of each user and provide adaptable answers. This approach has been studied and evaluated on the basis of a movie collection of the most popular video streaming service “Netflix”. The results of the experiments show the efficiency of our hypothesis in comparison to a sample of the user’s real needs."}]}]}]}}