{"pii": "S1877050916300230", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "_": "With the turning wheel of time, the influence of the social networking websites on the people has significantly increased. People are now connecting with each other in cyber space and show their sentiments in the form of comments in different social networking websites such as Twitter, Facebook and Google Plus. YouTube is considered as a king in the field of video sharing. It is a largest video sharing repository, where people come and share their thoughts regarding video in the form of comments. If we are able to find useful information through comment, then these unstructured comments can be useful for different purposes. Sentiment analysis is the one way to find out the feeling of people and in the case of YouTube, we can understand the behaviour and response of individuals after seeing particular video. There are situations in which opinion shared by user has comparative content. The user sees the video of comparison of two options or products and shares his/her preference based on some reasoning. Comparative opinion mining leads to situation where number of options defines the number of labels. In this paper, we have used Naïve Bayes machine learning algorithm to perform multilabel classification to find out the sentiments of the commenters for different options. In order to reduce the computational requirements, we adopted a naïve assumption that words around keywords related to particular option are enough to understand the sentiments of user. The developed classifier based on naïve assumption demonstrated slightly lower performance with the benefit of requirement of less computational power."}]}]}]}}