{"pii": "S1877042812053037", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "aep-abstract-id16"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id17"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "_": "This paper discusses a conceptual framework for the system development of the web collaborative content organiser (WebCoCo). The conceptual framework of the system focuses on four main elements of learning activities, namely, learning objects, collaborative tasks, reflection and evaluation. The learning object tool consists of a learning object template which allows a course manager to upload relevant resources from the learning object library. These learning objects stored in the library are meta-tagged to allow students to search for the specific ones they require. The collaborative tasks in the system involve the deployment of various tools, namely, concept mapping, problem solving and topic forum tools. Based on the learning objects made available to them, students then work collaboratively to construct the concept map of a particular lesson. The concept map tool encourages students to participate actively in generating relationships from the information they receive from the learning objects thus allowing them to participate in the active process of knowledge construction. The course manager may also launch the topic in the forum board to get the students involved in discussing and exploring the contents and materials learned. These reflection tools in the system allow students to reflect and demonstrate on their understanding of the course content via the development of individual e-portfolios. The e-portfolio provides a learning record and evidence of a student's abilities, achievement and understanding of the course content. In addition, various other interactive evaluation tools, such as the interactive quiz and a library of structured questions with guided answers, are also embedded in the system. These tools allow and facilitate the mastery, comprehension and understanding of the course content by the students."}]}]}]}}