{"pii": "S1877050910005107", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "class": "author", "id": "aep-abstract-id5"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id6"}, "$$": [{"#name": "simple-para", "$": {"id": "sp000005", "view": "all"}, "$$": [{"#name": "__text__", "_": "The majority of Intelligent Tutoring System architectures are focused on supporting learners through content retrieval or in one or more given subject matters; examples of this can be found in Baghera "}, {"#name": "cross-ref", "$": {"refid": "br000005"}, "_": "[1]"}, {"#name": "__text__", "_": ", MyClass, Andes "}, {"#name": "cross-ref", "$": {"refid": "br000010"}, "_": "[2]"}, {"#name": "__text__", "_": ", Gramy, Advanced Geometry Tutor "}, {"#name": "cross-ref", "$": {"refid": "br000035"}, "_": "[7]"}, {"#name": "__text__", "_": ". The implementation of such architectures are time-consuming and are generally not interoperable with other domains "}, {"#name": "cross-ref", "$": {"refid": "br000015"}, "_": "[3]"}, {"#name": "__text__", "_": "."}]}, {"#name": "simple-para", "$": {"id": "sp000010", "view": "all"}, "_": "The presented research describes the experimentation of a Open Source, LMS enhanced with elements of AI aiming at supporting online teachers’ and tutors’ work by using a KB specific to relational and pedagogical aspects, not connected to a specific subject matter. Such implementation needs to be provided of an authoring tool easily and readily usable by tutors and teachers of different subjects and with medium level IT training."}, {"#name": "simple-para", "$": {"id": "sp000015", "view": "all"}, "$$": [{"#name": "__text__", "_": "Starting point of our investigation has been a preliminary analysis of machine-mediated, human-human interactions (MM-HHI) and communications by using the Teachers’ thinking approach "}, {"#name": "cross-ref", "$": {"split": "", "refid": "br000020"}, "_": "[4]"}, {"#name": "__text__", "_": ", "}, {"#name": "cross-ref", "$": {"split": "", "refid": "br000025"}, "_": "[5]"}, {"#name": "__text__", "_": ", "}, {"#name": "cross-ref", "$": {"split": "", "refid": "br000030"}, "_": "[6]"}, {"#name": "__text__", "_": ". We considered messages exchanged between teachers/tutors and online students in three post-graduate, online courses running at the University of Macerata during 2008–2010 by the Faculty of Education. The study showed that about 30% of messages concerned structured information that could be straightforwardly retrieved by an artificial agent; almost all remaining messages were instead deeply bound to student’s learning path or required a significant input by the teacher/tutor, while the residual part of messages could — to some extents — be delegated to an intelligent agent having access to students’ tracking data in order to display visual information to users or trigger alarms to tutors."}]}, {"#name": "simple-para", "$": {"id": "sp000020", "view": "all"}, "_": "The investigation carried out prompted us for the deployment of an Open Source chat-bot system that would retrieve information already coded into the courses or originated by students through the analysis of their activity logs; the chat-bot agent uses this structured information in order to answer students’ most common questions hence relieving teachers and tutors from doing this repetitive task. The system is being implemented on a OLAT ver. 6.3 LMS loosely coupled to a JADE-based Multi Agent System in charge of processing user tracking data and running the ALICE chat-bot integrated with the platform messaging system."}]}]}]}}