{"pii": "S1877050923013649", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara001", "view": "all"}, "_": "Wireless Sensor Networks (WSNs) have increasingly been adopted as a viable solution in the healthcare industry for many years. One novel application of WSNs in healthcare is real-time health data collection and tele-healthcare service delivery via the Internet. With the increasing number of applications of Wireless Sensor Networks (WSNs) in healthcare has emerged during the past decades, especially during the COVID-19 pandemic which has affected millions of people, particularly the elderly, the advantages and benefits of applying WSNs to monitor patients and improve the quality of healthcare have become clearer. Today's sensing and communications technologies have reached a point where these WSNs can be readily implemented and deployed, albeit with some limitations and security concerns."}, {"#name": "simple-para", "$": {"id": "spara002", "view": "all"}, "$$": [{"#name": "__text__", "_": "Collecting patients' health data or vital signs from WSNs deployed in hospitals or elderly nursing homes has been one of the most challenging tasks in the healthcare industry. In this paper, our main focus is on the routing protocol for human psychological data generated by healthcare application over the 6LoWPAN-based Wireless Sensor Networks (WSNs) as well as the development of affordable healthcare applications by leveraging novel WSN technology. Firstly, we present our latest achievements in implementing healthcare systems using the framework proposed in "}, {"#name": "cross-ref", "$": {"id": "crf0004", "refid": "bib0010"}, "_": "[10]"}, {"#name": "__text__", "_": ". Additionally, We employ this framework to simulate 6LoWPAN-based Wireless Sensor Networks (WSNs) in two different healthcare settings using the network simulator NS-3. Finally, we provide preliminary results from the application of the developed application in on-site hospitals and nursing homes."}]}]}]}]}}