{"pii": "S1877042815038744", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "_": "Learning processes and learning potentials are continuously investigated. Exploration of the possibilities of Technology Enhanced Learning (TEL) led to the development of many solutions and recently to Massive Open Online Courses (MOOCs). MOOCs are probably the most important “novelty” in the field of e-learning of the last years. MOOCs are capable of providing several ten thousands of learners with access to courses over the web. MOOCs have recently gained much attention especially in leading universities and are now often considered as a highly promising form of teaching. More and more universities are currently working to offer their courses in the form of MOOC providing learners with a wide variety of choices. With MOOCs proliferation, learners will be exposed to various challenges and the traditional problem in TEL “finding the best learning resources” is more than ever up to date. Since information retrieval and searching for the appropriate learning resources is an essential activity in TEL, the development of recommender systems for learning has seen increased attention. Recommender systems permit to respond to the traditional problem. In the present paper, we address this major problem – the difficulty for learners to find courses which best fit their personal interests. We propose a system that recommends appropriate MOOCs in response to a specific request of the learner. Using the Case Based Reasoning (CBR) approach and a special retrieval information technique, the system proposes to the learners the most appropriate MOOCs (from different providers) fitting her/his request based on learner profile, needs and knowledge."}]}]}]}}