{"pii": "S1877050918311293", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0018", "view": "all"}, "_": "The digital environment is one of the major factors contributing to the technical and industrial revolution we are witnessing today. Indeed, this environment is no longer used only for the exchange of textual data, but also transactional and multimedia such as gaming, video on demand, and IPTV. Therefore, in parallel with the diversity of flow, there is an improvement in network infrastructure. The Quality of Service (QoS) mechanisms make it possible, among other things, to optimize the consumption of network resources, by favoring certain flows over the others according to specific policies. One of the big challenges to overcome when setting up QoS mechanisms is sizing the network, that is, ensuring that the mechanism and reservation are chosen correctly to meet the customer’s requirements and not causing any deterioration in network performance. Simulation is one of the preliminary phases to be carried out before applying the various QoS mechanisms in a digital network. In general, QoS simulation projects, under Riverbed Modeler or other simulators, contain hundreds or even thousands of scenarios. This makes the simulation difficult, tedious, and especially vulnerable to errors related to the human factor involving the confidence interval of the results obtained. In this paper, we propose a new 2AFM-QoS (Assisted Automated for Fast Modeling Quality of Service) approach for automating the simulation of QoS mechanisms in an intelligent digital environment under Riverbed Modeler. The 2AFM-QoS approach is validated by a new Graphical User Interface (GUI) tool facilitating its exploitation."}]}]}]}}