{"pii": "S1877050923009043", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara001", "view": "all"}, "_": "Job satisfaction among employees is a crucial factor in a burgeoning organization. Satisfied current employees mean more skilled employees will be interested in joining the organization in the future, which will reinforce the prosperity of the organization. Hence, employee job satisfaction is something that should be looked for both by the employees, and the employers. However, the job sector of a country often undergoes major changes, which affect the satisfaction of the employees. Analyzing anonymous employee job satisfaction may lead to an understanding of an organization's major pros and cons, which can help the employer determine the strategies they should adopt in the future. It can also be helpful for potential future employees to decide whether they would like to be a part of such an organization. Taking all of these into account, we attempted to analyze the job satisfaction of employees in this research. A deep hybrid learning-based architecture, BiLSTM-ANN is proposed to understand employee job satisfaction in a shorter period of time. To do so, we have accumulated employee reviews of 12 renowned IT and software companies in Bangladesh from Glassdoor.com. A sophisticated dataset is built to feed into the proposed architecture. Five polarities, namely super positive, positive, neutral, negative, and super negative, are assigned based on the rating given on Glassdoor.com. The evaluation shows that the proposed BiLSTM-ANN model outperformed the state-of-the-art architectures in different performance metrics. The model exhibits an F1 Score of 88.64% with a significantly less number of trainable parameters than other architectures."}]}]}]}}