{"pii": "S1877050922016659", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara001", "view": "all"}, "_": "In 2016, the Gdańsk University of Technology (Gdańsk Tech) launched the project titled \"Multidisciplinary Open System Transferring Knowledge\" (in Polish: \"Multidyscyplinarny Otwarty System Transferu Wiedzy – MOST Wiedzy\"). The polish acronym of the project (MOST Wiedzy) means \"the Bridge of Knowledge\". The project's main aim was to build an IT platform (mostwiedzy.pl) that supports sharing information about universities' achievements and the research potential of their researchers. The project's second stage, the implementation began in 2018, is a continuation of the previous one. The \"Bridge of Data\" project (Bridge of Data – Multidisciplinary Open System Transferring Knowledge. Stage II Open Research Data) was established to support researchers in their activities regarding different Open Science layers. It provides an open data repository (Open Research Data Catalogue) and a range of additional services for researchers who want to share their research results openly. The project is unique in Central and Eastern Europe. It involves three Pomeranian universities: Gdańsk University of Technology (Gdańsk Tech – leader), the University of Gdańsk (UG), and the Medical University of Gdańsk (MUG). More universities and research institutes are now joining the consortium and will use the infrastructure that has been created. From a technical perspective, the Bridge of Knowledge platform integrates multidisciplinary and multidimensional data from many databases. The metadata describes each piece of data to connect with other objects and be visible and readable to machines that understand the metadata format. In addition, there are e-services dedicated to sharing information about research output, its metrics and potential. The article aims to present the structure of the mostwiedzy.pl portal, sources of data on scientific achievements and the method of their presentation, as a comprehensive service for the university's academic community."}]}]}]}}