{"pii": "S1874490723002288", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e799", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e800"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e802", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e803", "view": "all"}, "_": "Due to the lack of global positioning system (GPS) signals in some enclosed areas, indoor localisation has recently gained significant importance for academics. However, indoor localisation has a number of challenges and defects, including accuracy, cost, coverage, and ease of use. This paper explores the integration between the inertial measurement unit (IMU) and Wi-Fi-based received signal strength indicator (RSSI) measurements, demonstrating their combined potential for robust indoor localisation. IMUs excel at capturing precise short-term motion dynamics, offering insights into an object’s acceleration and orientation. Conversely, RSSI measurements serve as valuable indicators for relative positioning within indoor environments. By fusing data from these sources, our approach compensates for the inherent weaknesses of each sensor type. To achieve accurate indoor positioning, we employ techniques such as sensor fusion, Wi-Fi fingerprinting, and dead reckoning. Wi-Fi fingerprinting allows us to create a database that maps RSSI measurements to specific locations, while dead reckoning helps mitigate drift and inaccuracies. By combining these methods, we estimate a device’s position with increased precision. Through experimental evaluation, we assess the performance and efficiency of our integrated approach, comparing the estimated path or new location with a predefined reference path. The findings emphasise a significant improvement in accuracy, with the integration of crowd-sensing, particle filtering, and magnetic fingerprinting techniques resulting in a notable increase from 80.49% to 96.32% accuracy."}]}]}]}}