{"pii": "S1877050923001254", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara001", "view": "all"}, "_": "Maritime surveillance is of utmost priority for a nation's security, and hence it's economy. For maritime awareness, coastal surveillance, and maritime activities in the Region of Interest (ROI) should be monitored. One of the ways to keep this in check is to restrain unwanted infiltration. Monitoring unwanted infiltration is feasible through vessel trajectory forecasting and anomaly detection in real time. Most solutions for trajectory predictions are available but require a huge amount of historical data, and high-power computing resources. Here, the requirement is developing a decision support framework consisting of both lite weight approaches for short-term predictions and deep learning-based techniques for long-term forecasting. This paper aims to find the suitability of Linear Stationary Models (LSM) like the Auto-Regressive Integrated Moving Average Model (ARIMA) for predicting and forecasting the Vessel Trajectory as means of lite weight short-term predictions. For this purpose, the Automatic Identification System (AIS) dataset of the U.S. West Coast is used. The significant effort was for data pre-processing to create a robust dataset for model training. An appropriate model after the model-selection process is used for trajectory forecasting. The model's accuracy is validated using Root Mean Square Error (RMSE) performance indices for residual and forecast errors. A window generator model is integrated with the best-fitted ARIMA model for recursive real-time predictions, with varied sizes and visualization. The proposed time-series model provided a very high accuracy as the RMSE value for prediction and 48 hours forecast are 0.023 and 0.017, respectively."}]}]}]}}