{"pii": "S1877050914010618", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "_": "Popularity and availability of opinion-rich resources in e-commerce platform is growing rapidly. Before buying any product, one is interested to know the opinion of other people about that product. For any product, there are hundreds of reviews available online so it becomes very difficult for the customers to read all the reviews. Also, one cannot set his mind based on reading some of the review since it gives him a biased view about that product. So we need to automate this process. As we know, there are lots of opinion words present in the sentences of a review which will tell about the polarity of that product. Out of all the opinion words, some words behave in the same manner means they have the same polarity in all contexts, but some words are context dependent means they have different polarity in different context. In this paper, we proposed an Aspect Based Sentiment Analysis and Summarization (ASAS) System, which handles the context dependent opinion words that has been the cause of major difficulties. For finding the opinion polarity, first, we used an online dictionary for classifying the context independent opinion word. Second, we used natural linguistic rules for assigning the polarity to maximum possible context dependent words. These steps create the training data set. Third, for classification of the remaining opinion words, we used opinion words and feature together rather than opinion words alone, because the same opinion word can have different polarity in the same domain. Then we used our Interaction Information method to classify the feature-opinion pairs. Fourth, as negation plays a very crucial role, we found negation words and flipped the polarity of the corresponding opinion word. Finally, after classifying each opinion word, the system generated a short summary for that particular product based on each feature"}]}]}]}}