{"pii": "S1877042811024025", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "aep-abstract-id8"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id9"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "_": "In this paper we discuss the architecture of the system under development the purpose of which is to capture the sentiment of web users regarding any topic such as retail products, financial instruments (FI), or social issues like immigration. The first step is knowledge acquisition. A Sentiment Web Mining (SWM) system requires acquisition of knowledge from several sources on the web. Such knowledge may be found on blogs, social networks, email, or online news. A SWM system has customization and personalization capabilities. For our purposes, customization occurs when the SWM user can change his/her preferences to select specific sites to be used for data mining and evaluation. Personalization occurs when the system decides which sites to be used for data mining based on the user profile. The user profile dynamically changes depending on the type of user request from the system and the specific sites the user visits to verify the result of the SWM system. The second step is knowledge storage, which involves the creation of a database. Appropriate web sites will be indexed and tagged. Taxonomy is the hardest part of this step. In this paper we will demonstrate a unique way of tagging the knowledge obtained from the web. The third step is the knowledge analysis/data mining. A SWM system will use a series of off–the-shelf knowledge analysis/data mining tools including SWM knowledge analysis/data mining engine which is based on web services technology. The type of questions used can be: 1) The volume of sentiment for a particular topic; 2) The intensity of sentiment (good or bad) for a particular topic; 3) The interrelationship between the writers of material written on the web, especially if the writer is anonymous; 4) Who is/are the leader(s) of the sentiment? If the information is maliciously posted on the web the user may want to pursue it through legal means.The last step is dissemination of knowledge to the user(s). A SWM system uses third party visualization tools as well as web based user interfaces and reports that are written internally. The presentation component of a SWM system is decoupled from other components, namely, the process component, business rule component, and data access component for ease of maintainability."}]}]}]}}