{"pii": "S1877050918307646", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0134", "view": "all"}, "_": "The output of traditional analysis of student feedback for class room delivery of faculty suffers from inaccuracy due to non consideration of the influence of various direct and indirect quality features related to student such as regularity in class attendance, effort, academic background, course outcomes achieved and positive attitude on the feedback measure. Consequently, the output of traditional faculty feedback analysis is not a true indicator of faculty effectiveness in the teaching learning process. The paper presents a proactive and outcome based faculty feedback analysis model which uses Naïve Bayes Classifier to cull out and classify the feedback provided by each student into valid or invalid categories on the basis of the relative effect of aforementioned quality features on the feedback measure. The above quality features are used to refine the feedback measure. The method attempts to address the imprecision to overcome the limitations of the traditional model. Consequently, the output of faculty feedback analysis results in a more refined and accurate Faculty Effectiveness Index. The Faculty Effectiveness Index is calculated as weighted average of only the valid feedback measures with the validity of feedback taken as the associated weight. The classifier takes into consideration the independent contribution of each of the features as well as the multiple evidences of their occurrences in the feedback provided by each student. The method also suggests a comprehensive feedback form comprising of two parts namely subjective feedback part for eliciting feedback in traditional manner and an outcome based feedback part to collect information on the aforesaid quality features related to student which influence the feedback measure."}]}]}]}}