{"pii": "S1877050914014033", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "_": "Network services deployment through Software-Defined Networking requires advanced prior configuration of controller databases and devices local system applications. Such prior system definition steps result in rigid infrastructure setup, restricted service deployment scope, and limited reconfiguration flexibility. This paper aims at enabling fast devices configuration and services deployment - within seconds - in dynamic and unconfigured infrastructure contexts."}, {"#name": "simple-para", "$": {"id": "spar0010", "view": "all"}, "_": "To address this challenge, we propose NEON, a southbound protocol for dynamic networks, which aims at comprehensive network configuration capability. NEON performs dynamic discovery of devices, thorough live devices interfaces (re)configuration and returns network interface technology specific performance statistics. To evaluate the capacity of NEON to effectively deploy complex protocols, this paper proposes 2 concurrent implementations of PMIPv6 protocol: native and software service. These implementations running on off-the-shelf hardware, showcase the performance of both deployment approaches over unconfigured infrastructure. Our implementation show fast configuration time (a few seconds) when compared to the native deployment (also an original proper implementation). We demonstrate the transparency of the service operation from a user perspective by comparing the performance of both implementations from the edge. NEON is compatible with other configuration and management south- bound protocols such as OpenFlow."}]}]}]}}