{"pii": "S1877705815020640", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "Our ancestors have been designing and building structures for centuries to protect themselves from the environment and to sustain the well-being of their occupants. Achieving a healthy indoor environment has become a challenge among design professionals, such as architects, engineers and scientists, due to chemical and physical indoor environmental parameters. Nowadays, we face a new challenge: providing healthy and effective wireless communication in the building environment that pushes the envelope of building design. Wireless communication systems emit Electromagnetic Waves. These high frequency waves exist both inside buildings and the free space around us. There are a variety of RF sources and they cover a wide range of the electromagnetic spectrum, such as cell towers (masts), cordless DECT phones, smart meters, Wi-Fi router/modems, WiMAX networks, cellular phones (mobiles), video games, digital baby monitors, digital TV, audio/video sender receivers, tetra emissions, and wireless burglar alarms and so on. The range of radio frequency (RF) spectrum spans 3"}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "kHz to several hundred GHz. The microwave ranges from 1"}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "GHz to 40"}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "GHz and is used in contemporary point-to-point, wireless, and satellite communications."}]}, {"#name": "simple-para", "$": {"id": "spar0010", "view": "all"}, "_": "The purpose of this paper is to evaluate current power intensity levels in building environments and develop guidelines for design professionals by understanding building materials ‘properties. In building design, there are diverse approaches to provisions of wireless communication and constant innovation; however, the construction materials and EMW propagation relationship remains a secondary consideration. Researching EMW propagation issues to develop guidelines for incorporating wireless communication systems into Architectural Design will promote healthy and effective indoor environments."}]}]}]}}