{"pii": "S1877050920302337", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0053", "view": "all"}, "_": "The mixed information stream of reliable, semi-reliable and obviously false data observed in the network is a data flow in the so-called facilitated format, the task of which is to somehow attract attention, influence the emotional sphere in the form of hype-information, which helps to make hasty decisions and harm-actions. A growing variety of forms of technological push-impact, which are successfully used for commercial purposes. Nevertheless, the study of various push-forms shows that they are based on a single semantic component that uses the offset of actual concepts to achieve the benefit of the information provider. The consumer of push services receives an apparent benefit that is far from his actual interests and intentions. A semantic computational model is proposed that captures the emerging bias of concepts. The concept of a semantic broadcasting channel is developing. The paper considers the task of constructing specialized semantic systems in the form of information graphs. The information graphs are considered as structured sets of vertices that define the method of processing information and are connected by arcs, describing the sequence of processing. In its turn, an information graph can be used as an arc, which gives hyper-graph nature to the network in the whole. The information graphs are compared with other data flow control tools. The tools for constructing transformational semantics for calculations above information graphs are offered, which assume the specialization for the class of computations associated with the vertices of the graph. A method for making an abstract computing machine with a given semantics is proposed. The paper considers an example of making an abstract machine for the case of deterministic semantics, which is illustrative for certain fragments of antimonopoly legislation."}]}]}]}}