{"pii": "S1877050922009061", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara001", "view": "all"}, "_": "The increasing trend in the percentage of older people among the European population, and in the number of older people living alone, poses a number of challenges, some of which can be addressed from digital solutions monitoring and supporting comfort, physical activity and health. Nowadays, research efforts seek to ensure, through technology-based solutions, the quality of life as people age and the needs that arise during the process. The home environment can host modern home-automation solutions supporting information gathering, monitoring and early intervention to prevent risks to lead to major consequences. Smart homes can thus make a positive contribution to the Active and Healthy Ageing paradigm. However, one of the biggest limitations preventing smart homes from being a reality is the lack of interoperability among different-vendor devices or the fact that most of the commer-tial solutions rely on cloud-based solutions. This work faces these limitations and proposes an architecture that, based on the use of commercial sensors, ensures that information is gathered and processed locally, independently of the commercial solution provided by the manufacturer of the device. The architecture has been experimentally validated by implementing a monitoring system based on environmental and security sensors interconnected by means of the ZigBee wireless communication protocol. The proposed system also supports caregivers caring for their older people who will be granted access to collected data. Thus, the system offers a remote monitoring system based on an information storage and visualisation solution. This system is intended to provide a solution that improves the quality of life and extends the time of independent living at home for older people."}]}]}]}}