{"pii": "S1877705815043374", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "Identifying product development opportunities is one of the initial phases in the fuzzy front end of a creative innovation process. A number of approaches have been developed to systemize this process, e.g., lifestyle trends, documenting customer complaints, TRIZ trends, and lead user identification and interviewing. Lead users are an essential group of users for companies to involve as part of knowledge management in product design and evaluation. A lead user is an active and experienced individual engaged in modifying and developing products for personal gain, making systematic identification of a lead user the principal basis to precipitate product innovation and development. Currently, some companies, e.g., 3"}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "M, employ an interactive screening method, a time intensive activity consisting of semi-structured telephone interviews and written questionnaires by expert users to select lead users "}, {"#name": "cross-ref", "$": {"id": "crf0010", "refid": "bib0005"}, "_": "[1]"}, {"#name": "__text__", "_": ". Another more recent approach, netnography, entails systematic analysis of online communities by observing, collecting and laboriously interpreting data by expert users "}, {"#name": "cross-ref", "$": {"id": "crf0015", "refid": "bib0010"}, "_": "[2]"}, {"#name": "__text__", "_": ". In contrast to these two time and cost sensitive methods, in this paper a Fast Lead User Identification (FLUID) systematic approach for an automated and accurate discovery of lead users, by exploiting data mining methods and algorithms on rich social networking sites like the micro blogging site Twitter, is proposed. Social sites provide easy access to rich data for extraction and analysis of extended user information and behavior, enabling assessment and classification of lead users with dissimilar expertise as an early algorithmic step of creative innovation. In addition to the discussion of the three aforementioned methods, steps for validating the FLUID method are outlined."}]}]}]}]}}