{"pii": "S1996681416301924", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "For intelligent traffic and road structural health monitoring, Wireless Sensing Network has been applied widely in transportation, and large quantity of sensor nodes have been embedded in roadways. Now the service lives of sensors are limited mainly because of their battery power storage. So the life cycle of the whole network can be extended if the service life of each sensor in the network is prolonged. In this paper, the Strip Clustering Scheme (SCS) is proposed to replace the Conventional Scheme (CS). This method includes region division, cluster head node selection, link construction, data fusion and transmission. Adopting SCS can reduce a lot of redundant data and the total energy consumption of the network by data fusion. In addition, adopting SCS can also extend the monitoring area without increasing the communication range of the Access Point (AP), and facilitate further expansion of the network as a result. Based on the numerically simulated results, CS method can be used for the WSN within 75"}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "m, and SCS method is more suitable when the monitoring range is larger than 75"}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "m. To achieve the optimal network costs and the network life cycle by using SCS, the range of "}, {"#name": "italic", "_": "d"}, {"#name": "__text__", "_": " (the longitudinal spacing of adjacent nodes), is suggested as 10–12.5"}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "m and the energy of cluster head nodes is 60% higher than the energy of non-head nodes with fixed "}, {"#name": "italic", "_": "w"}, {"#name": "__text__", "_": " (the transverse distance of adjacent nodes). And the extra energy of head nodes can be obtained by adding the number of battery within the head nodes or using renewable energy technologies."}]}]}]}]}}