{"pii": "S1995820X23000524", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The coronavirus disease 2019 (COVID-19) pandemic, caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), has seriously threatened global public health and caused huge economic losses. Omics studies of SARS-CoV-2 can help understand the interaction between the virus and host, thereby providing a new perspective in guiding the intervention and treatment of the SARS-CoV-2 infection. Since large amount of SARS-CoV-2 omics data have been accumulated in public databases, this study aimed to identify key host factors involved in SARS-CoV-2 infection through systematic integration of transcriptome and interactome data. By manually curating published studies, we obtained a comprehensive SARS-CoV-2-human protein-protein interactions (PPIs) network, comprising 3591 human proteins interacting with 31 SARS-CoV-2 viral proteins. Using the RobustRankAggregation method, we identified 123 multiple cell line common genes (CLCGs), of which 115 up-regulated CLCGs showed host enhanced innate immunity and chemotactic response signatures. Combined with network analysis, co-expression and functional enrichment analysis, we discovered four key host factors involved in SARS-CoV-2 infection: IFITM1, SERPINE1, DDX60, and TNFAIP2. Furthermore, SERPINE1 was found to facilitate SARS-CoV-2 replication, and can alleviate the endoplasmic reticulum (ER) stress induced by ORF8 protein through interaction with ORF8. Our findings highlight the importance of systematic integration analysis in understanding SARS-CoV-2-human interactions and provide valuable insights for future research on potential therapeutic targets against SARS-CoV-2 infection."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "This study provides a panoramic view of the interactions between SARS-CoV-2 and the human host."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Through systematically integration, four host genes were identified critical for SARS-CoV-2 infection."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "SERPINE1 facilitates SARS-CoV-2 replication, and can alleviate the endoplasmic reticulum (ER) stress induced by ORF8 protein through interaction with ORF8."}]}]}]}]}]}]}}