{"pii": "S204604302400042X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The mobility of sizable trucks is often limited by their large size. They thus may have additional requirements on road types, road widths, and the turning radius at the intersection when travelling. Therefore, this study explores the unique needs and preferences of large truck drivers’ route choice with a focus on trip and road network characteristics. GPS trajectory data from the central Kansai area of Japan with numerous ports and freight terminals are used. Trajectories are considered having the same origin (destination) if their starting (ending) coordinates are in the same 500 m × 500 m mesh. For the trajectories of the same pair of origin–destination (OD) meshes, several route clusters are obtained based on geographical configuration using a QuickBundles algorithm. Sampling techniques are employed to equalize the number of input points for each vehicle trajectory and the optimal number of clusters is determined automatically by our algorithm based on the Silhouette Coefficient. By taking the clusters as route choice options for an OD pair, a Conditional Logit Model is used to identify the factors that influence the route choice considering both vehicle- and trip-specific attributes. The results quantify the preference of trucks for wider roads and toll routes, as well as aversion to long distances and turns. Heterogeneity in route choice based on vehicle type, trip time (date), and trip purpose is also evident. The findings of this study can provide insights for freight road network design and optimization."}]}]}]}}