{"pii": "S2046043023000321", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st080"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0250", "view": "all"}, "_": "A kSP-inspired re-routing algorithm is proposed to mitigate traffic congestion."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0255", "view": "all"}, "_": "A grid traffic network model is developed imitating actual traffic events."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0260", "view": "all"}, "_": "This re-routing algorithm is simulated and implemented to solve the developed model."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0265", "view": "all"}, "_": "The performance of this algorithm is validated by comparing with similar methods."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0270", "view": "all"}, "_": "This algorithm is proven to have outperformed others in congestion alleviation in heavy traffic."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st085"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp010", "view": "all"}, "$$": [{"#name": "__text__", "_": "This paper proposes a possible methodology for detecting and mitigating traffic congestion. This method is carried out using a custom-designed traffic scenario model. The model is fully developed in lieu of abundant data support from actual traffic events, which is applicable to localized traffic surveillance conditions, where massive data collection from surveilling devices is infeasible or unviable. This approach includes two parts: model construction and re-routing strategy. The model construction part focuses on the development of a traffic driving scenario, which takes various criteria such as traffic volume and traffic signal into consideration. The goal of this setup is to create a realistic-possible environment, where the proposed methods can be tested. The re-routing strategy is implemented based on the model simulation result of a medium-scale drive-able road map. The idea of the adaptive vehicle re-routing strategy is inspired by the "}, {"#name": "italic", "_": "k"}, {"#name": "__text__", "_": "-shortest path algorithm, adapted with the dynamic congestion re-routing strategy. It will be shown that the model is able to automatically identify congestion patterns that are happening on any road segments, and then initiates a proper re-routing strategy to alleviate such congestion in a timely manner. Although the methodology is realized and validated within a simulated model, the concept is transparent to any transportation system under study without extra complexity. In addition, the proposed modeling and simulation technique can be used for real-time implementation in intelligent transportation management systems."}]}]}]}]}}