{"pii": "S2059775424000130", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Machine learning (ML) is changing the way health care is practiced and recent applications of these novel statistical techniques have started to impact orthopaedic sports medicine. Machine learning enables the analysis of large volumes of data to establish complex relationships between “input” and “output” variables. These relationships may be more complex than could be established through traditional statistical analysis and can lead to the ability to predict the “output” with high levels of accuracy. Supervised learning is the most common ML approach for healthcare data and recent studies have developed algorithms to predict patient-specific outcome after surgical procedures such as hip arthroscopy and anterior cruciate ligament reconstruction. Deep learning is a higher-level ML approach that facilitates the processing and interpretation of complex datasets through artificial neural networks that are inspired by the way the human brain processes information. In orthopaedic sports medicine, deep learning has primarily been used for automatic image (computer vision) and text (natural language processing) interpretation. While applications in orthopaedic sports medicine have been increasing exponentially, one significant barrier to widespread adoption of ML remains clinician unfamiliarity with the associated methods and concepts. The goal of this review is to introduce these concepts, review current machine learning models in orthopaedic sport medicine, and discuss future opportunities for innovation within the specialty."}]}]}]}}