{"pii": "S2096579622000614", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"role": "background", "id": "abssec0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Determining how an image is visually appealing is a complicated and subjective task. This motivates the use of a machine-learning model to evaluate image aesthetics automatically by matching the aesthetics of the general public. Although deep learning methods have successfully learned good visual features from images, correctly assessing the aesthetic quality of an image remains a challenge for deep learning."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0020"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "To address this, we propose a novel multiview convolutional neural network to assess image aesthetics assessment through color composition and space formation (IAACS). Specifically, from different views of an image––including its key color components and their contributions, the image space formation, and the image itself––our network extracts the corresponding features through our proposed feature extraction module (FET) and the ImageNet weight-based classification model."}]}, {"#name": "abstract-sec", "$": {"role": "results", "id": "abssec0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0025"}, "_": "Result"}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "By fusing the extracted features, our network produces an accurate prediction score distribution for image aesthetics. The experimental results show that we have achieved superior performance."}]}]}]}}