{"pii": "S209526862400096X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "Rock failure can cause serious geological disasters, and the non-extensive statistical features of electric potential (EP) are expected to provide valuable information for disaster prediction. In this paper, the uniaxial compression experiments with EP monitoring were carried out on fine sandstone, marble and granite samples under four displacement rates. The Tsallis entropy "}, {"#name": "italic", "_": "q"}, {"#name": "__text__", "_": " value of EPs is used to analyze the self-organization evolution of rock failure. Then the influence of displacement rate and rock type on "}, {"#name": "italic", "_": "q"}, {"#name": "__text__", "_": " value are explored by mineral structure and fracture modes. A self-organized critical prediction method with "}, {"#name": "italic", "_": "q"}, {"#name": "__text__", "_": " value is proposed. The results show that the probability density function (PDF) of EPs follows the "}, {"#name": "italic", "_": "q"}, {"#name": "__text__", "_": "-Gaussian distribution. The displacement rate is positively correlated with "}, {"#name": "italic", "_": "q"}, {"#name": "__text__", "_": " value. With the displacement rate increasing, the fracture mode changes, the damage degree intensifies, and the microcrack network becomes denser. The influence of rock type on "}, {"#name": "italic", "_": "q"}, {"#name": "__text__", "_": " value is related to the burst intensity of energy release and the crack fracture mode. The "}, {"#name": "italic", "_": "q"}, {"#name": "__text__", "_": " value of EPs can be used as an effective prediction index for rock failure like "}, {"#name": "italic", "_": "b"}, {"#name": "__text__", "_": " value of acoustic emission (AE). The results provide useful reference and method for the monitoring and early warning of geological disasters."}]}]}]}]}}