{"pii": "S2093791121000822", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Underground mines have several hazards that could lead to serious consequences if they come into effect. Acquiring, evaluating, and using the real-time data from the atmospheric monitoring system and miner's positional information is crucial in deciding the best course of action."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0020"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "A graphical user interface–based software is developed that uses an AutoCAD-based mine map, real-time atmospheric monitoring system, and miners' positional information to guide on the shortest route to mine exit and other locations within the mine, including the refuge chamber. Several algorithms are implemented to enhance the visualization of the program and guide the miners through the shortest routes. The information relayed by the sensors and communicated by other personnel are collected, evaluated, and used by the program in proposing the best course of action."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0025"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "The program was evaluated using two case studies involving rescue relating to elevated carbon monoxide levels and increased temperature simulating fire scenarios. The program proposed the shortest path from the miner's current location to the exit of the mine, nearest refuge chamber, and the phone location. The real-time sensor information relayed by all the sensors was collected in a comma-separated value file."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0025", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0030"}, "_": "Conclusion"}, {"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "This program presents an important tool that aggregates information relayed by sensors to propose the best rescue strategy. The visualization capability of the program allows the operator to observe all the information on a screen and monitor the rescue in real time. This program permits the incorporation of additional sensors and algorithms to further customize the tool."}]}]}]}}