{"pii": "S209624952030051X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Natural resources plays efficient contribution in the human world in the way of consuming energy resources for the daily life cycle. The main concerns rely on the transporting oil from refining to the consumer usages through different modes. In the transportation passages, its performances are calibrated in the robust manner through sensor network communication and the periodical pigging inspection on the pipeline system. This chapter enumerates about the layout of oil pipeline system and its sensor measurement and instrumentation deliberately placed on the long run pipelines. The evolution of smart grid application enhances this oil transportation in a much corporate band by accumulatively orienting the sensor network in the utilization of power resources. Further, through the wireless communication associated with the smart grid, the pigging inspection gauges are exploited in the desired geographical area with better power consumption. Existing research on communication technologies in SG is briefly overviewed with the main focus on Cloud computing approaches. In this paper, the Smart Grid architecture and its applications are focused on entire oil pipeline from inlet to distribution substations first. The Cloud Computing architecture is explained thoroughly. Then, Cloud Computing for Smart Grid applications are also introduced in terms of efficiency, security and usability. Cloud platforms technical and security protocols are analyzed. Finally, the inspection of oil pipeline system by receiving sensor data of smart pigs incorporated with the cloud computing technique associated with smart grid application is elaborated with its SCADA hierarchical architecture. Further, simulation analysis of wireless sensor nodes with Flexmeter platform for power monitoring over smart pig case scenario is also presented with its layer-wise characterization."}]}]}]}}