{"pii": "S2090447924003587", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "Construction Quality Management (CQM) is important for achieving project quality objectives. Currently, CQM is mainly achieved through cyclical inspections and various tests and subsequent analysis of the generated text records. These texts record various construction quality problems (CQPs) that need to be categorized and analyzed by quality managers. However, the current classification and analysis of CQPs is mainly achieved by manual analysis or natural language processing (NLP), the former is time-consuming and labor-intensive, while the latter improves the processing efficiency but is limited by the classification perspective and fails to fully capture the root causes of the CQPs. CQPs text usually describes the problems based on the inspection area, and multiple types of problems may exist simultaneously in each record. The previous classification model of CQPs based on sub-projects can only distinguish the frequent quality problems of sub-projects but cannot analyze the essential characteristics of CQPs, and ignores the comprehensive characteristics of CQPs, such as short text and unbalanced data. Therefore, aiming at the problem of mixed text information and diverse categories of CQPs, this study constructs a TDA-WV-TextCNN model for automatic text categorization by combining the characteristics of unbalanced data and short text of CQPs, taking the actual on-site inspection reports from multiple sources as the data base, and determining the classification labels based on the perspective of CQPs result orientation. The model combines the part-of-speech-based Text Data Augmentation (TDA) method, Word2vec (WV) technique and Text Convolutional Neural Network (TextCNN) algorithm. The results show that the TDA-WV-TextCNN model has a short training time and a high accuracy in short text classification; the part-of-speech-based TDA method expands the small sample data by extracting the core feature words and the word position change, realizing the text data equalization and subsequently improving the accuracy of the model; multiple sources of data increase the diversity of data, redundant text increases the amount of data, both play an important role in improving the performance of the model, so the deletion of duplicate text is related to the model’s demand for the amount of data The research results provide a method to categorize quality reports quickly and accurately, which helps to construct the engineering quality knowledge system."}]}]}]}}