{"pii": "S209044792400385X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Purpose"}, {"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "This study provides a comprehensive bibliometric analysis for research in the area of fire prevention and mitigation in high-rise buildings, an emerging crucial subject. The analysis covers the period between 2010 and 2023, with the main goal of classifying and evaluating the efficacy of fire prevention and mitigation technologies."}]}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st015"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "The current study contributes a methodological approach for analyzing fire safety measures and highlighting the critical necessity for multidisciplinary approaches in enhancing fire safety protocols, with a special focus on the integration of advanced fire detection, suppression, and evacuation technologies. The investigation indicates a steady 10 % growth rate in scholarly production on this topic."}]}, {"#name": "abstract-sec", "$": {"id": "as015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st020"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "sp0015", "view": "all"}, "_": "Research on active fire prevention technologies has focused on the technologies including; 1) water mist suppression, 2) unmanned aerial vehicles, 3) Artificial Intelligence (AI) algorithms, and 4) Internet of Things (IoT) frameworks, while research on passive technologies has trended toward fire compartmentation and fire-resistant materials. The study identifies 6 passive technologies and 14 active technologies, with active technologies focusing on water mist suppression, AI algorithms, and IoT frameworks. On the other hand, passive technologies focus on risk assessment, fire protection, and management."}]}, {"#name": "abstract-sec", "$": {"id": "as020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st025"}, "_": "Conclusions"}, {"#name": "simple-para", "$": {"id": "sp0020", "view": "all"}, "_": "The current study analyzes the role of risk assessment, fire protection, and management in the development of the field of fire mitigation and prevention. The study highlights research collaboration toward reducing risk and fatalities by fire prevention and mitigation solutions. The US and China have the highest collaboration in these technologies, while the UK and the US have the highest publications."}]}, {"#name": "abstract-sec", "$": {"id": "as025", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st030"}, "_": "Research implications"}, {"#name": "simple-para", "$": {"id": "sp0025", "view": "all"}, "_": "The provided analysis ultimately serves as guidance for stakeholders involved in the design, policy-making, and implementation of fire safety measures in urban high-rise environments, and can give insight on future research direction toward effective strategies and technologies for fire mitigation and prevention in high-rise buildings."}]}]}]}}