{"pii": "S2095268617303440", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The daily operations in the mining industry are still a significant source of risk with regard to occupational safety and health (OS & H). Various research studies and statistical data world-wide show that the number of serious injuries and fatalities still remains high despite substantial efforts the industry has put in recent years in decreasing those numbers. This paper argues that the next level of safety performance will have to consider a transition from coping solely with workplace dangers, to a more systemic model taking organizational risks in consideration. In this aspect, lessons learned from the nuclear industry may be useful, as organizational learning processes are believed to be more universal than the technologies in which they are used. With the notable exception of major accidents, organizational performance has not received all the attention it deserves. A key element for reaching the next level of performance is to include organizational factors in low level events analyses, and approach the management as a risk control system. These factors will then appear not only in the event analysis, but in supervision activities, audits, change management and the like. Many recent event analyses across various industries have shown that organizational factors play a key role in creating conditions for triggering major accidents (aviation, railway transportation, nuclear industry, oil exploitation, mining, etc.). In this paper, a perspective that may be used in supervisory activities, self-assessments and minor events investigations, is presented. When ingrained in an organizational culture, such perspective has the highest potential for continuous safety improvement."}]}]}]}}