{"pii": "S2095809922004337", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The river networks in the plains of China are in low-lying terrain with mild bed slopes and weak hydrodynamics conditions. Filled with intense human activities, these areas are characterized by serious water security problems, for example, frequent floods, poor water self-purification capabilities, and fragile water ecosystems. In this paper, it’s found that all these problems are related to hydrodynamics, and the spatiotemporal imbalance of river network hydrodynamics is identified as the common cause of these water-related problems. From this, a theory for the hydrodynamic reconstruction of plain river networks is proposed. In addition to the importance of the flow volume, this theory highlights the role of hydrodynamics and limited energy in improving the ecological water environment. The layout of water conservancy project systems (e.g., sluices and pumping stations) is optimized to fully tapping the potential integrative benefit of projects. The optimal temporal and spatial distributions of hydrodynamic patterns are reconstructed in order to meet the needs of the integrated management of complex water-related problems in river networks. On this basis, a complete theoretical method and technical system for multiscale hydrodynamic reconstruction and multi-objective hydraulic regulation in plain river networks with weak hydrodynamics is established. The principles of the integrated management of water problems in river network areas are put forward. The practical application and efficacy of the theory are demonstrated through a case study aiming to improve the water quality of the river network in the main urban area of Yangzhou City."}]}]}]}}