{"pii": "S2090447924004337", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "Multiple-input multiple-output (MIMO) antennas are crucial for fifth-generation (5G) communications that enhance data transmission rate, spectrum utilization, channel quality, and reliability. State-of-the-art research shows that the 5G frequency-targeted extendable wideband miniaturized MIMO antenna with high isolation and gain as well as very low envelope correlation coefficient (ECC) is still very challenging, which is highly desirable for 5G large array MIMO system. This paper develops a miniaturized metamaterial (MM) loaded extendable wideband four and eight-element MIMO antenna with enhanced isolation, gain, and efficiency for 5G sub-6 GHz communications. Two unique MM structures are designed and employed in the proposed antenna to achieve miniaturization and enhance the overall performance of the antenna. The proposed MIMO configuration incorporates a new parasitic metamaterial (PMM) loaded single antenna in a generalized mirrored side-by-side mode. The inclusion of PMM within the antenna substrate leads to miniaturization (52.94 %) and improves antenna characteristics. After that, a unique inter-connected hook-shaped metamaterial superstrate (MMS) is designed and employed with the MIMO system at a very low air gap of 0.07λ"}, {"#name": "inf", "$": {"loc": "post"}, "_": "min"}, {"#name": "__text__", "_": ", which significantly enhances the antenna bandwidth (20.5 %), gain (2.4 dBi), and efficiency (6 %). Moreover, the MMS achieves enhanced high isolation of >15 dB and provides a wide bandwidth of (49.7 %) 3.04–5.05 GHz, covering the desired complete 5G n77/n78/n79 bands. Furthermore, this proposed unique MIMO structure can facilitate a greater number of MIMO elements. Besides, the proposed technique improves the diversity performance with a low ECC below 0.006, low channel capacity loss (CCL) of <0.4 bits/s/Hz, and a substantial diversity gain (DG) above 9.97 dB, proving low correlation and high channel capacity. In addition, an eight-element MIMO antenna is designed and elucidated with MM and exhibits promising performance, confirming its suitability for massive MIMO applications in 5G communications. The designed antenna is fabricated using FR-4 epoxy substrate and verified by measurement with acceptable agreement. Thus, the developed MM antenna design strategy with its reliable improved performance, leads to a promising solution for 5G sub-6 GHz MIMO communications."}]}]}]}]}}