{"pii": "S2097049824000064", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Road transportation plays a crucial role in society and daily life, as the functioning and durability of roads can significantly impact a nation's economic development. In the whole life cycle of the road, the emergence of disease is unavoidable, so it is necessary to adopt relevant technical means to deal with the disease. This study comprehensively reviews the advancements in computer vision, artificial intelligence, and mobile robotics in the road domain and examines their progress and applications in road detection, diagnosis, and treatment, especially asphalt roads. Specifically, it analyzes the research progress in detecting and diagnosing surface and internal road distress and related techniques and algorithms are compared. In addition, also introduces various road governance technologies, including automated repairs, intelligent construction, and path planning for crack sealing. Despite their proven effectiveness in detecting road distress, analyzing diagnoses, and planning maintenance, these technologies still confront challenges in data collection, parameter optimization, model portability, system accuracy, robustness, and real-time performance. Consequently, the integration of multidisciplinary technologies is imperative to enable the development of an integrated approach that includes road detection, diagnosis, and treatment. This paper addresses the challenges of precise defect detection, condition assessment, and unmanned construction. At the same time, the efficiency of labor liberation and road maintenance is achieved, and the automation level of the road engineering industry is improved."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "The development of pavement and internal distress detection is reviewed."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The current situation of pavement and internal distress diagnosis is summarized."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "New advances in road treatment methods are discussed."}]}]}]}]}]}]}}