{"pii": "S2095754820300028", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Objective"}, {"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "italic", "_": "Bushen Chengyun"}, {"#name": "__text__", "_": " granule (BCG) is an empirical treatment for female infertility (FI) caused by low endometrial receptivity (LER) involving a poorly understood mechanism. In this study, network pharmacology was used to explore the potential therapeutic mechanism of BCG on FI caused by LER."}]}]}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0020"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "__text__", "_": "The corresponding herb targets were obtained by conducting a search in the Traditional Chinese Medicine Systems Pharmacology Database and PubMed-reported literature. Disease targets were obtained from the following databases: Comparative Toxicogenomics Database, Human Phenotype Ontology, and Therapeutic Target Database. Treatments for LER using BCG have used target matching (BCG – LER target). Then, the predicted targets were uploaded to the Search Tool for the Retrieval of Interacting Genes/Proteins database for gene ontology enrichment and Kyoto Encyclopedia of Genes and Genomes pathway analyses. Furthermore, triptorelin acetate for injection + menotrophin + chorionic gonadotropin for injection were used to establish a mouse model of blastocyst implantation disorder and to evaluate the "}, {"#name": "italic", "_": "in vivo"}, {"#name": "__text__", "_": " effect of BCG on blastocyst implantation."}]}]}, {"#name": "abstract-sec", "$": {"id": "abssec0020", "role": "results", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0025"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "Overall, 156 bioactive chemical components and 1092 targets of BCG were identified. The results indicated that 482 biological processes (FDR < 0.01) and 15 pathways (FDR < 0.01) related to BCG participated in the complex treatment effects and were associated with the endocrine system, inflammatory responses, metabolism, apoptosis, ovulatory performance, and angiogenesis. Moreover, 16 hub nodes of BCG including estrogen receptor (ESR1), estrogen receptor beta (ESR2), progesterone receptor, et al, were recognized as potential treatment targets and might help clarify the underlying therapeutic mechanisms of BCG for female infertility. BCG significantly increased the protein expressions of estrogen receptors and progesterone receptors."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0025", "role": "conclusion", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0030"}, "_": "Conclusions"}, {"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "These findings reveal the potential therapeutic mechanism of BCG for female infertility involves low endometrial receptivity, which should be evaluated further."}]}]}]}}