{"pii": "S2090447921003105", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The way of expressing sentiment (−ve/+ve) in the form of textual information depends on the way of thinking of human beings. Identifying aspect extraction and sentiment polarity from written texts is a crucial task. Mainly, a multi-level learning approach for aspect extraction from statistical methods, pattern-based methods, and rule-based methods. This work proposes the application of two probabilistic graphical Latent Dirichlet Allocation (LDA) and Probabilistic Latent Semantic Analysis (PLSA) algorithms to generate latent topic terms as possible aspects. Then frequency-based and Concept lexicons are used to retrieve unigram to multi-word phrases with associated opinion words. Polarity shift is a significant issue that reverses the polarity of the aspects that affect the sentiment classification of the system. Therefore, to improve the performance of the machine learning classification algorithm in ABSA a hybrid approach comprising rule-based methods and a graph-theoretic model is applied to deal with the explicit and implicit polarity shift. The performance of the proposed method is measured using Naive Bayes, a machine learning classification algorithm on two datasets, SemEval 2014 Restaurant and SemEval 2014 Laptop dataset. Experimental result shows that the method for aspect extraction outperforms baseline methods by 86.32% and 82.64% for Restaurant, Laptop dataset, respectively. Similarly, for aspect-based sentiment classification, the accuracy and F1 measure on Restaurant domain 84.73%, 81.28% and 82.06% and 80.71% on the laptop domain."}]}]}]}}