{"pii": "S2090598X17301432", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Objective"}, {"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "To study the types and incidence of chromosomal abnormalities in infertile men with azoospermia and severe oligozoospermia in Qatar, and to compare the hormonal changes, testicular sperm retrieval rate, and intracytoplasmic sperm injection (ICSI) outcome between patients with chromosomal abnormalities and patients with idiopathic infertility."}]}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st015"}, "_": "Patients and methods"}, {"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "This study involved the retrospective chart review of 625 infertile male patients attending an academic tertiary medical centre in Qatar. Retrieved information included data on medical history, family history, clinical examination, semen analysis, initial hormonal profiles, and genetic studies, ICSI, and sperm retrieval results."}]}, {"#name": "abstract-sec", "$": {"id": "as015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st020"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "sp0015", "view": "all"}, "_": "The incidence of chromosomal abnormalities was 9.59% (10.6% amongst Qatari patients, 9.04% amongst non-Qataris). About 63.6% of the sample had azoospermia, of whom 10.8% had chromosomal abnormalities. Roughly 36.4% of the sample had oligozoospermia, of whom 7.5% had chromosomal abnormalities. There were no differences between patients with chromosomal abnormalities and those with idiopathic infertility for demographic and infertility features; but for the hormonal profiles, patients with idiopathic infertility had significantly lower luteinising hormone and follicle-stimulating hormone values. For ICSI outcomes, patients with chromosomal abnormalities had a significantly lower total sperm retrieval rate (47.4% vs 65.8%), surgical sperm retrieval rate (41.2% vs 58.1%), and lower clinical pregnancy rate (16.7% vs 26.6%) when compared to the idiopathic infertility group."}]}, {"#name": "abstract-sec", "$": {"id": "as020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st025"}, "_": "Conclusion"}, {"#name": "simple-para", "$": {"id": "sp0020", "view": "all"}, "_": "The incidence of chromosomal abnormalities in Qatar as a cause of severe male infertility is within a similar range as their prevalence internationally."}]}]}]}}