{"pii": "S209044792400532X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The advancement of increasingly powerful antennas has increased the complexity of radome electromagnetic (EM) design and analysis. The antenna systems are protected from environmental influences by radomes, which are dielectric and electromagnetically transparent structures. Because the presence of the radome affects the performance parameters of the antenna, such as the radiation pattern, reflected power, and side lobe level, its design should not be done independently of the antenna analysis. The great majority of ground-based hemispherical radomes are used for satellite communication antennas, commercial and military radars, telemetry systems, and other uses. Patch antennas, reflector antennas, phased array radars, and other antenna systems are used in these applications. The operational effectiveness of a radome architecture for housing multiple patch antenna systems is proposed and evaluated. The proposed line of work includes antenna-radome interaction analyses, electromagnetic designs for radome walls, and radiation patterns for reflector antennas. COMSOL Multiphysics was used to develop the EM radome and examine the antenna-radome interaction. The findings of a comprehensive analysis into the differences in radiation patterns produced by patch antennas with and without radomes are presented in this article. At a frequency of 1.62 GHz, a plot and investigation of the far-field gain of the microstrip patch antenna with and without radome were done. The radome is estimated to add 0.09 dBi to the gain boost experienced by the microstrip patch antenna."}, {"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Abbreviations: EM, Electromagnetic; DSF, Dielectric space frame radome; IFR, Induced field ratio; RF, Radio frequency; VSWR, Voltage standing wave ratio; FEM, Finite element method; SRR, Split ring resonator; CATR, Compact antenna test range; DUT, Device being tested; LHM, Left-handed metamaterials; PML, Perfectly matched layer; PTFE, Polytetrafluoroethylene."}]}]}]}}