{"pii": "S2152265017309308", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "teaser", "id": "abs0015", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0030", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0035"}, "_": "Micro-Abstract"}, {"#name": "simple-para", "$": {"id": "abspara0030", "view": "all"}, "_": "A systematic review and network meta-analysis were conducted to compare the clinical efficacy of immunomodulatory drug-containing regimens in patients with relapsed or refractory multiple myeloma. Daratumumab plus lenalidomide and dexamethasone had a significant advantage in improving progression-free survival of patients compared with other immunomodulatory drug-containing regimens."}]}]}, {"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"role": "background", "id": "abssec0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Previous network meta-analyses combined studies of immunomodulatory drug (IMiD)–containing and IMiD-free regimens, despite a lack of head-to-head randomized controlled trials to robustly link them. However, patients with relapsed or refractory multiple myeloma (RRMM) treated with IMiD-containing regimens differ from those treated with IMiD-free regimens, especially relating to treatment history, which is an important treatment-effect modifier requiring clinical consideration when evaluating the most appropriate subsequent treatment options. A need exists to separately assess the efficacy of treatment regimens for patients who are suitable candidates for IMiD-containing and IMiD-free regimens. The presented analyses will enable clinicians to assess the best regimens to use in patients suitable for IMiD-containing regimens."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0020"}, "_": "Materials and Methods"}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "We used a Bayesian network meta-analysis to compare IMiD-containing regimens in patients with RRMM. Additionally, subgroup analyses were conducted stratified by previous therapy line, previous bortezomib therapy, and previous lenalidomide therapy."}]}, {"#name": "abstract-sec", "$": {"role": "results", "id": "abssec0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0025"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "The results indicated that triplet combinations are more effective than doublet combinations. Of the triplet combinations, daratumumab, lenalidomide, dexamethasone (DRd) was significantly better in improving progression-free survival in patients with RRMM than were other IMiD-containing regimens (lenalidomide, dexamethasone [Rd]: hazard ratio [HR], 0.37; carfilzomib, Rd: HR, 0.54; elotuzumab, Rd: HR, 0.54; ixazomib, Rd: HR, 0.50). Similar trends were observed for overall survival and overall response. DRd showed the greatest probability of being the best treatment for all clinical efficacy outcomes. The subgroup analyses results were consistent with the base-case results."}]}, {"#name": "abstract-sec", "$": {"role": "conclusion", "id": "abssec0025", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0030"}, "_": "Conclusion"}, {"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "In patients with RRMM who are suitable for an IMiD-containing regimen, DRd showed clear advantages in survival and response outcomes compared with other IMiD-containing regimens."}]}]}]}}