{"pii": "S2153353923001645", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "sp0020", "view": "all"}, "_": "Distributed ledger technology (DLT) enables the creation of tamper-resistant, decentralized, and secure digital ledgers. A non-fungible token (NFT) represents a record on-chain associated with a digital or physical asset, such as a whole-slide image (WSI). The InterPlanetary File System (IPFS) represents an off-chain network, hypermedia, and file sharing peer-to-peer protocol for storing and sharing data in a distributed file system. Today, we need cheaper, more efficient, highly scalable, and transparent solutions for WSI data storage and access of medical records and medical imaging data."}]}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0015"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "sp0025", "view": "all"}, "_": "WSIs were created from non-human tissues and H&E-stained sections were scanned on a Philips Ultrafast WSI scanner at 40× magnification objective lens (1 μm/pixel). TIFF images were stored on IPFS, while NFTs were minted on the Ethereum blockchain network in ERC-1155 standard. WSI-NFTs were stored on MetaMask and OpenSea was used to display the WSI-NFT collection. Filebase storage application programing interface (API) were used to create dedicated gateways and content delivery networks (CDN)."}]}, {"#name": "abstract-sec", "$": {"id": "as0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "sp0030", "view": "all"}, "$$": [{"#name": "__text__", "_": "A total of 10 WSI-NFTs were minted on the Ethereum blockchain network, found on our collection “Whole Slide Images as Non-fungible Tokens Project” on Open Sea: "}, {"#name": "inter-ref", "$": {"xmlns:xlink": true, "id": "ir0105", "href": "https://opensea.io/collection/untitled-collection-126765644", "type": "simple"}, "_": "https://opensea.io/collection/untitled-collection-126765644"}, {"#name": "__text__", "_": ". WSI TIFF files ranged in size from 1.6 to 2.2 GB and were stored on IPFS and pinned on 3 separate nodes. Under optimal conditions, and using a dedicated CDN, WSI reached retrieved at speeds of over 10 mb/s, however, download speeds and WSI retrieval times varied significantly depending on the file and gateway used. Overall, the public IPFS gateway resulted in variably poorer WSI download retrieval performance compared to gateways provided by Filebase storage API."}]}]}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0025"}, "_": "Conclusion"}, {"#name": "simple-para", "$": {"id": "sp0035", "view": "all"}, "_": "Whole-slide images, as the most complex and substantial data files in healthcare, demand innovative solutions. In this technical report, we identify pitfalls in IPFS, and demonstrate proof-of-concept using a 3-layer architecture for scalable, decentralized storage, and access. Optimized through dedicated gateways and CDNs, which can be effectively applied to all medical data and imaging modalities across the healthcare sector. DLT and off-chain network solutions present numerous opportunities for advancements in clinical care, education, and research. Such approaches uphold the principles of equitable healthcare data ownership, security, and democratization, and are poised to drive significant innovation."}]}]}]}}