{"pii": "S2199853123001506", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0050", "view": "all"}, "_": "The rapid evolution of the IoT has led to various research challenges for improving smart city applications. Owing to the characteristics and virtues of IoT services, waste management has emerged as a prominent issue in today's society. An undiscerning illegal eviction of waste, lack of waste disposal and management systems, and inept waste management policies have resulted in severe health and environmental challenges. Based on an integrative review, the proposed technique provides insight into the potential of smart cities and associated communities in assisting waste management initiatives. This study has referred to the existing waste management issues in urban areas and proposed an IoT-based smart waste management system of India in aspects of COVID-19 afflicted houses. Our system intends to improve waste management by making regular environmental sterility and making COVID situations more convenient. The proposed framework ensures a solution for efficiently handling waste generated in urban areas, focusing on the interaction among concessioners and waste generators to monitor the unfilled level of bins. This proposal offers dynamic waste collection scheduling and route optimization while achieving quality of service."}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0055", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Smart waste management system specially designed for COVID-19 impacted houses."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Hybrid network architecture offers cost effective waste level monitoring system."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Provides dynamic waste collection scheduling and route optimization mechanisms while maintaining quality of service."}]}]}]}]}]}]}}