{"pii": "S2212827122006990", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0061", "view": "all"}, "_": "Within the product innovation process, companies are required to design their product according to diverse external influence dimensions from the product environment. By the analysis of these influence dimensions, companies gain insight into the urgency or possibility to innovate their product accordingly. As the majority of data within the business context available is text data, there is a need to formulate a method that enables companies to evaluate the data relevant for the product innovation accordingly. As the manual evaluation of this data is not feasible due to the high data amount, especially for small and medium sized companies, a concept for an automated evaluation method is required. This concept uses approaches from the field of text mining and applies them to the innovation management in order to gain insight from diverse texts about innovation potentials. This concept includes the definition of a suitable preprocessing, a topic modeling approach for this use case and a collection of options for the topic exploration. The preprocessing defines how usually occurring text documents can be converted into a format that is manageable for the text mining approach. The topic modeling is based on a constrained TF-IDF- weighted Latent Dirichlet Allocation to identify preferably new and unique topics within the considered dataset. Afterwards, the identified topics can be explored in differentiated ways in order to gain a better insight into the product environment. The validation of this method on three sample datasets tests its limitations but indicates also the potential of an automated text analysis for innovation management."}]}]}]}}