{"pii": "S2210776224001224", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara004", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "Liquid biopsies can assist in diagnosis, treatment selection and response, relapse, and recurrence assessment."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "ALK mutations in ctDNA can be crucial for diagnosis, ALK inhibitor response, and relapse assessment."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "Epigenetic, genetic, and cell surface markers in ctDNA can be used to detect relapse."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "Recurrence can depend on treatment response and is reflected in epigenetic and genetic markers in ctDNA."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara005", "view": "all"}, "_": "Neuroblastoma is a paediatric malignancy of the sympathoadrenal or Schwann cells derived from the neural crest. Risk stratification in neuroblastoma is informed by MYCN amplification, age, stage, ploidy, and segmental chromosomal alterations. High-risk cases bear dismal overall survival. A panel of pathology and imaging modalities are utilised for diagnosis, while treatment strategies depend on the risk group. Despite this, relapse can occur in 50% of high-risk neuroblastoma patients in remission post-treatment. Liquid biopsies typically comprise the sampling of the peripheral blood and are attractive since they are less invasive than surgical tumour tissue biopsies. Liquid biopsies retrieve circulating tumour DNA and circulating tumour RNA released by tumours in addition to circulating tumour cells. These biological materials can be utilised to analyse tumour genetic alterations. Monitoring tumour-derived molecular information can assist diagnostics, targeted therapy selection, and treatment while reflecting minimal residual disease, relapse, and recurrence. This study aims to review the latest research on liquid biopsies for disease diagnosis, assessing treatment efficacy, minimal residual disease, relapse, and recurrence in neuroblastoma. A deeper understanding of the application of liquid biopsies could inform future prospective clinical trials, and in time, facilitate their routine implementation in clinical practice."}]}]}]}}