{"pii": "S2211379723000955", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Metamaterial (MTM) based double negative (DNG) was designed and investigated both numerically and experimentally."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "The DNG metamaterial was able to cover the multiband frequencies (S and C bands)."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "In the designed structure obtained a high effective medium ratio (EMR) value of 15.61."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The designed MTM useful for different applications such as wireless communications, satellite communication, and wireless sensor networks."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "In this paper, we designed and investigated a parallel double-E shaped structure based on double negative (DNG) metamaterial (MTM) both numerically and experimentally, which can be utilized for multiband applications. We used the Computer Simulation Technology (CST) Microwave Studio electromagnetic simulator to design the MTM and obtain the numerical results. The proposed MTM has a unit cell dimension of 8 × 8 × 1.57 mm"}, {"#name": "sup", "$": {"loc": "post"}, "_": "3"}, {"#name": "__text__", "_": ", and Rogers RT 5880 was used as the substrate, resulting in a high effective medium ratio (EMR) value of 15.61. The DNG metamaterial can cover multiband frequencies (S and C bands) and produce three resonance frequencies of 2.40, 4.50, and 7.24 GHz. Parametric studies were performed for different configurations by changing the type of substrates, substrate thicknesses, split gaps, and unit cell arrays to optimize the proposed design. An equivalent circuit was validated using the advanced design system (ADS) software and compared to the CST simulated results, which showed good agreement. The proposed structure is highly significant due to its low profile (small size) and ordinary resonator arrangement, which produced double negative properties with a high EMR over a wide range of frequencies. The recommended structure can be useful for different applications such as wireless communications, weather radar, satellite communication, and wireless sensor networks."}]}]}]}]}}