{"pii": "S2213020916300301", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Summary"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "_": "MANET is a set of independent mobile devices which communicate through constrained wireless links over a relative bandwidth. Due to the mobility of devices, the topology of the network may change rapidly and unpredictably over time, making multicast routing and route maintenance a very crucial task. Plenty of protocols have been proposed for the construction of virtual backbone, but they have limitations in terms of control overhead, delay, throughput, energy consumption and mobility. As a part of multicast routing, virtual backbone construction has been proposed and classified into three different techniques: tree-based virtual backbone, cluster-based virtual backbone and dominating set-based virtual backbone. Upon this classification, plenty of protocols are available, and each protocol has some limitations in terms of control overhead, delay, throughput, energy consumption and mobility. Besides this, no existing backbone protocol has the scope of recovery of link failures. In order to overcome the limitations of existing protocols, our proposed protocol An Efficient Backbone Based Quick Link Failure Recovery Multicast Routing Protocol, it is a four phase protocol: Group Formation, Backbone Construction, On-demand Route Discovery and Route Maintenance. The main aim of the proposed protocol is to construct an efficient robust backbone to overcome the limitations of existing protocols and to provide a mechanism for the quick recovery of link failures by generating an alternate path from the point of failure to the destination, which can be adoptable in any sort of environment."}]}]}]}}