{"pii": "S2212827116312859", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "_": "Due to the effects of mass-customization there is an increase of the variance of products combined with a reduction of the number of units per variation. Therefore, it is necessary that the next generations of production lines, especially the assembling devices, have to be designed more adaptable. Regarding business information systems this trend is realized by an increasing digital integration of the particular units. Especially, for mass production the so called “line concept” is well established. This inflexibility of the physical material flow blocks the spread of mass-customization into established industrial sectors where linked manufacturing steps are commonly used. In a flow-orientated value stream with physically linked production units it is not possible to produce individualized products without additional expenses. Therefore, it is necessary to resolve the physically linked material flow equal to the digital integration of the units. This will lead to a physically and digitally full-meshed production site. The enabler is an autonomous navigating and smart transport system for a physical integration of the production units. Especially for the production of goods with a high variant diversity the benefits of a physically meshed production site are obviously. Each part gets his own and individual routing, which depends on the current machine availability and the setting of each machine. Furthermore, this approach creates a new degree of freedom for production site planning. The placement of the machines has not to be flow-oriented due to the individual and flexible connection by autonomous and self-navigating transport entities. Thereby, the advantages of a flow-oriented mass-production can be combined with those of a job-shop production."}]}]}]}}