{"pii": "S2211467X2100136X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The energy transition is leading to profound changes in all parts of the energy system, but the reduction of fossil fuels in the heating sector is a major challenge for the energy sector. The changing heat-generating structure also affects its supply infrastructures. The impact on the existing electricity infrastructure is evident and subject to a lot of research, but gas distribution networks are not considered in most studies. The ongoing defossilization brings the need to assess the impact on gas distribution networks. The assumption of gas as a bridge technology might lead to potential lock-ins or sunk cost. The central question reads: how will gas distribution networks change by 2050 as we move towards a greenhouse gas neutral energy system?"}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "This question is answered by using a model network analysis called DINO to compute the infrastructure development and associated cost for existing greenhouse gas-neutral scenarios from present day until the year 2050. The supply task and the necessary network elements with their physical parameters are included in the model, and the cost-optimal gas distribution network infrastructure is calculated for each county in Germany."}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "In short, the infrastructure analysis shows a declining need for gas distribution networks for all given greenhouse gas-neutral scenarios. In all-electric scenarios, the network length of the required grid infrastructure decreases to zero by 2050. Even in moderate scenarios with high shares of synthetic gas in the heating system, less gas distribution infrastructure is needed. The results of the research presented in this paper can be used to support the necessary measures to ensure a development of gas distribution networks that support greenhouse gas neutrality."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Impact of the energy transition on gas distribution networks."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Investigation the infrastructure changes with a model network analysis."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Change of gas distribution networks until 2050 under greenhouse gas neutrality."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Cost-optimal gas distribution network infrastructure for Germany."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "Declining need for gas distribution networks in the scenarios investigated."}]}]}]}]}]}]}}