{"pii": "S2211379723010483", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "3D metal structure."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Flexible substrate based on a polymer mesh."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "THz device."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "A multifunctional terahertz (THz) device with frequency tunability, amplitude modulation and spectral filtering abilities, and substrate flexibility is highly desired for various applications, such as THz communication, sensing, wearable optoelectronics. Therefore, this study proposed a 3D artificial material based on a flexible polyethylene terephthalate (PET) woven-wire mesh with conductive coating surfaces. This material was conceptually demonstrated in experiments as a dual-functional THz device. In addition, the transmission properties of this artificial material were experimentally and numerically explored with reasonable agreement. Then, the underlying mechanism of the spectral characteristics was qualitatively elucidated. The amplitudes and frequencies of the spectral characteristics were successfully validated to be passively manipulated by tailoring the structural parameters of a unit cell and changing the surface conductivities of a device. This process opened the application feasibility of a frequency tunable bandpass filter and a power switch at the THz regime. For the bandpass filter application, the tri-frequency modulation capability was experimentally demonstrated, and a frequency tuning bandwidth of 0.249 THz was achieved by varying the conductivity of the device’s surface-coating layer from 0.44 to 77 MS/m. For the power switch application, the largest modulation depth between the on and off states of a device was successfully demonstrated at approximately 21.3 dB at 0.271 THz. This dual-function THz device has the advantages of compactness, low cost, and easy fabrication, thus providing an alternative strategy to develop tunable, flexible, and versatile THz devices for broad applications."}]}]}]}}