{"pii": "S2212420924000141", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "It is important to take evacuation behavior when a small river overflows or inland flooding occurs and there is a risk of subsequent flooding of a large river. To this end, even if roads are flooded, people should consider taking horizontal evacuation measures if possible and evacuating to places with a low risk of flooding or to evacuation shelters. Although local governments have published hazard maps for flood damage, these are mostly for large rivers and only provide information on the maximum depth of inundation. In addition, no evacuation routes have been described, and evacuees often choose the shortest route to evacuation shelters. However, if flooding significantly affects the shortest route to an evacuation shelter, then that is not the best route. Therefore, it is important to consider multiple evacuation routes that take flooding conditions into account. Thus, this study aims to validate whether method for evacuating inundated areas via the shortest possible route help improve evacuation safety and reduce evacuation time. The validation was conducted by means of a multiagent model evacuation simulation considering the time-series inundation depth of the inundation simulation results. After performing validation under multiple conditions, this study found that evacuating inundated areas via the shortest possible route not only increases evacuation safety but also significantly reduces the evacuation time required. The verification results show that method for evacuating inundated areas through the shortest route can be positioned as a safe and optimal evacuation action under occasionally changing circumstances when evacuation decisions are delayed."}]}]}]}}