{"pii": "S2215098623000885", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "In wireless sensor networks (WSNs) with constrained sensor node energy, data compression is crucial. Generally speaking, data communication uses up energy. By providing and receiving less data, a sensor node's lifespan is often increased. In this paper, provide an unique unsupervised neural network architecture called Partly-Informed Sparse Autoencoder (PISAE) that tries to reconstruct all sensor readings from chosen prime numbers. This architecture is used to implement the sensor selection approach that we propose. A key challenge for WSN is the selection of the cluster head (CH). Utilizing the K-Medoid, the clustering of sensor nodes is improved. The effect on quality of service (QoS), the location of the sensor nodes, the distance involved, and the energy status requirements are important factors. For the best choice of cluster heads in WSN with regard to distance and energy, the hybridization of two well-known optimization methods, namely Bacteria Foraging Optimization and Harmony Search Algorithm (HSA), is carried out in this study. Opportunistic routing protocol for WSN is proposed in the current work as a cross-layer based opportunistic Routing protocol (CORP). The suggested CORP approach is utilised to identify the best course of action to cut down on computation time and energy usage while enhancing data transmission dependability. Future generations of ubiquitous sensor networks won't have a single AI solution to the problems with energy and load. In addition, this study puts forth the idea of an energy-efficient routing using Fuzzy neural network (ERFN), which can increase the lifespan of WSNs by lowering energy consumption while maintaining energy usage balance. Based on the simulation findings, it can be stated that the proposed CORP approach increases QoS performance metrics such energy consumption, packet delivery rate, packet delay, network lifetime, throughput, and packet loss rate. The performance of the suggested method outperforms that of already-in-use algorithms like FRLDG, MOBFO-EER, and FEEC-IIR."}]}]}]}}