{"pii": "S2214860422002895", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0165", "view": "all"}, "_": "Many prior works highlight the potential of additive manufacturing (AM) for flow components. Examples include hydraulic manifolds with multiple crossing flow channels that guide separate fluid flows in a single part. Creating the 3D geometry of such complex parts can be challenging. Designers must consider functional requirements, such as minimizing the channels’ length, creating smooth channel paths, and preventing overlaps between channels for different fluid flows. Furthermore, designers must adhere to manufacturing restrictions specific to the chosen AM technology. Critical overhangs inside channels must be avoided for processes such as laser powder bed fusion by adapting the shape of channel cross-sections. However, such production-related design changes can cause overlaps between different channels and require re-adjusting the channel paths. Consequently, routing several flow channels is often challenging when manually designing parts for AM. This work aims to automate the routing of multiple channels considering the AM overhang restriction. The presented approach models flow channels as virtual cables defined by a chain of particles (connected by line segments) and collision spheres (located at the cable particles). The cable line segments describe the path or centerline of channels, while the cable collision spheres approximate the required space of each channel. The cables are initialized as straight lines between the channel inlets and outlets and iteratively subjected to geometric-based constraints, e.g., to minimize the cables’ length and smoothen their paths. The collision spheres are used to detect overlaps between channels for different flows and repel the affected cables from each other. The radii of the collision spheres are iteratively updated to consider the adaption of cross-sections for AM. After the iterative cable simulation convergences, the cable paths are used to generate a detailed 3D part design. A case study applies the approach to a hydraulic manifold fabricated using laser powder bed fusion of stainless steel. The study demonstrates the automated design and production of customized design variants."}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0170", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "This work generates the paths of multiple flow channels guiding separate fluids with multiple crossings in a single part."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "The channels are routed by representing them as virtual cables that are iteratively imposed to geometric-based constraints."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Functional constraints are imposed, such as minimizing the cables’ length, smoothing the paths, and preventing overlaps."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The constraints also consider the overhang restriction for additive manufacturing and adaption of channel cross-sections."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "The approach is demonstrated for a hydraulic manifold and used to generate custom design variants for individual customers."}]}]}]}]}]}]}}