{"pii": "S2210832717302302", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "MANET (Mobile Ad hoc Network) consists the nodes that are self-energized and shall be able to accommodate limited energy levels, and usually the nodes transmit the data using the intermediate nodes to the ones that are not in hop levels. In such conditions, the lifetime of the intermediary nodes turn out to be a critical factor, and hence only when the routes are having maximum residual energy and the ones that have high, spend minimal energy for transmitting the data is very important. In terms of route selection, the emphasis is much on multicast routing and the route discovery, and the efficient nodes selection has to take place with emphasis on QoS. Hence, the energy efficient multicast route discovery process has gained significant importance, and there are many potential solutions depicted in the process. Energy Efficient Lifetime Aware Multicast (EELAM) Route Selection strategy for MANETs is the proposed multicast route discovery approach that is developed using the adaptive genetic algorithm. EELAM works based on tree topology that differentiates to other tree based on multicast routing topologies by adapting evolutionary computation strategy defined as genetic algorithm, which shall play a critical role in terms of selecting optimal intermediate nodes with maximal residual energy and minimal energy usage. The fitness function that devised for the adaptive genetic algorithm targeted for improving the energy consumption ratio, improving the residual batter life and towards improving the multicasting scope. The process and the methods that are adapted are contemporary and is different to the traditional genetic algorithms, and still the outcome as depicted in the experimental results reflect the fact that the EELAM is the best of in its class that can support in addressing the limitations in the current solutions and towards managing improved route discovery."}]}]}]}}