{"pii": "S2213158219303110", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0060", "view": "all"}, "_": "Deficits in lexical retrieval are commonly observed in individuals with post-stroke aphasia. Successful lexical retrieval is related to lexical diversity, lexical sophistication, and phonological word properties; however, the crucial brain regions supporting these different features are not fully understood. We performed MRI-based lesion symptom mapping in 58 individuals with a chronic left hemisphere stroke to assess how regional damage relates to spoken discourse-extracted measures of lexical diversity, lexical sophistication, and phonological word properties. For discourse transcription and word feature analysis, we used the Computerized Language Analysis (CLAN) program, Stanford Core Natural Language Processing, Irvine Phonotactic Online Dictionary, Lexical Complexity Analyzer, and Gramulator. Lesions involving the left posterior insula and supramarginal gyri and inferior fronto-occipital fasciculus were significant predictors of utterances with, on average, lower lexical diversity. Low lexical sophistication was associated with damage to the left pole of the superior temporal gyrus. Production of words with lower phonological complexity (fewer phonemes, higher phonological similarity) was associated with damage to the left supramarginal gyrus. Our findings indicate that discourse-extracted features of lexical retrieval depend on the integrity of specific brain regions involving insular and peri-Sylvian areas. The identified regions provide insight into potentially underlying mechanisms of lexically diverse, sophisticated and phonologically complex words produced during discourse."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0065", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Word production in connected speech of individuals with post-stroke aphasia depends on lesion locations"}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Low lexical diversity is linked to lesions to the left insula, supramarginal gyrus and inferior fronto-occipital fasciculus"}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Lexical sophistication is linked to lesions to the left pole of the temporal gyrus"}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Phonological word features are linked to lesions to the left supramarginal gyrus"}]}, {"#name": "list-item", "$": {"id": "li0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Features of lexical retrieval in connected speech depend on the integrity of ventral and dorsal language processing streams"}]}]}]}]}]}]}}