{"pii": "S2215098624000193", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e669", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e670"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e672", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e673", "view": "all"}, "_": "The dominance of dual-setting directional overcurrent relays (DS-DOCRs) based protection schemes and associated high-reliability requirements require rigorous verification of these schemes before deployment. Traditionally, numerical and simulation-based methods are used to analyze the performance of these schemes. However, they are incomplete and, thus, cannot provide complete and accurate analysis results due to their inherent limitations, like round-off errors and sampling-based deductions. Analyzing the impact of each replacement level (replacement of conventional DOCRs by DS-DOCRs) on the protection performance/efficacy of individual network lines is challenging as each deployment level leads to different primary and backup relay protection pairs, which may lead to miscoordination. Also, the random and uncertain nature of faults leads to numerous possible scenarios, which need to be rigorously considered during the analysis. As a more complete and accurate analysis approach, we propose to utilize probabilistic model checking, which is a formal verification technique, for the performance verification of DS-DOCRs-based protection schemes. A formal analysis methodology to determine the optimal deployment of DS-DOCRs. The proposed analysis requires formal models of the behavior of fault, C-DOCRs, and DS-DOCRs-based protection systems, and these models are developed as part of our work. Moreover, we also formalize the quantitative properties to determine the impact of various relay deployment scenarios on the performance of the protection system. For illustration purposes, we use formal models for the quantitative verification of a state-of-the-art DS-DOCRs-based protection scheme for power distribution networks using the probabilistic model checker. This helps us identify the most optimal protection solution for different scenarios."}]}]}]}}