{"pii": "S2214914721001264", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Text event mining, as an indispensable method of text mining processing, has attracted the extensive attention of researchers. A modeling method for knowledge graph of events based on mutual information among neighbor domains and sparse representation is proposed in this paper, i.e. UKGE-MS. Specifically, UKGE-MS can improve the existing text mining technology's ability of understanding and discovering high-dimensional unmarked information, and solves the problems of traditional unsupervised feature selection methods, which only focus on selecting features from a global perspective and ignoring the impact of local connection of samples. Firstly, considering the influence of local information of samples in feature correlation evaluation, a feature clustering algorithm based on average neighborhood mutual information is proposed, and the feature clusters with certain event correlation are obtained; Secondly, an unsupervised feature selection method based on the high-order correlation of multi-dimensional statistical data is designed by combining the dimension reduction advantage of local linear embedding algorithm and the feature selection ability of sparse representation, so as to enhance the generalization ability of the selected feature items. Finally, the events knowledge graph is constructed by means of sparse representation and "}, {"#name": "italic", "_": "l"}, {"#name": "inf", "$": {"loc": "post"}, "_": "1"}, {"#name": "__text__", "_": " norm. Extensive experiments are carried out on five real datasets and synthetic datasets, and the UKGE-MS are compared with five corresponding algorithms. The experimental results show that UKGE-MS is better than the traditional method in event clustering and feature selection, and has some advantages over other methods in text event recognition and discovery."}]}]}]}]}}