{"pii": "S2212017312005178", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "aep-abstract-id8"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id9"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "$$": [{"#name": "__text__", "_": "RFID technology ("}, {"#name": "italic", "_": "Radio Frequency IDentification"}, {"#name": "__text__", "_": ") enables putting an identification label (e.g. tag) into a certain object and, by means of a reader, get the information related to it without any physical contact. The use of these tags in medical context enables a rapid and precise identification of each patient and, by means of Internet of Things (IoT), enables a ubiquitous and quick access to medical related records. These technologies, RFID and IoT, integrated within a suitable system, promote a better physician-patient interaction. A simple IoT-enabled system can send warnings to any physician, nurse or other health caregiver. Therefore, with a simple IoT architecture one may remotely monitor and control the patient's well being. This paper presents an IoT architecture, using RFID tags, able to easily and remotely establish a medication control system, beginning from physicians prescription to pharmaceutical drug administration. This paper presents the implementation and analysis of a prototype service, with a web interface, allowing for a first evaluation of the proposed service. The prototype service -based on RFID, EPC ("}, {"#name": "italic", "_": "Electronic Product Code"}, {"#name": "__text__", "_": ") and ONS ("}, {"#name": "italic", "_": "Object Name Service"}, {"#name": "__text__", "_": ") -and its web interface are presented and evaluated. Some use cases are presented and evaluated using this prototype service entitled "}, {"#name": "italic", "_": "“RFID-based IoT for medication control”"}, {"#name": "__text__", "_": "."}]}]}]}]}}