{"pii": "S2214790X23000023", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara008", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "The Philippines is one of the world's deadliest countries for environmental defenders, and women environmental defenders face additional gendered dangers and consequences."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "Impoverished, rural, Indigenous, and otherwise multiply marginalized women are at high risk of vulnerability and retaliation in environmental conflicts because of how extractive industries contribute to a loss of agency and status."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "Mining and logging are especially deadly to Filipina defenders partly because such industries institutionalize and exacerbate violent, gendered subordination."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0005", "view": "all"}, "_": "The circumstances of their martyrdom were subtly gendered, including their exposure and vulnerability to conflicts, mobilization opportunities, and experienced violence."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara009", "view": "all"}, "_": "This article contributes to discussions of extractive violence by exploring how gender influences violent circumstances under which women were assassinated during environmental conflicts. Partnership with local activists facilitated the reporting of cases of martyred Filipina women environmental defenders on the Environmental Justice Atlas (EJAtlas). Twenty cases from the EJAtlas involving thirty-one women environmental defenders martyred for their activism were analyzed qualitatively examining why and how differences and similarities emerge based on intersectional factors with special attention to gender. Findings suggest that 1) impoverished, rural, Indigenous, and otherwise multiply marginalized women were at high risk of vulnerability and retaliation in environmental conflicts because of their loss of agency and status; 2) mining and logging were deadliest partly because such industries institutionalize and exacerbate violent, gendered subordination 3) the circumstances of their murders were subtly gendered, including their exposure and vulnerability to conflicts, mobilization opportunities, and experienced violence."}]}]}]}}