{"pii": "S2212041623000517", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "We provide a synthesis on emerging technologies in ES research, i.e., digital support for assessing ES."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Technologies support ES research due to low costs, high data availability, and high flexibility."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Constraints in processing performance and uncertainties in variables and models are current limitations."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Complementarity of technologies suggests that their combination can improve the understanding of ES."}]}, {"#name": "list-item", "$": {"id": "o0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Future research should increase access, transparency, communication, and transdisciplinary collaboration."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Rapid technological development opens up new opportunities for assessing ecosystem services (ES), which may help to overcome current knowledge gaps and limitations in data availability. At the same time, emerging technologies, such as mobile devices, social media platforms, and artificial intelligence, give rise to a series of challenges and limitations. This study provides a comprehensive overview of the broad range of technologies that are increasingly used for collecting, analyzing, and visualizing data on ES, including Earth observation, mobile technologies, data science, modeling/simulation, immersive technologies, visualization, and web-based tools. To identify current opportunities and challenges, we systematically reviewed the literature on ES of the last 10 years (2012–2022). We first describe the state-of-the-art of emerging technologies, synthesizing their applicability, opportunities, and limitations. Then, we discuss open issues, future research needs, and potential for further applications in ES research. Our findings indicate great opportunities to increase knowledge on ES thanks to low costs, high data availability, and high flexibility of the technologies. We also find a strong potential to support decision-making, learning and communication. However, limitations and challenges related to the accuracy of the variables and models, accessibility to data, technologies, and information as well as ethical concerns need to be addressed by the research community to assure an inclusive and meaningful use of the technologies. Our findings also suggest that further insights into ES may be achieved through a better integration of different technologies in the future, e.g., Earth observation, data science, and web-based platforms, a stronger transdisciplinary collaboration to advance knowledge on ES, and by broadening the perspective to technological developments in other related fields of research."}]}]}]}}