{"pii": "S2213846324002645", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The manufacturing shop floor exists in a dynamic environment with constantly changing components regarding position and features. Presence tracking on the manufacturing shop floor is essential to enhance effective operations and safety. Internet of Things technology solutions have been developed to track and monitor machine and operators’ movements and materials on the shop floor to enhance machine availability and worker safety and improve overall operational effectiveness. However, for SMMs with limited financial resources and infrastructure, there is a need for a financially friendly approach to shop floor presence tracking and monitoring. This work presents the use of Internet-of-things and physics-based engines to develop a scalable and customizable solution to track presence on a manufacturing floor. The paper aims to improve and promote the adoption of I-4.0 technologies and digital manufacturing by SMMs with the development of an affordable, repeatable, customizable, open-source solution. The article describes a methodology for mapping, modeling, monitoring, and reporting presence on a manufacturing floor using physics-based engines. The methodology describes mapping the manufacturing floor into zones, the design of the IoT solution, selecting and placing sensors, and presenting the data using dashboards and physics-based engines. The paper investigates the methodology by implementing a case study on the Interdisciplinary Center for Advanced Manufacturing Systems (ICAMS) manufacturing floor using the Unity3D game engine, open-source software, and off-the-shelf motion sensors."}]}]}]}}