{"pii": "S2212420921004702", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Archaeological sites are extremely vulnerable to the impacts of weather-related events, which may lead to irreparable damages to cultural heritage. Here an assessment of the debris-flow hazard for the UNESCO site of Roman Villa del Casale (Italy) is carried out, through a combination of historical analyses, field surveys, geomorphological and hydrological investigations and two-dimensional hydraulic numerical modelling, all performed at river catchment scale. Historical analyses reveal that the site has been hit by several landslides in the far and recent past. This is presently confirmed by the high level of exposure to the impact of rain-triggered debris-flow events, due to the position of the Villa at a closure section of the related river basin and to the hydro-geomorphological characteristics of the basin itself. By applying the proposed approach, a scenario analysis is carried out. Results allow one to highlight the dynamics of the impact of debris flows, thanks to space and time-dependent maps about deposition areas, water depth and speed values, and to identify the most vulnerable archaeological elements within the study site. The numerical simulations are also used to test the efficiency of the existing hydraulic defense systems and to support the implementation of an early warning system for the site protection. Here, we also synthetize the design of the architecture of the wireless monitoring network, the sensor technology adopted to develop an effective real time environmental monitoring system and management platform, to construct a Wireless Sensor Network (WSN) - early warning and reporting system, which can be applied as a prevention measure."}]}]}]}}