{"pii": "S2212827122003663", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0184", "view": "all"}, "_": "Searching and optimally locating maintenance tools is an important undertaking that influences productivity. The efficiency lost can be high for intensive maintenance processes, particularly in instances where technicians share critical (and expensive) tooling. Real-Time Location Systems (RTLS) can serve as a feasible solution for minimizing travel and search times, by tagging tools, thereby dynamically tracking their spatial location real-time. Moreover, RTLS can be deployed alongside Automated Guided Vehicles (AGV’s) thereby supporting smart material handling."}, {"#name": "simple-para", "$": {"id": "spara0185", "view": "all"}, "_": "In this paper, we propose a model for exploring the added value of implementing RTLS with AGV to better support maintenance processes in high-demand manufacturing and maintenance shop floors. The NetLogo (multi-agent programmable environment) simulation model mimics interactions of maintenance technicians, tasks, and critical tooling within an aircraft maintenance facility. To evaluate the added value of tagging critical tooling to better enhance efficiency locating tools, we define three use-cases. The first case mimics a current scenario in which critical tools are untagged, hence assuming significant search and travel times are incurred by technicians. The second case explores scenarios where tools are tagged, and trackable within the spatial environment of the hangar. The third case integrates both RTLS and AGVs to support both locating tools, and minimising travel times by technicians. Initial simulations results show significant added value for the second and third experiments, verifying suitability of implementing RTLS for complex maintenance and manufacturing processes."}]}]}]}}