{"pii": "S2214785323039755", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "Manual water curing is a widespread practice, yet achieving proper curing to prevent plastic cracking and ensure long-term strength and durability poses a difficulty. Aside from being labor-intensive, manual water curing is also uneconomical and has negative effects on aesthetics. As an alternative, certain researchers suggest an automated curing method that estimates water loss and replenishes it using a theory-based calculation and taking into account the weather conditions. However, their effectiveness is restricted as the estimated water loss may not be completely accurate due to several factors that impact it. To address these challenges, we propose a conceptual automated water curing system that utilizes real-time monitoring with the Internet of Things (IoT) technology. The system involves wireless sensors for temperature and relative humidity, a smart water valve, water sprinklers, and an IoT gateway. As per ASTM F2170, the sensors can be positioned, and data will be collected, examined, and handled in real-time using an IoT gateway. The IoT gateway transmits data to the smart water valve, which then sprays water when the moisture level drops below the preset threshold. This process continues until the concrete reaches a certain strength level estimated using internal concrete temperature data and the Maturity method. Moreover, the data can be transmitted continuously to cloud storage to keep track of the concrete's durability. The proposed automated water curing system offers numerous advantages, such as eliminating the risk of concrete failure caused by inadequate curing, being efficient in terms of time and resources, monitoring real-time strength development, not being impacted by other factors, and having practical benefits for both stakeholders and society."}]}]}]}}