{"pii": "S2212420924006198", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e4073", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e4074"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e4076", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e4077", "view": "all"}, "_": "Cultural heritage, especially those inscribed on the UNESCO World Heritage List, is meant to be valued by mankind and protected for future generations. Triggered by radical and sometimes disastrous Heritage-Related Events (HREs), communities around the world are actively involved on social media to share their opinions and emotional attachments. This paper presents exploratory data analyses on a dataset collected from Twitter concerning HREs in World Heritage that triggered global concerns, with cases of the Notre Dame Paris fire and the Venice flood, both in 2019. The spatiotemporal patterns of tweeting behaviours of online communities before, during, and after the event demonstrate a clear distinction of activation levels caused by the HREs. The dominant emotions and topics of people during the online debate are detected and visualized with pre-trained deep-learning models and unsupervised clustering algorithms. Clear spatiotemporal dynamics can be observed from the data collected in both case studies, while each case also demonstrated its specific characteristics due to the different severity. The methodological framework proposed and the analytical outcomes obtained in this paper could be used both in urban studies to mine the public opinions about HREs and other urban events for reducing risks, and by the Geo-AI community to test spatiotemporal clustering algorithms."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e4079", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e4080"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e4082", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e4083", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e4085"}, "$$": [{"#name": "list-item", "$": {"id": "d1e4086"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e4089", "view": "all"}, "_": "Twitter datasets collected and analysed for Heritage-Related Events (HREs): the Notre Dame fire and the Venice flood."}]}, {"#name": "list-item", "$": {"id": "d1e4091"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e4094", "view": "all"}, "_": "Framework proposed for mapping the spatiotemporal features of public reactions concerning HREs."}]}, {"#name": "list-item", "$": {"id": "d1e4096"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e4099", "view": "all"}, "_": "Semantics detected with machine learning models to inform heritage management in disaster risks."}]}]}]}]}]}]}}