{"pii": "S2213158212000125", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "aep-abstract-id7"}, "$$": [{"#name": "section-title", "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id8"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "Neuronal underpinnings of auditory verbal hallucination remain poorly understood. One suggested mechanism is brain activation that is similar to verbal imagery but occurs without the proper activation of the neuronal systems that are required to tag the origins of verbal imagery in one's mind. Such neuronal systems involve the supplementary motor area. The supplementary motor area has been associated with awareness of intention to make a hand movement, but whether this region is related to the sense of ownership of one's verbal thought remains poorly known. We hypothesized that the supplementary motor area is related to the distinction between one's own mental processing (auditory verbal imagery) and similar processing that is attributed to non-self author (auditory verbal hallucination). To test this hypothesis, we asked patients to signal the onset and offset of their auditory verbal hallucinations during functional magnetic resonance imaging. During non-hallucination periods, we asked the same patients to imagine the hallucination they had previously experienced. In addition, healthy control subjects signaled the onset and offset of self-paced imagery of similar voices. Both hallucinations and the imagery of hallucinations were associated with similar activation strengths of the fronto-temporal language-related circuitries, but the supplementary motor area was activated more strongly during the imagery than during hallucination. These findings suggest that auditory verbal hallucination resembles verbal imagery in language processing, but without the involvement of the supplementary motor area, which may subserve the sense of ownership of one's own verbal imagery."}]}]}, {"#name": "abstract", "$": {"class": "graphical", "id": "aep-abstract-id9"}, "$$": [{"#name": "abstract-sec", "$": {"id": "aep-abstract-sec-id10"}, "$$": [{"#name": "section-title", "_": "Highlights"}, {"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "► We compared involuntary (hallucinations) and voluntary (imagery) verbal processing. ► First such study in patients. ► Supplementary motor area (SMA) activation differed between conditions. ► Language-related circuitries were similarly activated during both conditions. ► Convergent evidence from intra-subject and between-groups analyses. ► SMA may be involved in the experience of the ownership of one's verbal thought."}]}]}]}}