{"pii": "S221491472400182X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "In a time characterized by the availability of vast amounts of data, the effective utilization of information is critical for timely decision-making in military operations. However, processing large amounts of data requires computational resources and time. Therefore, decision makers have used data-centric technologies to take advantage of public and private data sources to support military operations. This survey explores the integration and application of data-centric technologies, such as data analytics, data science, and machine learning, to optimize decision-making workflows within military contexts supporting the deployment of military assets and resources. To address the information gap, this article presents a literature review, specifically a survey. Our survey examines the use of the mentioned technologies to process and analyze information that contributes to the phases of situational awareness, and planning in military environments. We then introduce a taxonomy of the approaches associated with implementing these technologies in military scenarios. Furthermore, we discuss relevant factors for the seamless integration of data-centric technologies into military decision-making processes, and reveal the importance of specialized personnel, architectures, and cybersecurity issues in the task of developing prototypes and models. The findings of this paper aim to provide valuable insights for military institutions, offering a deeper understanding of the use of data-centric technologies as innovative practices to enhance the effectiveness of military decision-making."}]}]}]}}