{"pii": "S2212096321000735", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "Extreme weather-related events are likely to increase in both frequency and intensity if current emission rates continue. Particularly vulnerable to the potential effects of climate change is the transportation sector, which fully relies on the uninterrupted accessibility of the road network. With the Swedish Government adopting a National Adaptation Strategy in 2018, creating a coordinated cross-disciplinary strategy underpinned by international frameworks, new ambition levels regarding climate change adaptation efforts have been established. Identifying particularly vulnerable parts of the road network is an essential step for National Road Authorities (NRAs) in early planning stages to prioritize adaptation efforts around high-risk areas to safeguard the road network. By utilizing both publicly and commercially available climate-related data, as well as applying and assessing new terrain analysis techniques, a large-scale vulnerability assessment is carried out for Halland County in southwestern Sweden by assessing three climate-adjusted extreme weather events (a 100-year pluvial flood event, a 100-year fluvial flood event, and an extreme coastal storm surge event) projected to exacerbate in the region. The study demonstrates how a GIS-based screening method, specifically adapted for NRAs or similar stakeholders, may provide quick overviews of potentially at-risk areas along road networks through a simple vulnerability index assigned to individual road segments. Further studies are recommended to compare modeled results to recorded flood events if available and incorporate updated climate change trajectories from upcoming IPCC reports."}]}]}]}}