{"pii": "S2214209623001201", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0200", "view": "all"}, "_": "Achieving reliable connectivity in heterogeneous vehicular networks is a challenging task, owing to rapid topological changes and unpredictable vehicle speeds. As vehicular communication demands continue to evolve, multipath connectivity is emerging as an important tool, which promises to enhance network interoperability and reliability. Given the limited coverage area of serving access technologies, frequent disconnections are to be expected as the vehicle moves. To ensure seamless communication in dynamic vehicular environments, an intelligent path management algorithm for Multipath TCP (MPTCP) has been proposed. The algorithm utilizes a network selection mechanism based on Fuzzy Analytic Hierarchy Process (FAHP), which dynamically assigns the most appropriate underlying network for each running application. The selection process takes into account multiple factors, such as path quality, vehicle mobility, and service characteristics. In contrast to existing solutions, our proposed method offers a dynamic and comprehensive approach to network selection that is tailored to the specific needs of each service to ensure that it is always paired with the optimal access technology. The results of the evaluation demonstrate that the proposed method is highly effective in maintaining service continuity during vertical handover. By tailoring the network selection to the specific needs of each application, our path manager is able to ensure optimal connectivity and performance, even in challenging vehicular environments, delivering a better user experience, with more reliable connections, and smoother data transfers."}]}]}]}}