{"pii": "S2212827124007698", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara1112", "view": "all"}, "_": "The European Commission’s “Flightpath 2050” highlights the critical role of the design phase in complex aircraft development. Ensuring the aircraft’s functionality, particularly for certification, represents a significant proportion (around 50%) of the total development cost. The increasing complexity of the testing process presents challenges. For example, the creation of simulation models for HIL testing and the performance of exploratory tests for certification are becoming increasingly complex due to the growing complexity of aircraft design."}, {"#name": "simple-para", "$": {"id": "spara1113", "view": "all"}, "_": "To address this challenge, this research aims to integrate AI modelling and data analysis into aircraft test processes as part of the design process. The aim is to develop a user-friendly modelling tool for test engineers without the need for data analyst expertise. The approach focuses on achieving seamless interoperability and easy integration of test-related data sources and AI models, eliminating the need for complex scripting in scripting languages such as Python or Matlab. To achieve this goal, a domain ontology and generic wrappers have been developed to map generic AI models to the TensorFlow and Matlab tools. At the same time, data sources are connected via a data integration tool."}, {"#name": "simple-para", "$": {"id": "spara1114", "view": "all"}, "_": "The evaluation successfully demonstrates the ability to analyse the correlation between sensors in an experimental cooling system without understanding the data format of the data sources and without the scripting of the AI model to model and execute the AI models."}]}]}]}}