{"pii": "S2212670813001243", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "_": "A major requirement of ubiquitous healthcare systems consists in the provision of low power usage, battery operated devices that are used in long term patient monitoring. Thus far, researchers have tried to adapt various short range technologies such as IEEE802.15.4, classical Bluetooth etc., to achieve this goal. The IEEE802.15.4 was, by excellence, widely deployed because of its low power and its security features compared to technologies such as the classical Bluetooth. However, the Bluetooth Special Interest group has recently announced Bluetooth 4.0 with low energy technology (BLE) for low power personal area networked devices, which offers more compelling features in various aspects when compared to IEEE802.15.4. This makes its evaluation for healthcare applications an urgently needed endeavour. In this paper, we present a BLE-based remote health monitoring system in which we have interfaced an ECG simulator directly to a BLE enabled CC2540 wireless sensor node (a system-on-chip (SoC) for Bluetooth low energy applications, from Texas Instruments). The node acts as a slave to the Master BLE device. In our system, we have used a BLE112 module (from Bluegiga) as a slave node while for the master we have used a BLE USB dongle connected to a PC in order to manage data received from the sensor node. A server application running on the PC uses a TCP-based connection over the network interface in order to enable remote monitoring. Any remote client can connect to the server and receives live updates from the sensor node. We have developed a LabVIEW based TCP client application to provide this functionality. An ECG simulator was used to generate ECG signals for different heartbeat rates that were sent through the BLE enabled network. The waveforms received at remote station using the developed system were found to conform exactly to those captured using a high resolution oscilloscope."}]}]}]}}