{"pii": "S2211379723006010", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "A flexible fiber-optic sensor enabled by deep learning-based data analytics is proposed and experimentally demonstrated for bending curvature sensing."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "The trained deep learning model could effectively extract features from the collected signal data and accurately recognize the speckle patterns at different bending curvatures."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "In a perturbed environment, the trained optical classification model is suitable for the speckle dataset recognition with high accuracy rate of 98.3%."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The deep-learning-enabled fiber curvature sensors achieves high speckle recognition accuracy, both in the presence and absence of external perturbations."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "A flexible fiber-optic sensor enabled by deep learning is proposed and experimentally demonstrated for highly efficient curvature sensing application. This sensing modulation system combines a deep optical neural network based on a small training dataset, aiming to simplify speckle data capture and sensor model evaluation. The multimode fiber concatenated with a section of single stress-applying fiber serves as a sensing unit as well as an image transport medium. A type of hybrid scattering speckle images is collected and employed to provide more freedom to identify the bending curvature with and without external disturbances. In a perturbed environment, the trained optical classification model is suitable for the speckle dataset recognition with high accuracy rate of 98.3%. Moreover, the deep-learning-enabled fiber curvature sensor shows great potential for practical applications in real-time structural safety test, including studies on health monitoring of infrastructure equipment and aerospace wings."}]}]}]}}