{"pii": "S2238785422018348", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Commercial bulk hydrogen is mainly produced in petrochemical steam reforming furnaces inside centrifugally cast Nb-modified HP austenitic stainless steels tubes, which operate at temperatures above 900 °C. In-service aging causes well known microstructural modifications such as the transformation of primary niobium carbides, NbC, into the G-phase (Ni"}, {"#name": "inf", "$": {"loc": "post"}, "_": "16"}, {"#name": "__text__", "_": "Nb"}, {"#name": "inf", "$": {"loc": "post"}, "_": "6"}, {"#name": "__text__", "_": "Si"}, {"#name": "inf", "$": {"loc": "post"}, "_": "7"}, {"#name": "__text__", "_": "). Unexpected operational problems, such as reduced feedstock flow may, in a few minutes, cause severe overheating. These short-time temperature surges, can lead tubes to premature failure often through the formation of large longitudinal cracks. Little is known about the integrity of the tubes that undergo a temperature surge without cracking. Thus, understanding the microstructural changes brought upon by these events becomes extremely important when assessing the reuse of these tubes. In the present work, by means of optical microscopy, scanning electron microscopy and transmission electron microscopy with energy dispersive X-ray spectroscopy, two Nb and NbTi-modified HP steels tubes, which cracked due to high temperature surges, were analyzed. Results show that "}, {"#name": "italic", "_": "insitu"}, {"#name": "__text__", "_": " dissolution of the G-phase in the thermally affected regions causes this phase to be replaced by fine NbC or (NbTi)C precipitates. These microstructural transformations suffered by the tubes during the short-time overheating and cooling cycles are thus presented and discussed in terms of their practical consequences."}]}]}]}]}}