{"pii": "S2287884X23001437", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Identifying avian migration routes and habitats is critical for species conservation and management. South Korea is an important region in the East Asian-Australasian flyway, inhabited by various migratory birds. In this study, previous research on avian migration routes in South Korea was systematically analyzed, and research trends and characteristics were determined. Among 64 peer-reviewed papers, the number of papers by year has gradually increased since the 2000s. Land birds were the most extensively studied, followed by wading birds, raptors, waterfowl, multiple waterbird groups, and shorebirds. Among the research methods, wildlife tracking devices were most commonly used ("}, {"#name": "italic", "_": "n"}, {"#name": "__text__", "_": " = 32), followed by direct visual observation ("}, {"#name": "italic", "_": "n"}, {"#name": "__text__", "_": " = 19), bird banding ("}, {"#name": "italic", "_": "n"}, {"#name": "__text__", "_": " = 10), and stable isotope analysis (SIA; "}, {"#name": "italic", "_": "n"}, {"#name": "__text__", "_": " = 3). Sinan-gun, a Korean island, received the greatest attention; several studies have been conducted across various regions throughout South Korea. Text mining showed that the following terms were frequently used and strongly correlated: ‘home’, ‘range’, ‘breeding’, ‘wintering’, ‘island’, ‘area’, and ‘habitat’. Based on our findings, we predict that, as technology advances, the number of studies on migration routes of a greater diversity of species using global positioning system (GPS) tracking and SIA will continue to increase."}]}]}]}]}}