{"pii": "S2352664516300141", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "a000005", "lang": "en", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st000005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as000005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp000075", "view": "all"}, "_": "Image tagging is an essential step for developing Automatic Image Annotation (AIA) methods that are based on the learning by example paradigm. However, manual image annotation, even for creating training sets for machine learning algorithms, requires hard effort and contains human judgment errors and subjectivity. Thus, alternative ways for automatically creating training examples, i.e., pairs of images and tags, are pursued. In this work, we investigate whether tags accompanying photos in the Instagram can be considered as image annotation metadata. If such a claim is proved then Instagram could be used as a very rich, easy to collect automatically, source of training data for the development of AIA techniques. Our hypothesis is that Instagram hashtags, and especially those provided by the photo owner/creator, express more accurately the content of a photo compared to the tags assigned to a photo during explicit image annotation processes like crowdsourcing. In this context, we explore the descriptive power of hashtags by examining whether other users would use the same, with the owner, hashtags to annotate an image. For this purpose 1000 Instagram images were collected and one to four hashtags, considered as the most descriptive ones for the image in question, were chosen among the hashtags used by the photo owner. An online database was constructed to generate online questionnaires containing 20 images each, which were distributed to experiment participants so they can choose the best suitable hashtag for every image according to their interpretation. Results show that an average of 66% of the participants hashtag choices coincide with those suggested by the photo owners; thus, an initial evidence towards our hypothesis confirmation can be claimed."}]}]}, {"#name": "abstract", "$": {"id": "a000010", "lang": "en", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st000010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as000010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp000080", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l000005"}, "$$": [{"#name": "list-item", "$": {"id": "li000005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p000005", "view": "all"}, "_": "Instagram hashtags as annotation metadata is examined."}]}, {"#name": "list-item", "$": {"id": "li000010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p000010", "view": "all"}, "_": "Instagram photo-hastags as training sets for Automatic Image Annotation is proposed."}]}, {"#name": "list-item", "$": {"id": "li000015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p000015", "view": "all"}, "_": "Half of the chosen Instagram hashtags describe the visual content of an image."}]}, {"#name": "list-item", "$": {"id": "li000020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p000020", "view": "all"}, "_": "Instagram hashtags can be used as training examples for machine learning algorithms."}]}]}]}]}]}]}}