{"pii": "S2352710223005958", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The commercial building and residential sectors are responsible for 27% of the global electricity consumption, with cooling and heating loads being the dominant contributors. Much of the thermal energy inside of buildings is wasted by means of transmission through conventional windows. Low emissivity (low-e) windows have been incorporated as an effective method to minimize energy utilisation because of their ability to reflect external heat radiation, thus reducing cooling loads. Such windows have been widely used in the architectural and automotive sectors to block both ultraviolet (UV) and infrared (IR) radiation from the Sun. The windows consist of multi-layer thin coatings (metallic and dielectric layers), which are highly transparent in the visible but reflective to IR radiation (heat). However, the metallic layers attenuate telecommunication signals used for modern-day telecommunications such as radio frequency (RF) and microwave (μW) signals. As there is an ever-increasing demand for a reliable interior to exterior mobile communication coverage, these windows need to be transparent for reliable wireless communication. A class of engineered materials is a promising solution to improve signal transmission through low-e windows; by applying a frequency selective surface (FSS) pattern onto the window. FSS can be realised by producing a periodic of repetitive shapes incorporated onto the window surface to filter selective electromagnetic waves. This review highlights the FSS patterning technique applied onto low-e windows to allow for low attenuation transmission of telecommunication signals."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "This study performs a critical review of the FSS technique on low-e windows."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The review highlights the telecommunication signals attenuation on low-e windows."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The FSS technique reduces the attenuation of telecommunication signals."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "An overview of different FSS patterns on low-e windows."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "Discussion of current challenges and future perspectives."}]}]}]}]}]}]}}