{"pii": "S2352914824000042", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Atelectasis is the loss of volume caused by decreasing gas in a specific area of the lung. It occurs when the lung sacs (alveoli) do not fully inflate, resulting in a lack of oxygen to the blood, tissues, organs, and fill with alveolar fluid. It can be caused by pressure outside of your lung, an obstruction, poor airflow, or scarring. It is critical to diagnose this lung condition as soon as possible. Chest X-rays are the most commonly utilized diagnostic tool for this condition. Examining chest X-rays, however, is difficult even for a professional radiologist. There is a need to improve diagnosis accuracy. As a result, this study proposes a novel detection and classification approach for rapid diagnosis of atelectasis utilizing patient chest X-ray data. To diagnose atelectasis from chest X-ray images, we used state-of-the-art models like VGG19, Inception, and a deep learning method (CNN). This study presents an effective method for categorizing chest X-ray images as normal or atelectasis-infected. This study offers a convolutional neural network (CNN) method to aid medical experts in identifying atelectasis disease. The anisotropic diffusion filtering (ADF) approach was used to improve image edge preservation, reduce noise, and contrast limited adaptive histogram equalization (CLAHE) for improving the contrast of low-intensity images. After evaluating the CNN model, it achieved 99.88 % training accuracy, 99 % validation accuracy, and 99 % test accuracy. In this study, CNN achieved a result that outperformed state-of-the-art models (VGG19 and Inception). As a result of the findings, deep features provided consistent and reliable features for detecting atelectasis. Therefore, the suggested method expedites atelectasis diagnosis and radiologists' screening of atelectasis patients."}]}]}]}}