{"pii": "S2351978919303178", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0101", "view": "all"}, "_": "The implementation of vehicle communication systems requires the development of a communication protocol between vehicles. For the design and development of active safety systems, it is intended to develop autonomous systems to collect and analyze information related to the external environment of the vehicle (based on radar systems, video cameras, image processing, etc.); and design and implementation of systems that exchange information between traffic vehicles."}, {"#name": "simple-para", "$": {"id": "spara0102", "view": "all"}, "_": "Intelligent solutions across a wide range of wireless networks, from large cellular networks to home networks, are being deployed in the field of transportation. A problem with information management and transmission is observed in e WSNs (wireless sensor networks), which usually contain hundreds or even thousands of terminal nodes, which must transmit collected data or commands to a data repository. Creating a means of communication between vehicles and traffic control devices is essential, thus forming an ad hoc network of variable sizes. The so-formed network provides vehicle drivers with information on road conditions, traffic congestion, accidents, warnings, and can help optimize traffic. The paper addresses the issue of inter-vehicle communication by presenting a minimalistic approach, facilitating intervehicular communication through a WSN network, considering extra-urban traffic areas with a high degree of complexity and changing environment (altitude changes, dangerous curves, difficult road conditions)."}]}]}]}}