{"pii": "S2352914816300326", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Medical databases contain large volume of data about patients and their clinical information. For extracting the features and their relationships from a huge database, various data mining techniques need to be employed. As Liver transplantation is the curative surgical procedure for the patients suffering from end stage liver disease, predicting the survival rate after Liver transplantation has a big impact. Appropriate selection of attributes and methods are necessary for the survival prediction. Liver transplantation data with 256 attributes were collected from 389 attributes of the United Nations Organ Sharing registry for the survival prediction. Initially 59 attributes were filtered manually, and then Principal Component Analysis (PCA) was applied for reducing the dimensionality of the data. After performing PCA, 197 attributes were obtained and they were ranked into 27 strong/relevant attributes. Using association rule mining techniques, the association between the selected attributes was identified and verified. Comparison of rules generated by various association rules mining algorithm before and after PCA was also carried out for affirming the results. The various rule mining algorithms used were Apriori, Treap mining and Tertius algorithms. Among these algorithms, Treap mining algorithm generated the rules with high accuracy. A Multilayer Perceptron model was built for predicting the long term survival of patients after Liver transplantation which produced high accuracy prediction result. The model performance was compared with Radial Basis Function model to prove the accuracy of survival of liver patients'. The top ranked attributes obtained from rule mining were fed to the models for effective training. This ensures that Treap mining generated associations of high impact attributes which in-turn made the survival prediction flawless."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "One solution for the dimensionality of database is to remove the attributes which are less significant."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "To find out significant and essential attributes by PCA and ranking."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Using association rule mining techniques, the association between the selected attributes was identified and verified."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "The top ranked attributes obtained from PCA and rule mining was fed to the ANN model for effective training."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "To prove the accuracy, comparison of model had been done."}]}]}]}]}]}]}}