{"pii": "S2352864822002772", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "A large number of Web APIs have been released as services in mobile communications, but the service provided by a single Web API is usually limited. To enrich the services in mobile communications, developers have combined Web APIs and developed a new service, which is known as a mashup. The emergence of mashups greatly increases the number of services in mobile communications, especially in mobile networks and the Internet-of-Things (IoT), and has encouraged companies and individuals to develop even more mashups, which has led to the dramatic increase in the number of mashups. Such a trend brings with it big data, such as the massive text data from the mashups themselves and continually-generated usage data. Thus, the question of how to determine the most suitable mashups from big data has become a challenging problem. In this paper, we propose a mashup recommendation framework from big data in mobile networks and the IoT. The proposed framework is driven by machine learning techniques, including neural embedding, clustering, and matrix factorization. We employ neural embedding to learn the distributed representation of mashups and propose to use cluster analysis to learn the relationship among the mashups. We also develop a novel Joint Matrix Factorization (JMF) model to complete the mashup recommendation task, where we design a new objective function and an optimization algorithm. We then crawl through a real-world large mashup dataset and perform experiments. The experimental results demonstrate that our framework achieves high accuracy in mashup recommendation and performs better than all compared baselines."}]}]}]}}