{"pii": "S2352864823000408", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Causality extraction has become a crucial task in natural language processing and knowledge graph. However, most existing methods divide causality extraction into two subtasks: extraction of candidate causal pairs and classification of causality. These methods result in cascading errors and the loss of associated contextual information. Therefore, in this study, based on graph theory, an "}, {"#name": "bold", "_": "E"}, {"#name": "__text__", "_": "nd-to-end "}, {"#name": "bold", "_": "M"}, {"#name": "__text__", "_": "ulti-"}, {"#name": "bold", "_": "G"}, {"#name": "__text__", "_": "ranulation "}, {"#name": "bold", "_": "C"}, {"#name": "__text__", "_": "ausality "}, {"#name": "bold", "_": "E"}, {"#name": "__text__", "_": "xtraction model (EMGCE) is proposed to extract explicit causality and directly mine implicit causality. First, the sentences are represented on different granulation layers, that contain character, word, and contextual string layers. The word layer is fine-grained into three layers: word-index, word-embedding and word-position-embedding layers. Then, a granular causality tree of dataset is built based on the word-index layer. Next, an improved tagREtriplet algorithm is designed to obtain the labeled causality based on the granular causality tree. It can transform the task into a sequence labeling task. Subsequently, the multi-granulation semantic representation is fed into the neural network model to extract causality. Finally, based on the extended public SemEval 2010 Task 8 dataset, the experimental results demonstrate that EMGCE is effective."}]}]}]}]}}