{"pii": "S2352484722013154", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e1579"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1580"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e1582"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e1583"}, "_": "Piezoelectric wind energy harvesters based on flow-induced vibration are attracting widespread attention because they can provide long-term sustainable power to wireless sensor network nodes. In order to improve the harvesting performance, this paper proposes a multi-interference local pressure modulation mechanism, and a three-plate multi-interference structure is applied for verification. Computational fluid simulations indicate that this three-plate multi-interference structure can effectively combine the double wake flow effect of the upstream double plates and the high-pressure feature in front of the downstream single plate. So that the local pressure of the fluid field can be effectively modulated to generate a significant lift force on the bluff body. Experiments show that this structure can promote the VIV(vortex-induced vibration)-based energy harvester to exhibit galloping vibration. Moreover, compared to the cases with only a single downstream plate or a double-plate upstream structure, lower cut-in wind speed and higher harvesting efficiency can be achieved by using the multi-interference structure. When the horizontal distance of the downstream plate, the horizontal and vertical offset distances of the upstream plates are set as 0.5D, 0.5D and 1.5D (D: windward width of the bluff body), respectively, the harvester can generate the highest output power of about 1.4 mW at a wind speed of 5 m/s. By introducing a spring–damper coupling mechanism, the synchronous movement of two side-by-side energy harvesters can be realized, thereby realizing the synchronous output of voltage and increasing the output power per unit volume."}]}]}]}}