{"pii": "S2352864816300268", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0060", "view": "all"}, "_": "This work is dedicated to constructing a multi-scale structural health monitoring system to monitor and evaluate the serviceability of bridges based on the Hadoop Ecosystem (MS-SHM-Hadoop). By taking the advantages of the fault-tolerant distributed file system called the Hadoop Distributed File System (HDFS) and high-performance parallel data processing engine called MapReduce programming paradigm, MS-SHM-Hadoop features include high scalability and robustness in data ingestion, fusion, processing, retrieval, and analytics. MS-SHM-Hadoop is a multi-scale reliability analysis framework, which ranges from nationwide bridge-surveys, global structural integrity analysis, and structural component reliability analysis. This Nationwide bridge survey uses deep-learning techniques to evaluate the bridge serviceability according to real-time sensory data or archived bridge-related data such as traffic status, weather conditions and bridge structural configuration. The global structural integrity analysis of a targeted bridge is made by processing and analyzing the measured vibration signals incurred by external loads such as wind and traffic flow. Component-wise reliability analysis is also enabled by the deep learning technique, where the input data is derived from the measured structural load effects, hyper-spectral images, and moisture measurement of the structural components. As one of its major contributions, this work employs a Bayesian network to formulate the integral serviceability of a bridge according to its components serviceability and inter-component correlations. Here the inter-component correlations are jointly specified using a statistics-oriented machine learning method (e.g., association rule learning) or structural mechanics modeling and simulation."}]}]}]}}