{"pii": "S2352914823000667", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "With the increasing development of information and scientific databases, scientific collaboration has expanded in health sciences. This study aims to prioritize the criteria that affect finding potential author matches in bioinformatics using fuzzy Multiple Criteria Decision Making (MCDM) methods such as Analytical Hierarchy Process (AHP), Fuzzy Delphi Method (FDM), and Triangular Fuzzy Numbers (TFN). To answer the research questions, a mix of documentary analysis and fuzzy methods is utilized. The documentary analysis stage involves collecting relevant documents and resources using the purposive sampling approach and ranking the effective criteria. The subsequent step involves experts determining the priorities of the effective criteria using pairwise comparisons and the Delphi questionnaire. The final weights are obtained based on the research purpose. The study shows that 79 criteria related to the research purpose can be grouped into three general categories: behavioral, topological, and content-based criteria. The most effective criteria in finding and recommending a potential author match are “journal titles”, “citations”, “paper titles”, “affiliations”, “keywords”, and “abstracts”. Among these criteria, citation and paper titles have a higher priority compared to others. The results indicate that content-based criteria have the most significant impact on finding potential author matches in static scholar networks and networks with text information. Furthermore, among the content-based criteria, the number of publications in common specialized journals and the number of common citations are the most sought-after criteria for finding a potential author match with the highest similarity."}]}]}]}}