{"pii": "S2352146517304337", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0001", "view": "all"}, "_": "The aim of this work is to present the initial exploration of a behavioural Dynamic Traffic Assignment model, particularly suitable to be used and implemented in agent-based micro-simulations. The proposal relies on the assumption that travellers take routing policies rather than paths, leading us to introduce the possibility for each simulated agent to apply, in real time, a strategy allowing him to possibly re-route his path depending on the perceived local traffic conditions, jam and/or time spent."}, {"#name": "simple-para", "$": {"id": "spara0002", "view": "all"}, "_": "The re-routing process allows the agents to directly react to any change in the road network. For the sake of simplicity, the agents’ strategy is modelled with a simple neural network whose parameters are determined during a preliminary training stage. The inputs of such neural network read the local information about the route network and the output gives the action to undertake: stay on the same path or modify it. As the agents use only local information, the overall network topology does not really matter, thus the strategy is able to cope with large networks."}, {"#name": "simple-para", "$": {"id": "spara0003", "view": "all"}, "_": "Numerical experiments are performed on various scenarios containing different proportions of trained strategic agents, agents with random strategies and non-strategic agents, to test the robustness and adaptability to new environments and varying network conditions. The methodology is also compared against MATSim and real world data. The outcome of the experiments suggest that this work-in-progress already produces encouraging results."}]}]}]}}