{"pii": "S2352484723009678", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e710"}, "$$": [{"#name": "section-title", "$": {"id": "d1e711"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e713"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e714"}, "_": "The electric utility industry is moving towards a deregulated and competitive market to meet customer expectations. So, system performance and reliability assessments are getting targeted more than before. Several performance measures of reliability are developed in the literature. In this research, the NEPLAN Simulator reliability analysis module is used to determine all the reliability indices in different cases of study considering the effect of the Advanced Distributed Automation System (ADAS). The analysis also benefits from the presence of Penetration of Distributed Generation (DG) units and Soft Open Points (SOP) to enhance system reliability alongside power quality. Therefore, this paper provides a methodology based on a cost/benefit study for distribution networks to define the best location of DG units and SOP devices that leads to better reliability indices. The objectives of the study are demonstrated and investigated through Bus 4 of the standard reliability Roy Bollington Test System (RBTS). NEPLAN uses a tool to apply the Reliability Centered Maintenance (RCM) strategy, which leads to a substantial reduction of maintenance expenses. Simulation results indicate a significant reduction in system reliability cost by 65.8% with significant enhancement in the average of all reliability indices and at each load point too such as Customer Average Interruption Duration Index (CAIDI) which is improved from 40.899 to 29.883, Energy not supplied also is declined by 52.34%. It is also worth saying that, even using DG units or SOP devices separately leads to positive results but the best outcomes are obtained with an appropriate combination of both."}]}]}]}}