{"pii": "S2352710224015055", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e783", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e784"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e786", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e787", "view": "all"}, "$$": [{"#name": "__text__", "_": "Mapping and investigating the technical, energy, and safety properties of buildings can be effectively accomplished using Building Information Modelling (BIM) tools. However, detailed geometric and structural information, material properties, and complete BIM models are often unavailable for existing buildings. Renovations, conversions, and aging phenomena further complicate the assessment of a building’s condition over its lifetime, necessitating (re)surveying efforts. In a collaborative project focused on studying smoke and gas dispersion pathways in buildings, a multidisciplinary team at the German Aerospace Center (DLR) explored the application of innovative mobile and non-invasive measurement methods to characterize existing buildings, surpassing the capabilities of state-of-the-art techniques. This research entailed the development and testing of enhanced acoustic measurements and H"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": " tracer gas techniques for leakage detection. Furthermore, a novel radar system was designed to analyse walls for concealed interconnecting structures. All measurement systems and approaches were collectively demonstrated on an existing office building, with the integration and localization of measurement data achieved through an automated process into a unified 3D database. The information obtained from these comprehensive measurements was visualized within a single-building model. By employing these advanced measurement techniques, a more thorough understanding of existing building conditions was achieved, surpassing the limitations of conventional methods. The successful integration and visualization of the acquired information within a unified model provide valuable insights for future renovations, conversions, and safety analyses. This research contributes to bridging the gap between traditional surveying practices and modern, data-driven approaches, enabling more efficient and accurate assessments of existing buildings."}]}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e792", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e793"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e795", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e796", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e798"}, "$$": [{"#name": "list-item", "$": {"id": "d1e799"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e802", "view": "all"}, "_": "Demonstration of novel approaches to measuring building airtightness"}]}, {"#name": "list-item", "$": {"id": "d1e804"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e807", "view": "all"}, "_": "Demonstration of tracergas measurement method using hydrogen"}]}, {"#name": "list-item", "$": {"id": "d1e809"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e812", "view": "all"}, "_": "Application of acoustic measurements for airtightness in a realistic environment"}]}, {"#name": "list-item", "$": {"id": "d1e814"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e817", "view": "all"}, "_": "First demonstration of lock-in thermographiy for assessing building airtightness"}]}, {"#name": "list-item", "$": {"id": "d1e819"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e822", "view": "all"}, "_": "Demonstration of a novel portable radar system capable of detecting hidden wall structures"}]}, {"#name": "list-item", "$": {"id": "d1e824"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e827", "view": "all"}, "_": "Elaboration of methods coupling evaluated results to measured building geometry"}]}, {"#name": "list-item", "$": {"id": "d1e829"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e832", "view": "all"}, "_": "Integration results of above building analysis methods into a single 3D data base"}]}]}]}]}]}]}}