{"pii": "S235291482300271X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Multilayer Network (MN) is a complex network comprising a set of graphs (also referred to as layers) interconnected by edges or interlayer edges (or "}, {"#name": "italic", "_": "inter"}, {"#name": "__text__", "_": "-edges) linking the nodes of different layers. In biology, a MN may model interactions among diseases, genes, and drugs, only using its structure. Recently, there has been a growing interest in comparing two MNs by revealing local regions of similarity as a counterpart of Network Alignment algorithms (NA) for simple networks. However, classical algorithms for NA such as Local NA (LNA) cannot be applied on multilayer networks, since they are not able to deal with interlayer edges. Therefore, there is a need for the introduction of novel algorithms. In this paper, we present "}, {"#name": "italic", "_": "MuLan"}, {"#name": "__text__", "_": ", an algorithm for the local alignment of multilayer networks. MuLan is based on the building of a multilayer alignment graph starting from a set of seed nodes. Then it analyses such a graph by revealing conserved regions. We first show as proof of concept the performances of "}, {"#name": "italic", "_": "MuLaN"}, {"#name": "__text__", "_": " on a set of synthetic multilayer networks. Then, we used as a case study a real multilayer network in the biomedical domain. Our results show that "}, {"#name": "italic", "_": "MuLaN"}, {"#name": "__text__", "_": " can build high-quality alignments and can extract knowledge about the aligned multilayer networks. "}, {"#name": "italic", "_": "MuLaN"}, {"#name": "__text__", "_": " is available at "}, {"#name": "inter-ref", "$": {"xmlns:xlink": true, "href": "https://github.com/pietrocinaglia/mulan", "id": "intref0010", "type": "simple"}, "_": "https://github.com/pietrocinaglia/mulan"}, {"#name": "__text__", "_": "."}]}]}]}]}}