{"pii": "S2352340923009125", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara016", "view": "all"}, "_": "In this paper, three datasets are described. The first dataset is a complete set of GNSS-R (GNSS-R: Global Navigation Satellite System – Reflectometry) airborne data. This dataset has been generated with the data acquired with the GLObal Navigation Satellite System Reflectometry Instrument (GLORI) developed at Centre d'Etudes Spatiales de la Biosphère (CESBIO), during the Land surface Interactions with the Atmosphere over the Iberian Semi-arid Environment (LIAISE) campaign in north-eastern Spain during the summer of 2021. It is the first time to our knowledge that a complete dataset of GNSS-R observables (reflectivity, incoherent component relative to the total scattering signal to noise ratio (SNR) for copolarized (right-right) and cross-polarized (right-left) measurements has been made available."}, {"#name": "simple-para", "$": {"id": "spara017", "view": "all"}, "_": "The two other datasets are ground truth sets of measurements which have been acquired simultaneously with the flights. The in-situ measurements dataset consists in soil measurements (surface soil moisture, surface roughness, Leaf Area Index (LAI)) over 24 reference fields). The land use dataset provides a land use map (along with 385 ground truth plots) over the studied site for GLORI data evaluation."}, {"#name": "simple-para", "$": {"id": "spara018", "view": "all"}, "_": "The combined datasets are particularly relevant for soil moisture and vegetation retrievals from GNSS-R observables, as well as studies for calibration and validation of bistatic empirical or physical models simulating coherent or incoherent components on agriculture sites, in the context of the preparation of future GNSS-R space missions, such as HydroGNSS, a European Space Agency mission, launch foreseen in 2024."}, {"#name": "simple-para", "$": {"id": "spara019", "view": "all"}, "_": "The entire database is archived in the AERIS LIAISE database. One DOI is available for each of the 3 datasets (airborne GLORI dataset, in situ measurements dataset and land use dataset)."}]}]}]}}