{"pii": "S2352484724002981", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0100", "view": "all"}, "_": "Electricity consumption is increasing rapidly, and the limited availability of natural resources necessitates efficient energy usage. Predicting and managing electricity costs is challenging, leading to delays in pricing. Smart appliances and Internet of Things (IoT) networks offer a solution by enabling monitoring and control from the broadcaster side. Green IoT, also known as the Green Internet of Things, emerges as a sustainable approach for efficient communication, data management, and device utilization. It leverages technologies such as Wireless Sensor Networks (WSN), Cloud Computing (CC), Machine-to-Machine (M2M) Communication, Data Centres (DC), and advanced metering infrastructure to reduce energy consumption and promote environmentally friendly practices in design, manufacturing, and usage. Green IoT optimizes data processing through enhanced signal bandwidth, enabling faster and more efficient communication. This comprehensive review explores advancements in Green IoT for smart grids, paving the path to sustainability. It covers energy-efficient communication protocols, intelligent energy management, renewable energy integration, demand response, predictive analytics, and real-time monitoring. The importance of edge computing and fog computing in allowing distributed intelligence is emphasized. The review addresses challenges, and opportunities and presents successful case studies. Finally, the review concludes by outlining future research avenues and providing policy recommendations to foster the advancement of Green IoT."}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0105", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0445"}, "$$": [{"#name": "list-item", "$": {"id": "u1270"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p1270", "view": "all"}, "_": "Investigating green IoT in smart grid adoption and implementation."}]}, {"#name": "list-item", "$": {"id": "u1275"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p1275", "view": "all"}, "_": "Exploring technological and behavioral solutions for cognitive smart grids."}]}, {"#name": "list-item", "$": {"id": "u1280"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p1280", "view": "all"}, "_": "Examining the need for a unified green IoT framework for future smart grids."}]}, {"#name": "list-item", "$": {"id": "u1285"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p1285", "view": "all"}, "_": "Analyzing trends, challenges, and research for effective green IoT implementation."}]}]}]}]}]}]}}