{"pii": "S2352146518300188", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0012", "view": "all"}, "_": "Recently, a multi-objective evolutionary algorithm based on decomposition (MOEA/D) has emerged as a potential method for solving multi-objective optimization problems (MOPs) and attracted much attention from researchers. In MOEA/D, the MOPs are decomposed into a number of scalar optimization sub-problems, and these sub-problems are optimized concurrently by only utilizing the information from their neighboring sub-problems. Thanks to these advantages, MOEA/D has demonstrated to be more efficient than the non-dominated sorting genetic algorithm II (NSGA-II) and other methods. However, its applications to practical problems are still limited, especially in the domain of aerospace engineering. Therefore, this paper aims to present a new application of MOEA/D for the optimal design of noise abatement aircraft terminal routes. First, in order to optimize aircraft noise for aircraft terminal routes while taking into account the interests of various stakeholders, bi-objective optimization problems including noise and fuel consumption are formulated, in which both the ground track and vertical profile of a terminal route are optimized simultaneously. Then, MOEA/D is applied to solve these problems. Furthermore, to ensure the design space of vertical profiles is always feasible during the optimization process, a trajectory parameterization technique recently proposed is also used. This technique aims at reducing the number of model evaluations of MOEA/D and hence the computational cost will decrease significantly. The efficiency and reliability of the developed method are evaluated through case studies for departure and arrival routes at Rotterdam The Hague Airport in the Netherlands."}]}]}]}}