{"pii": "S2352484721008544", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e273"}, "$$": [{"#name": "section-title", "$": {"id": "d1e274"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e276"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e277"}, "_": "Heat maps provide static information about spatial distribution of heat and cooling demands and they specify heat load and peak power densities in urban areas as well. But the maps may also include data about temperatures requested by the building heating systems (probably dependent on the building efficiency classes and the type of domestic hot water generation system) or any time series of either heat load or supply and return temperatures, respectively. Based on those data (steady or transient) cellular structures will be identified to be used for a more flexible operation of DH (district heating) networks or for re-designing new network topologies. The aim of these cells is the transition to locally flexible supply temperatures in the DH network: Each cell will be provided with an “individual“ supply temperature meeting its needs. This may open new perspectives to reduce heat losses and to integrate low emission heat sources."}, {"#name": "simple-para", "$": {"view": "all", "id": "d1e279"}, "_": "Groups of heat consumers having both relatively closed-by positions in the urban heating system and similar supply temperature set points will be merged into a single DH cell. Different clustering methods have been analyzed to identify those DH cells: Single-Linkage, DBSCAN and OPTICS, Affinity Propagation and spectral clustering. The splitting of a DH system into a plenty of cells is demonstrated by means of an urban, unmeshed example network thus evaluating the suitability of the entire process. The programming language Python is used."}, {"#name": "simple-para", "$": {"view": "all", "id": "d1e281"}, "$$": [{"#name": "__text__", "_": "To create the input data for the algorithms, two approaches have been applied (depending on the type of algorithm): (1) A distance matrix is created by reducing a graph model of the overall network so that only the distance between consumer substations (similar to length of pipeline) remains. Besides this information, the matrix does "}, {"#name": "italic", "_": "not"}, {"#name": "__text__", "_": " contain information about the network topology (“reduced model”). (2) Some algorithms accept graph models as input, so that the model of the overall network can act as input variable. The model does not need to be "}, {"#name": "italic", "_": "reduced"}, {"#name": "__text__", "_": " and thus contains more information about the network topology."}]}, {"#name": "simple-para", "$": {"view": "all", "id": "d1e289"}, "$$": [{"#name": "__text__", "_": "A lesson learned is that the utilization of affinity propagation – an algorithm using the "}, {"#name": "italic", "_": "reduced model"}, {"#name": "__text__", "_": " – can lead to implausible cells regarding network operation due to the missing information about the network topology. However, the Single-Linkage algorithm accepts a graph model of the overall network as input as a so called “connectivity constraint”. It leads to a highly reliable DH cell structure at least for unmeshed DH networks. Beside net topology it may be helpful to characterize DH cells not only by fixed supply temperature but also by supply temperature profiles. With respect to practical testing and realization of flexibility measures also the results of an ongoing clustering of a DH network at different points in time should be evaluated."}]}]}]}]}}