{"pii": "S2352152X23015207", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0075", "view": "all"}, "_": "The investigation of high-performance materials represents an essential step in the battery industry to develop innovative technologies. While patent analysis could help promote research and development (R&D) by providing insights into innovative activities, the significance of material information contained in patent documents for the advancement of battery technologies has not yet been investigated. This study explored the potential of material information derived from patent data for analyzing the patent landscape by introducing a novel analysis framework. It uses patent claims collected between 2010 and 2021 from the domain of solid-state battery technology to extract and transform material information. This study relies on 1-mode network analysis to construct a material network and a 2-mode network analysis is applied to quantify the extent of the chemical portfolios of assignees. The results indicate that the polymer-based electrolytes are highlighted as the dominant type in the solid-state batteries. A glance at the chemical portfolios of assignees reveals a heterogeneous technology profile, pointing to a highly diversified material knowledge across several industries. The proposed analysis framework is expected to offer a new empirical perspective on the patent landscape in the battery sector by exploiting material information. Broadening the view of material research within the battery sector can support R&D managers and research scientists in the design of improved material search strategies and the selection of appropriate collaborations partners for the respective process."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0080", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Introducing a new patent analysis framework for material analysis."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Application of 2-mode network analysis in the domain of patent mining."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Polymer materials are revealed to be the most prominent materials."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Solid-state battery landscape is characterized by a heterogenous assignee profile."}]}, {"#name": "list-item", "$": {"id": "li0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Proposing an alternative view to conventional count-based patent metrics."}]}]}]}]}]}]}}