{"pii": "S2352914824000340", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1239", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1240"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1242", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1243", "view": "all"}, "_": "The emergence of pandemics poses a persistent threat to both global health and economic stability. While zoonotic spillovers and local outbreaks may not be fully preventable, early detection of infections in individuals before they spread to communities can make a major difference in containing an infectious disease and stopping it from becoming an epidemic and then a pandemic."}, {"#name": "simple-para", "$": {"id": "d1e1245", "view": "all"}, "$$": [{"#name": "__text__", "_": "In this paper, we propose a novel Art"}, {"#name": "underline", "_": "i"}, {"#name": "__text__", "_": "ficial Intelligence (AI)-based "}, {"#name": "underline", "_": "p"}, {"#name": "__text__", "_": "andemic p"}, {"#name": "underline", "_": "redict"}, {"#name": "__text__", "_": "ion framework called iPREDICT—a concept framework designed to leverage the power of AI and crowd-sensed data for accurate and timely pandemic prediction. The core idea of iPREDICT is to leverage the deluge of data that can be harnessed from connected and wearable biosensing devices. iPREDICT system then works by monitoring anomalies in the biomarkers at the individual level and correlating them with similar anomalies observed in other members of the community. Using AI-based anomaly detection in conjunction with analysis of the spatiotemporal growth of the correlated anomalies, iPREDICT thus can potentially detect and monitor the emergence of a local outbreak in near real-time to predict a potential pandemic."}]}, {"#name": "simple-para", "$": {"id": "d1e1256", "view": "all"}, "_": "However, not every outbreak has the potential to become a pandemic. We illustrate how tools like graph neural networks can be leveraged to determine optimal thresholds as a function of a large number of demographical, social, and geographical factors that determine the spatiotemporal spread of an outbreak, thus quantifying the risk of it becoming an epidemic or pandemic."}, {"#name": "simple-para", "$": {"id": "d1e1258", "view": "all"}, "_": "We also identify essential technological and social challenges that require attention to transform iPREDICT from an idea into a globally deployable solution for future pandemic prediction and management. To provide deeper insights into iPREDICT design challenges and trigger research towards possible solutions we present a COVID-19 based case study. The results signify the impact of variation in biosensing hardware, data sampling rate, and compression rate on the performance of AI models that underpin various components of the iPREDICT system."}]}]}]}}