{"pii": "S2352710224000895", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "This paper summarizes the findings obtained during the development of information pipelines between a construction site and its corresponding digital twin. The case study is the construction of an office building in which independent information pipelines can track different aspects of the construction process and the aggregate result can assist managers in decision making in the form of a vaster entity: its digital twin. The digital twin prototype is designed as a recipient of information that mirror its physical building and its systems. The paper contributes with a real case in which these pipelines enable continuous monitoring and analysis of various basic parameters during construction. With a varied array of sensors installed, data was collected, organized and transmitted through a knowledge graph-based system to the digital twin dashboard. A dashboard is able to allocate many sources of data (from sensors, images or point clouds) but also, it helps visualizing data analysis that could help making informed decisions about the building during construction. The paper emphasizes the varied nature of data in construction sites as well as the importance of proper data channeling to enable multi-purpose, effective decision-making using the digital twin. Overall, the paper provides a real life insight that challenges massive implementation of digital twins within the existing construction sites for an office building. It also highlights its potential to improve productivity, resource efficiency, health and safety in construction environments. For this purpose, faced bottlenecks and challenges require refinements, more development and further research."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "The paper presents a case study on digital twinning of a construction process."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Different information pipelines from the site to decision making are presented."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The case study refers particular to the construction of a RC framed structure."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "A framework including a dashboard and an expandable toolkit is presented."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "Threads and methodologies are pulled from the case study for further research."}]}]}]}]}]}]}}