{"pii": "S2352864823000883", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0170", "view": "all"}, "_": "Nowadays, Multi Robotic System (MRS) consisting of different robot shapes, sizes and capabilities has received significant attention from researchers and are being deployed in a variety of real-world applications. From sensors and actuators improved by communication technologies to powerful computing systems utilizing advanced Artificial Intelligence (AI) algorithms have rapidly driven the development of MRS, so the Internet of Things (IoT) in MRS has become a new topic, namely the Internet of Robotic Things (IoRT). This paper summarizes a comprehensive survey of state-of-the-art technologies for mobile robots, including general architecture, benefits, challenges, practical applications, and future research directions. In addition, remarkable research of i) multi-robot navigation, ii) network architecture, routing protocols and communications, and iii) coordination among robots as well as data analysis via external computing (cloud, fog, edge, edge-cloud) are merged with the IoRT architecture according to their applicability. Moreover, security is a long-term challenge for IoRT because of various attack vectors, security flaws, and vulnerabilities. Security threats, attacks, and existing solutions based on IoRT architectures are also under scrutiny. Moreover, the identification of environmental situations that are crucial for all types of IoRT applications, such as the detection of objects, human, and obstacles, is also critically reviewed. Finally, future research directions are given by analyzing the challenges of IoRT in mobile robots."}]}]}]}}