{"pii": "S2352409X23001451", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "The community of Lusatian Urnfields participated in the extensive transport and trade in metal."}]}, {"#name": "list-item", "$": {"id": "o0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Metal from the nearest mines was used, as well as from deposits located far away."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "A large variety of sources of copper was used for the manufacture of artefacts in one hoard."}]}, {"#name": "list-item", "$": {"id": "o0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Tools of non-local type were produced in the territory of SW Poland."}]}, {"#name": "list-item", "$": {"id": "o0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Stylistic analogies for the artefacts from Paszowice hoard are found mainly in southern regions."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "lang": "en", "id": "ab010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "Metal artefacts from Bronze Age hoards have routinely been used to study interregional contacts. Their stylistic and typological features helped distinguish local products and imports by appearance. In the last 40 years, combined lead isotope and chemical analyses of metals have been widely applied to verify hypotheses based on style and typology. This paper is a comprehensive typological and analytical study of a metal item hoard discovered in Paszowice, SW Poland. In the Bronze Age, the area was inhabited by the Lusatian Urnfield culture (ca. 1350/1300–800/750 BC) communities. We expected that at least some of the artefacts would be local products fashioned according to foreign stylistic patterns. The research aimed to determine whether a ‘classical’ stylistic analysis combined with provenance studies of metals would allow more decisive conclusions. This combination of methods could also show how the metal reached the Lusatian Urnfield culture settlement zone. We conducted a detailed typological and chronological analysis to map the distribution of similar artefact types. It demonstrated that stylistic matches for the artefacts from Paszowice occur mainly in NE Hungary, S Czech Republic, Slovakia, and Romania. Selected metal artefacts (both tin bronze items and raw copper objects) from Paszowice were also analysed for their chemical (EPMA) and lead isotope (MC ICP MS) compositions. The study revealed many copper sources used for their production, ranging from the nearest copper mines in the Slovak Ore Mountains, through Eastern Alps and mines in Sardinia, to possibly the Iberian Peninsula. In this way, we identified the potential trade routes by which metal could get to SW Poland: the southwestern and southeastern routes and the Mediterranean-Danube route. The Iberian metal might have also reached the study area from the north – through its redistribution by Scandinavian traders. Our results show that metal from many sources circulated in central Europe during the Late Bronze Age. The Lusatian Urnfield communities were part of a pan-European exchange network and maintained extensive long-distance contacts, allowing metal acquisition from various sources."}]}]}]}}