{"pii": "S2352484722016511", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e470"}, "$$": [{"#name": "section-title", "$": {"id": "d1e471"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e473"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e474"}, "_": "The Stadium’s Electricity (SE) is cost-effective and critical to meeting the stadium’s size requirements. Because of their complex internal operations and extensive functionality. Stadium energy efficiency improvements are demanding and time-consuming due to the large and diverse electricity loads that can be managed. The stadium source of information is unloaded and turned off after sports. During sports, the system is ready to be deployed in case of an electricity outage. Several of these issues must be carefully evaluated, starting with accurate representations and human-structure interaction models, and determining acceptable facility vibration serviceability limitations of crowd activities. Due to various factors, stadiums like those used for athletic or entertainment events are distinct from other civil engineering constructions. Stadiums are susceptible to both the coordinated and random motion of huge crowds, which presents several issues. In computer science, Artificial Intelligence (AI) refers to the development of machines that can simulate human mental processes. AI can be used in various ways, from natural language processing to speech recognition to computer vision. This paper introduced a new method for (SE-AI) in addition to enhancing stadium control capabilities in various functional areas. The intelligent stadium development effectively enables it to handle construction equipment in an integrated manner. In the stadium’s electrical design, the smart sports model is structured. An investigation of the stadium’s electrical design system to provide helpful information for the stadium’s electrical design work based on engineering design principles. Advanced technology is mirrored in the stadium’s equipment, which is moving toward informationization and intelligence due to the advancement of science and technology, especially digitalization. If the research results can be a helpful guide for bettering the electrical planning of stadiums can be a more substantial impact on society. Stadiums are investing in Wi-Fi and distributed antenna systems to boost connection. This allows viewers to follow the game throughout the stadium and helps scattered personnel communicate."}]}]}]}}