{"pii": "S2351978920301359", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0448", "view": "all"}, "_": "Navigating through unstructured environments is a basic capability of intelligent creatures, and thus is of fundamental interest in this research. Navigation is a complex task that relies on developing an internal representation of space, grounded by recognizable landmarks and robust visual processing, that can simultaneously support continuous self-localization (“I am here”) and a representation of the goal (“I am going there”). Recent advancements in Artificial Intelligence (AI) and related technologies can make this achievable. The number of robots deployed in the manufacturing industry has increased rapidly and this trend is likely to continue in the future, as autonomous robots have the potential to automate a wide array of labor-intensive tasks in the factory environment and improve output. There are many technical challenges that need to be solved to realize an autonomous multifunctional robotic platform. In this research, we aim to address the primary problem of the autonomous navigation of robots in the factory environment. The robotic platform will be able to recognize the markers on the factory floor and navigate in the factory on the designated path by avoiding obstacles in its path from point A to point B autonomously. In this research, we use a minimal number of sensors to reduce the BOM cost of the robotic platform and maximize battery life. We intend to use cameras (RGB), motor encoders and a low-cost IMU to localize the robot, and an electric drive train to propel the platform. Also, we have used neural networks to recognize the markers and paths in the factory environment, Simultaneous Localization and Mapping (SLAM) to localize the robot and a navigation algorithm to guide the robotic platform to the destination."}]}]}]}}