{"pii": "S2352340923007618", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara013", "view": "all"}, "_": "The dataset provided in this paper refers to an experimental campaign conducted in Laboratory of Fluid Dynamics (LTDF) of the Free University of Bozen-Bolzano at NOI Techpark aiming to understand the movement of granular material in fluids of low viscosity and density exhibited in debris flows."}, {"#name": "simple-para", "$": {"id": "spara014", "view": "all"}, "$$": [{"#name": "__text__", "_": "One experimental test was performed consisting of 31 repetitions. In detail, a three-litre volume of granular material ("}, {"#name": "italic", "_": "d"}, {"#name": "__text__", "_": " = 1.8"}, {"#name": "italic", "_": "mm"}, {"#name": "__text__", "_": ") was suddenly released from an upstream reservoir in a 1.5 m long acrylic chute tilted at 19 degrees and stopped in the outlet area by a vertical barrier."}]}, {"#name": "simple-para", "$": {"id": "spara015", "view": "all"}, "$$": [{"#name": "__text__", "_": "This vertical barrier used is adjacent to the side wall of the chute, with two vertical gaps and a width equal to twice the size of the particles used ("}, {"#name": "italic", "_": "s"}, {"#name": "__text__", "_": " = 2"}, {"#name": "italic", "_": "d"}, {"#name": "__text__", "_": ")."}]}, {"#name": "simple-para", "$": {"id": "spara016", "view": "all"}, "_": "The instrumentation included two high-speed cameras (300fps) and one spotlight. Camera 1 (C1) was located upstream at the lock gate location and Camera 2 was placed at downstream part of the chute, focusing on the vertical barrier site. A Particle Tracking Velocimetry (PTV) was applied to the set of images captured by the camera placed in the downstream area of the chute in a region of interest (ROI) of 4000 pixel width and 300 pixel height."}, {"#name": "simple-para", "$": {"id": "spara017", "view": "all"}, "$$": [{"#name": "__text__", "_": "Firstly, the raw data concerns to the particles coordinates ("}, {"#name": "italic", "_": "x,z"}, {"#name": "__text__", "_": "), their along-chute and wall-normal trajectories and particle tag, detected with the PTV algorithm for the 31 repetitions held."}]}, {"#name": "simple-para", "$": {"id": "spara018", "view": "all"}, "_": "The previous data was submitted to filtering processes where we converted particle trajectories into maps of these mean quantities by binning and constructing a data ensemble. To remove some detected outliers, a refinement of ensemble data was subsequently applied [1]."}, {"#name": "simple-para", "$": {"id": "spara019", "view": "all"}, "_": "All of the solutions computed to build the pointed dataset were performed by means of Matlab algorithms."}, {"#name": "simple-para", "$": {"id": "spara020", "view": "all"}, "_": "This dataset allows researchers to characterize the behaviour of granular processes that may occur in inclined channels partially or fully obstructed."}]}]}]}}