{"pii": "S2352484724003184", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0150", "view": "all"}, "_": "Advanced control strategies for heating, ventilation, and air-conditioning (HVAC) systems aim to enhance both buildings' energy efficiency and occupant thermal comfort. Despite their potential, real-world demonstration studies on such advanced technologies are still lacking. This study presents a field demonstration of a real-time predicted mean vote (PMV)-based HVAC control strategy in a typical residential building under hot and dry climate conditions. This study introduces an advanced thermal comfort-based controller (TCC) for the PMV-based HVAC control. TCC continually assesses indoor and outdoor thermal conditions and adjusts the HVAC setpoint temperature to optimize real-time energy use while ensuring satisfactory indoor thermal comfort. Machine learning models for the PMV-based HVAC control system are employed to estimate a mean radiant temperature (MRT) point, which is one of the variables used to calculate real-time PMV values. Three machine learning models (i.e., linear regression, regression trees, and artificial neural network) are adopted in this study with non-stationary real-time input values, including times, pre-determined setpoints, and indoor and outdoor temperatures. The developed TCC is installed in a full-scale experimental house in Kuwait, which is under hot and dry climate conditions, to assess the house's indoor thermal comfort and AC energy efficiency performance. Results indicate that the TCC provides better thermal comfort performance compared to the non-TCC case, including up to a 60% improvement in PMV. The proposed TCC controlled by the machine learning methods demonstrates HVAC energy savings potential of over 20% while meeting the desired thermal comfort levels in the experimental building. These findings are expected to be valuable, as they can contribute to reducing cooling energy in residential buildings in hot and dry climate conditions."}]}]}, {"#name": "abstract", "$": {"id": "ab0015", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abs0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0155", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "li0005"}, "$$": [{"#name": "list-item", "$": {"id": "u0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "A real-time predicted mean vote-based air-conditioning control method is proposed."}]}, {"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "This study utilizes various data-driven models for extimating mean radiant temperature."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The effectiveness of thermal comfort-integrated air-conditioning control is demonstrated through a case study in Kuwait."}]}]}]}]}]}]}}