{"pii": "S2352938522001070", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "We estimate the green vegetation fraction (GVF) at high spatial resolution (10 m) by applying a new method based on image histogram equalization and utilizing images with multiple spectral bands from Sentinel-2 satellite observations. True color and multi-spectral images at 10 m resolution are used over 50 × 50 km"}, {"#name": "sup", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": " domain centered on the US Department of Energy (DOE) Atmospheric Radiation Measurement (ARM) site over the Southern Great Plains to recognize green pixels and estimate the vegetation fraction. The GVF retrieved from several spectral bands is compared with Sentinel-2 true color images, Sentinel-3, MODIS vegetation products, and observations from the US DOE research aircraft on selected days from the Holistic Interactions of Shallow Clouds, Aerosols, and Land-Ecosystems (HI-SCALE) campaign. Unlike MODIS or Sentinel-3, our approach to retrieve the GVF is independent of absolute reflectance or photosynthetic response. Spatial patterns in vegetation distribution are similar in all three satellite approaches, however MODIS underestimates the vegetation cover by about 10% compared to the Sentinel-2, -3 retrievals over the study domain. The largest contrast in MODIS and Sentinel-2, -3 is found when the GVF is less than 0.2 or greater than 0.9, likely as a result of different retrieval approaches and spectral bands used to estimate the vegetation products. The NDVI retrieved from MODIS is also underestimated compared to the aircraft observations suggesting that MODIS underestimates both NDVI and GVF. In the past, various satellite observations have been used to retrieve the vegetation fraction at medium (0.25–0.50 km) and coarser resolutions (15 km) but our approach is extended to a much higher (10 m) resolution. Our analysis from Sentinel-2 shows large spatial variability in GVF and a clear disparity with estimates from MODIS and Sentinel-3 satellites. The new approach to estimate GVF has the potential to increase spatial accuracy and precision of surface properties relevant for crop and forest management, surface and energy balance processes, and land surface parameterizations in atmospheric models."}]}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Key Points"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Satellite retrieved green vegetation fraction (GVF) from fine (10 m) resolution."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Compared the retrieved GVF with medium resolution vegetation products."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Data from multiple platforms are used to understand the differences in GVF."}]}]}]}]}]}]}}