{"pii": "S2352864824000737", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0240", "view": "all"}, "_": "Demand Side Management (DSM) is a vital issue in smart grids, given the time-varying user demand for electricity and power generation cost over a day. On the other hand, wireless communications with ubiquitous connectivity and low latency have emerged as a suitable option for smart grid. The design of any DSM system using a wireless network must consider the wireless link impairments, which is missing in existing literature. In this paper, we propose a DSM system using a Real-Time Pricing (RTP) mechanism and a wireless Neighborhood Area Network (NAN) with data transfer uncertainty. A Zigbee-based Internet of Things (IoT) model is considered for the communication infrastructure of the NAN. A sample NAN employing XBee and Raspberry Pi modules is also implemented in real-world settings to evaluate its reliability in transferring smart grid data over a wireless link. The proposed DSM system determines the optimal price corresponding to the optimum system welfare based on the two-way wireless communications among users, decision-makers, and energy providers. A novel cost function is adopted to reduce the impact of changes in user numbers on electricity prices. Simulation results indicate that the proposed system benefits users and energy providers. Furthermore, experimental results demonstrate that the success rate of data transfer significantly varies over the implemented wireless NAN, which can substantially impact the performance of the proposed DSM system. Further simulations are then carried out to quantify and analyze the impact of wireless communications on the electricity price, user welfare, and provider welfare."}]}]}]}}