{"pii": "S235234092300985X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara007", "view": "all"}, "_": "The wireless backhaul has emerged as an attractive alternative to traditional fiber backhaul for 5G technology, offering greater flexibility and cost-effectiveness thanks to the availability of high bandwidths capable of achieving fiber-like data rates. However, the millimeter-wave-based (mmWave) protocols, namely IEEE 802.11ad and later IEEE 802.11ay, suffer from a high susceptibility to obstruction, which only allows correct operation under Line-of-Sight conditions (LOS). Any sudden obstructions can significantly reduce the maximum achievable throughput, leading to delays exceeding acceptable limits for critical applications, and may even culminate in link failure in certain circumstances. Therefore, it is essential to assess how different types and durations of obstructions impact different network OSI layers to determine the feasibility of mmWave. WiGig-based technologies for wireless backhaul scenarios. This article describes a dataset collected from an experimental IEEE 802.11ad backhaul network, mmWave-based mesh network at 60 GHz, deployed in an outdoor environment. The data contains multi-layer information, including MAC, PHY, and network data, which provides valuable insights into the WiGig network behavior under three distinct scenarios. These scenarios include normal operation, long-term blocked scenario, and short-term blocked scenario, based on the type and duration of the blockage event crossing the LOS path. The dataset presents an extensive PHY, MAC and transport layer measurement campaign for an outdoor WiGig network, and thus it is a valuable resource for researchers and professionals interested in understanding the behavior and performance of real-life mmWave-based WiGig networks aimed for 5G backhauling."}]}]}]}}