{"pii": "S2352484722009702", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e106"}, "$$": [{"#name": "section-title", "$": {"id": "d1e107"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"role": "background", "view": "all", "id": "d1e110"}, "$$": [{"#name": "section-title", "$": {"id": "d1e111"}, "_": "Background:"}, {"#name": "simple-para", "$": {"view": "all", "id": "d1e113"}, "_": "The energy industry is the leader of the third industrial revolution, and the field of big data is the concrete embodiment of the Internet. With the advent of the era of big data, data is growing at a very fast speed, forming a large number of digital resources including text data, pictures, audio, video and other multimedia data. The application of big data will bring changes in technology application, service mode and development ideas to the power grid."}]}, {"#name": "abstract-sec", "$": {"role": "introduction", "view": "all", "id": "d1e115"}, "$$": [{"#name": "section-title", "$": {"id": "d1e116"}, "_": "Objective:"}, {"#name": "simple-para", "$": {"view": "all", "id": "d1e118"}, "_": "The purpose of this paper is to improve the data analysis and data mining ability in the related fields of power energy enterprise management, and improve the service ability and service quality of power marketing business through the informatization construction of power energy enterprises."}]}, {"#name": "abstract-sec", "$": {"role": "materials-methods", "view": "all", "id": "d1e120"}, "$$": [{"#name": "section-title", "$": {"id": "d1e121"}, "_": "Methods:"}, {"#name": "simple-para", "$": {"view": "all", "id": "d1e123"}, "_": "According to the increasingly urgent scientific decision-making needs of large-scale energy enterprises, the paper combines big data technology with cloud computing technology to construct the management information system of electric power and energy enterprises."}]}, {"#name": "abstract-sec", "$": {"role": "conclusion", "view": "all", "id": "d1e125"}, "$$": [{"#name": "section-title", "$": {"id": "d1e126"}, "_": "Conclusion:"}, {"#name": "simple-para", "$": {"view": "all", "id": "d1e128"}, "_": "The electricity consumption information collection system adopts distributed architecture to collect electricity consumption data, establishes a big data cloud platform, and presents the operation and maintenance information to managers with vivid and intuitive three-dimensional graphics, which facilitates the integration of data resources of multiple heterogeneous operation and maintenance systems, and improves the intuitive perception and judgment ability of operation and maintenance managers on the operation state of data centers to a certain extent."}]}]}]}}