{"pii": "S2351989423003505", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0030", "view": "all"}, "_": "Informed population monitoring efforts are essential for sound management of harvested species, and adaptive strategies that provide detailed information to monitoring efforts often require data inputs from complimentary sources. Movement ecology information is seldom directly incorporated into population monitoring or adaptive harvest management strategies, yet can provide valuable information on species distributions, emigration and immigration rates, and aid in determining optimal population monitoring timing. The Rocky Mountain Population (RMP) of Sandhill Cranes is a harvested population subject to a stringent adaptive harvest management framework and an annual aerial survey to estimate population abundance, but movements of Sandhill Cranes during survey windows, and subsequent changes to harvest quotas based on their movement and distribution have not been investigated. We used seven years of GPS tracking data to estimate state-specific emigration and immigration rates, using a Bayesian multi-state capture-recapture model, among states within the RMP distribution to understand how seasonal crane movements may influence optimal aerial survey timing. We then leveraged these transition probabilities in conjunction with aerial survey count data to model how changes in aerial survey timing and movement-informed crane distribution would influence the current RMP Sandhill Crane adaptive harvest management model resulting in estimated changes to harvest allocation among states based on Sandhill Crane movement. We found that Sandhill Crane emigration from northern states began to increase the week of the aerial survey in late September, and continued to increase as autumn migration progressed into October. As expected, immigration to southern states began as emigration from northern states increased. Importantly, little movement among states occurred prior to the current aerial survey design timing. Overall, we found that current survey timing and shortly thereafter (∼1 week) did not greatly influence estimates of Sandhill Crane distribution, and did not greatly influence the harvest reallocation to each state until mid to late October (range of −42–+52 tag allocation change), much later than the current survey design would allow. Using GPS locations, we found that optimal population monitoring efforts could be improved to account for both detection and seasonal movements, while minimally influencing current adaptive harvest management strategies to stakeholders. Linking movement ecology with population monitoring efforts and subsequently adaptive harvest management strategies yields insightful information that can be beneficial for conservation planning, decision-making, and optimal species management of a migratory bird."}]}]}]}}