{"pii": "S2352484721008404", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e319"}, "$$": [{"#name": "section-title", "$": {"id": "d1e320"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e322"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e323"}, "_": "Due to the relatively high investment costs of district heating networks, their optimal design is crucial for a high ROI. A software tool supporting decision makers and network planners to find the cost optimal network topology is introduced. Beside topology the tool also estimates diameters of the district heating pipes. The optimization is based on user defined cost data, geo-referenced input of supply and consumer nodes, all possible laying routes for the pipes and technical boundary conditions. Further constraints can be considered, e.g., the usage of an already existing network or possible obstacles, e.g., costly crossings of rivers or railroad tracks. The optimization usually leads to an unmeshed network. Meshes which are needed to guarantee uninterrupted service can only be enforced by the manually definition of existing pipes. To ensure an easy-to-use interface for geo-referenced data the tool is provided as a plugin for the geographic information system QGIS."}, {"#name": "simple-para", "$": {"view": "all", "id": "d1e325"}, "_": "The optimization process consists of a combination of classical non-linear methods, minimal spanning tree calculations and evolutionary algorithms. It allows solution of the mentioned problem for one specific user defined design case. In addition to the geo-referenced topology of the network, the diameter of each pipe and the total investment costs, the result of the computation provides further technical specifications, e.g., mean flow velocities and pressure losses, in the considered case. So far, different scenarios can only be calculated separately."}, {"#name": "simple-para", "$": {"view": "all", "id": "d1e327"}, "_": "With a short training period the tool is largely intuitive to use. It is currently used in university courses in order to understand the challenges involved in the planning and design process of district heating networks. It is also used in research projects and is continuing to be developed."}]}]}]}}