{"pii": "S2351989424004943", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0055", "view": "all"}, "$$": [{"#name": "__text__", "_": "Stopover sites identification for migratory waterbirds is important in China’s coastal wetlands, which have experienced a massive loss of natural wetlands in recent decades. Taking the Pied Avocet ("}, {"#name": "italic", "_": "Recurvirostra avosetta"}, {"#name": "__text__", "_": "), a common waterbird in China’s coastal zone as an example, our research focused on their stopover habitat use based on satellite tracking and remote sensing technology. Along the coast, a total of 6 critical stopover sites, duration of stay more than 14 days, were recognized during their 2022–2023 autumn and spring migrations of the 4 tagged individuals. The results showed that Pied Avocets used habitats close to the coastline and water source, at low elevation, and with sparse vegetation. They also had a certain tolerance for human interference. From the perspective of the land use and land cover type, the proportion (33.01 %) of artificial wetlands including paddy, salt pan, and mariculture has exceeded that (27.97 %) of natural wetlands such as bottomland, tidal flat, estuarine waters, and shallow water in the home ranges of the 6 stopover areas. The study emphasized that the habitat function of artificial wetland should be paid enough attention to while maintaining the natural wetland without further loss. In addition, habitat-oriented management suggestions were put forward for artificial wetlands. This study can provide data and technical support for the conservation and management of waterbirds stopovers, also having reference value for other species."}]}]}]}]}}