{"pii": "S2351989424003871", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0055", "view": "all"}, "$$": [{"#name": "__text__", "_": "In Malaysia, escalating human-wildlife conflicts pose significant risks to both human populations and wildlife species, highlighting the need for advanced systems for effective conflict management. This study introduces the Geo Wild System (GWS), a novel Progressive Web Application (PWA) specifically tailored for Malaysian contexts. GWS integrates data from diverse sources, including citizen reports, park rangers, and licensed hunters, and employs Geographic Information System (GIS) tools to enhance data visualization and identify conflict hotspots. During the study period from January to June 2024, GWS recorded and facilitated the deployment of 117 traps across six districts: Shah Alam, Hulu Selangor, Sungai Besar, Hulu Langat, Georgetown, and Seberang Prai. These deployments, based on reported conflict data, resulted in the capture of 88 wildlife individuals, including 85 long-tailed macaques ("}, {"#name": "italic", "_": "Macaca fascicularis"}, {"#name": "__text__", "_": "), two wild boars ("}, {"#name": "italic", "_": "Sus scrofa"}, {"#name": "__text__", "_": "), and one Asian palm civets ("}, {"#name": "italic", "_": "Paradoxurus hermaphroditus"}, {"#name": "__text__", "_": "), demonstrating the system's operational effectiveness. GWS supports a comprehensive reporting, monitoring, and analysis system, utilizing GIS-based Kernel Density Estimation (KDE) to pinpoint critical conflict hotspots, particularly in rapidly urbanizing areas. User feedback was overwhelmingly positive, highlighting the system’s user-friendliness and robust data integration. Despite initial deployment challenges and geodetic constraints, GWS has proven to be a valuable tool for mitigating wildlife conflicts, enabling informed, timely management responses, and offering a promising approach to adaptive wildlife management in Malaysia."}]}]}]}]}}