{"pii": "S235286482200133X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Network virtualization can effectively establish dedicated virtual networks to implement various network functions. However, the existing research works have some shortcomings, for example, although computing resource properties of individual nodes are considered, node storage properties and the network topology properties are usually ignored in Virtual Network (VN) modelling, which leads to the inaccurate measurement of node availability and priority. In addition, most static virtual network mapping methods allocate fixed resources to users during the entire life cycle, and the users’ actual resource requirements vary with the workload, which results in resource allocation redundancy. Based on the above analysis, in this paper, we propose a dynamic resource sharing virtual network mapping algorithm named NMA-PRS-VNE, first, we construct a new, more realistic network framework in which the properties of nodes include computing resources, storage resources and topology properties. In the node mapping process, three properties of the node are used to measure its mapping ability. Second, we consider the resources of adjacent nodes and links instead of the traditional method of measuring the availability and priority of nodes by considering only the resource properties, so as to more accurately select the physical mapping nodes that meet the constraints and conditions and improve the success rate of subsequent link mapping. Finally, we divide the resource requirements of Virtual Network Requests (VNRs) into basic sub-requirements and variable sub-variable requirements to complete dynamic resource allocation. The former represents monopolizing resource requirements by the VNRs, while the latter represents shared resources by many VNRs with the probability of occupying resources, where we keep a balance between resource sharing and collision among users by calculating the collision probability. Simulation results show that the proposed NMA-PRS-VNE can increase the average acceptance rate and network revenue by 15% and 38%, and reduce the network cost and link pressure by 25% and 17%."}]}]}]}}