{"pii": "S2352340923004602", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0001", "view": "all"}, "_": "Wireless community networks, WCN, have proliferated around the world. Cheap off-the-shelf WiFi devices have enabled this new network paradigm where users build their own network infrastructure in a do-it-yourself alternative to traditional network operators. The fact that users are responsible for the administration of their own nodes makes the network very dynamic. There are frequent reboots of the networking devices, and users that join and leave the network. In addition, the unplanned deployment of the network makes it very heterogeneous, with both high and low capacity links. Therefore, anomaly detection in such dynamic scenario is challenging. In this paper we provide a dataset gathered from a production WCN. The data was obtained from a central server that collects data from the mesh nodes that build the network. In total, 63 different nodes were encountered during the data collection. The WCN is used daily to access the Internet from 17 subscribers of the local ISP available on the mesh. We have produced a dataset gathering a large set of features related not only to traffic, but other parameters such as CPU and memory. Furthermore, we provide the network topology of each sample in terms of the adjacency matrix, routing table and routing metrics. In the data we provide there is a known unprovoked gateway failure. Therefore, the dataset can be used to investigate the performance of unsupervised machine learning algorithms for fault detection in WCN. To our knowledge, this is the first dataset that allows fault detection to be investigated from a production WCN."}]}]}]}}