{"pii": "S2352340924004888", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara009", "view": "all"}, "$$": [{"#name": "__text__", "_": "Monitoring the herd during supplementation is essential to understanding animals' ingestive activities, making decisions when choosing the supplement parameters, and correctly managing the livestock and agriculture processes. Programmable Automatic Feeders (PAFs) are important tools that support stakeholders in the treatment process, decreasing the time and cost compared to traditional supplementation methods. This paper presents a dataset that consists of data acquired from a supplementation experiment using a PAF with a Nelore herd in a paddock of 16 ha with "}, {"#name": "italic", "_": "brachiaria"}, {"#name": "__text__", "_": " Decumbens forage. The experiment was performed in the Midwest region of Brazil (20°26′37.7″S 54°50′58.5″W) and according to the Köppen climate classification system, the region has a tropical wet and dry climate (Aw). This climate type is typically associated with high temperatures throughout the year. The herd had free access to water and the forage. The PAF supplemented the herd three times a day and collected data such as the frequency and time spent in the feeder of each animal. The experiment data started in December 2022 up to October 2023. The animals were weighed every 13–28 days, and the animals' Average Daily Gain (ADG) was registered. In addition, spectral and weather parameters were acquired via geoprocessing and meteorological (Application Programming Interfaces – APIs). This dataset can support stakeholders in understanding the bovines' collective behaviour at the supplementation process and designing and developing machine-learning models to estimate the quantity of supplementation ingested by the herd."}]}]}]}]}}