{"pii": "S2351989422003523", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0040", "view": "all"}, "$$": [{"#name": "__text__", "_": "Camera trapping is the most widely used data collection method for estimating snow leopard ("}, {"#name": "italic", "_": "Panthera uncia"}, {"#name": "__text__", "_": ") abundance; however, the accuracy of this method is limited by human observer errors from misclassifying individuals in camera trap images. We evaluated the extent Whiskerbook (www.whiskerbook.org), an artificial intelligence (AI) software, could reduce this error rate and enhance the accuracy of capture-recapture abundance estimates. Using 439 images of 34 captive snow leopard individuals, classification was performed by five observers with prior experience in individual snow leopard ID (\"experts\") and five observers with no such experience (\"novices\"). The \"expert\" observers classified 35 out of 34 snow leopard individuals, on average erroneously splitting one individual into two, thus resulting in a higher number than true individuals. The success rate of experts was 90 %, with less than a 3 % error in estimating the population size in capture-recapture modeling. However, the \"novice\" observers successfully matched 71 % of encounters, recognizing 25 out of 34 individuals, underestimating the population by 25 %. It was found that expert observers significantly outperformed novice observers, making statistically fewer errors (Mann Whitney U test P = 0.01) and finding the true number of individuals (P = 0.01). These differences were contrasted with a previous study by Johansson et al. 2020, using the same subset of 16 individuals from European zoos. With the help of AI and the Whiskerbook platform, \"experts\" were able to match 87 % of encounters and identify 15 out of 16 individuals, with modeled estimates of 16 ± 1 individuals. In contrast, \"novices\" were 63 % accurate in matching encounters and identified 12 out of 16 individuals, modeling 12 ± 1 individuals that underestimated the population size by 12 %. When comparing the performance of observers using AI and the Whiskerbook platform to observers performing the tasks manually, we found that observers using Whiskerbook made significantly fewer errors in splitting one individual into two (P = 0.04). However, there were also a significantly higher number of combination errors, where two individuals were combined into one (P = 0.01). Specifically, combination errors were found to be made by \"novices\" (P = 0.04). Although AI benefited both expert and novice observers, expert observers outperformed novices. Our results suggest that AI effectively reduced the misclassification of individual snow leopards in camera trap studies, improving abundance estimates. However, even with AI support, expert observers were needed to obtain the most accurate estimates."}]}]}]}]}}