{"pii": "S2352396421005946", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Summary"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "role": "background", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "spara012", "view": "all"}, "_": "Major challenges in large scale genetic association studies include not only the identification of causative single nucleotide polymorphisms (SNPs), but also accounting for SNP-SNP interactions. This study thus proposes a novel feature engineering approach integrating potentially functional coding haplotypes (pfcHap) with machine-learning (ML) feature selection to identify biologically meaningful, possibly causative genetic factors, that take into consideration potential SNP-SNP interactions within the pfcHap, to best predict for methotrexate (MTX) response in rheumatoid arthritis (RA) patients."}]}, {"#name": "abstract-sec", "$": {"id": "abss0002", "role": "materials-methods", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0003"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "spara013", "view": "all"}, "_": "Exome sequencing from 349 RA patients were analysed, of which they were split into training and unseen test set. Inferred pfcHaps were combined with 30 non-genetic features to undergo ML recursive feature elimination with cross-validation using the training set. Predictive capacity and robustness of the selected features were assessed using six popular machine learning models through a train set cross-validation and evaluated in an unseen test set."}]}, {"#name": "abstract-sec", "$": {"id": "abss0003", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0004"}, "_": "Findings"}, {"#name": "simple-para", "$": {"id": "spara014", "view": "all"}, "_": "Significantly, 100 features (95 pfcHaps, 5 non-genetic factors) were identified to have good predictive performance (AUC: 0.776-0.828; Sensitivity: 0.656-0.813; Specificity: 0.684-0.868) across all six ML models in an unseen test dataset for the prediction of MTX response in RA patients."}]}, {"#name": "abstract-sec", "$": {"id": "abss0004", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0005"}, "_": "Interpretation"}, {"#name": "simple-para", "$": {"id": "spara015", "view": "all"}, "_": "Majority of the predictive pfcHap SNPs were predicted to be potentially functional and some of the genes in which the pfcHap resides in were identified to be associated with previously reported MTX/RA pathways."}]}, {"#name": "abstract-sec", "$": {"id": "abss0005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0006"}, "_": "Funding"}, {"#name": "simple-para", "$": {"id": "spara016", "view": "all"}, "_": "Singapore Ministry of Health's National Medical Research Council (NMRC) [NMRC/CBRG/0095/2015; CG12Aug17; CGAug16M012; NMRC/CG/017/2013]; National Cancer Center Research Fund and block funding Duke-NUS Medical School.; Singapore Ministry of Education Academic Research Fund Tier 2 grant MOE2019-T2-1-138."}]}]}]}}