{"pii": "S2352484721007277", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e348"}, "$$": [{"#name": "section-title", "$": {"id": "d1e349"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e351"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e352"}, "_": "Smart power grid is a two-way interconnected network in which information plays a fundamental role in the process of energy transmission and distribution. The smart grid is based on combining ICT with the processing capabilities of computers and electrical systems to increase communication between users. However, smart grids are exposed to a variety of malicious cyber-attacks that can lead to the destruction of basic infrastructure and disrupt communication between the grid and users. Meanwhile, by authenticating the authenticated users, cyber-security can be created in the smart grid. One of the main components of a smart power grid is smart meters. However, to maintain security in a communication, smart meter authentication alone is not enough and it must be ensured that the electricity company’s server is not forgery. Therefore, there is a need for two-way authentication between the smart meter on the home side and the electricity company server. The present work provides a key management layout (based on the elliptic curve cryptography) with two-way authentication for communication outside the home area network The proposed solution is two-way authentication among the smart meter and the security associate in the power company. In other words, the proposed methodology creates a solution to establish a connection between valid users and the smart grid. The proposed protocol evaluates the behavior of cyber-attacks on the smart grid. Attacks such as man-in the middle attacks and retransmission attacks are considered. It was found that, the proposed methodology improves the reliance between smart grid and authenticated users with the increase of secure communications. Moreover, the proposed protocol can prevent an extensive experiment attack. The results also showed that, as the false factor increases, the detection time by the proposed algorithm increases. As the false factor increases from 0.1 to 0.3, the detection time increases by 1.4 s."}]}]}]}}