{"pii": "S2352396417303523", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0085", "view": "all"}, "_": "Cytoplasmic aggregation of fused in sarcoma (FUS) is detected in brain regions affected by amyotrophic lateral sclerosis (ALS) and frontotemporal dementia (FTD), which compose the disease spectrum, FUS proteinopathy. To understand the pathomechanism of ALS-FTD-associated FUS, we examined the behavior and cellular properties of an ALS mouse model overexpressing FUS with nuclear localization signal deletion. Mutant FUS transgenic mice showed hyperactivity, social interactional deficits, and impaired fear memory retrieval, all of which are compatible with FTD phenotypes. Histological analyses showed decreased dendritic spine and synaptic density in the frontal cortex before neuronal loss. Examination of cultured cells confirmed that mutant but not wild-type FUS was associated with decreased dendritic growth, mRNA levels, and protein synthesis in dendrites. These data suggest that cytoplasmic FUS aggregates impair dendritic mRNA trafficking and translation, in turn leading to dendritic homeostasis disruption and the development of FTD phenotypes."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0090", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "ALS model mice expressing FUS with nuclear localization signal deletion showed behavioral and cognitive FTD phenotypes."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Histological analyses revealed decreased dendritic spine and synaptic density before neuronal loss."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Mutant FUS aggregates trap robust mRNA and RNA transporters, leading to dendritic homeostasis disruption."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Strategies targeting dendritic homeostasis might support future approaches to the development of therapies against ALS-FTD."}]}]}]}, {"#name": "simple-para", "$": {"id": "sp0095", "view": "all"}, "_": "Cytoplasmic aggregation of FUS is a pathological hallmark in brain regions affected by FUS-linked ALS-FTD. To understand the pathomechanism of ALS-FTD, this study sought to evaluate FTD pathophysiology in a novel ALS mouse model expressing FUS with a deleted nuclear localization signal. Mutant mice showed hyperactivity, social interactional deficits, and impaired memory retrieval, which are compatible with FTD phenotypes. Histological analyses showed decreased dendritic spine and synaptic density before neuronal loss. Examination of cultured cells confirmed that mutant but not wild-type FUS aggregates trap robust mRNA and RNA transporters and decrease dendritic growth and protein synthesis, resulting in ALS-FTD phenotypes."}]}]}]}}