{"pii": "S2405844024059966", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The proliferation of the Internet of Things (IoT) devices has led to a surge in Internet traffic characterized by variabilities in Quality of Service (QoS) demands. Managing these devices and traffic effectively proves challenging, particularly within conventional IoT network architectures lacking centralized management. However, the advent of Software-Defined Networking (SDN) presents intriguing opportunities for network management, capable of addressing challenges in traditional IoT architectures. SDN's ability to provide centralized network management through a programmable controller, separate from data forwarding elements, has led researchers to incorporate SDN features with IoT (SDIoT) and Wireless Sensor Networks (SDWSN) ecosystems. However, despite the SDN support, these networks encounter challenges related to load-imbalance routing issues, as the SDN controller may be constrained while certain access points serving end users become overloaded. In response to these challenges, various load-balancing routing solutions have been proposed, each with distinct objectives. However, a comprehensive study that classifies and analyzes these solutions based on their weaknesses and postmortem challenges is currently lacking. This paper fills this gap by providing an in-depth classification of existing solutions. The study categorizes the problems addressed by different schemes and summarizes their findings. Furthermore, it discusses the shortcomings of current studies, and postmortem challenges associated with integrating SDN with IoT, and suggests future research directions."}]}]}]}}