{"pii": "S2405844023068263", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "This comparative study is an attempt to explore the determinants of capital structure for Malaysian firms listed in various sectors level. Within the framework of traditional and moderate dynamic capital structure theories, the key determinants such as fixed assets, current assets, return on equity, size, earning per share and total assets are tested in relation to the debt-equity ratio. The large-scale study entails data collected from 551 listed firms of Bursa Malaysia main market over 12 years period i.e. 2005-2016. Notably, this study combines Time Series econometrics with Panel Data analysis to enhance methodological robustness. Moreover, the comparative analysis approach is designated to recognize the most persistent capital structure determinants. In the first place, the Multiple Regression analysis (MRA) is selected as a baseline estimation method. Subsequently, the Auto Regression Distributed Lag model (ARDL), the Panel Data Static models, and Dynamic model via the Generalized Method of Moments (GMM) are employed to identify the capital structure determinants for the firms listed at Bursa Malaysia. The outcomes are surprising and indicate that the entire market is primarily controlled by the studied determinant total assets, which is significant in both construction and property sectors through MRA, ARDL, and GMM analysis. Technically, the significant role of tangibility and the existence of speed of adjustment across sectors imply that the Dynamic Capital Structure is the most prominent among all, followed by the Dynamic Trade-off theory."}]}]}]}}