{"pii": "S2405844024081052", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Smart Grids are the control and transmission networks of the future; they allow suppliers and customers to interact in real time to optimize and intelligently manage resources. Although wireless mesh network technology can facilitate these smart functionalities, it is important to address the vulnerabilities and cyber-attack risks that are inherent to it. Smart Grid's reliance on the Internet amplifies security concerns. A number of methods have been proposed to address this issue; while some have made promises, they all need substantial amounts of computational resources. With this technology, channels based on trust can be set up. The security of the system is built utilizing a family relationship-based method, which makes use of measures that may be used to gauge a node's originality. Additionally, the power consumption and signal strength of the node are taken into account. The complexity and extent of the network need the development of new types of smart grid communication. Finding a way to detect and thwart major assaults on routing protocols is another design challenge. Smart grids rely on these protocols in its data system for efficient interchange of renewable energy. A unique secure energy routing mechanism is developed in this proposed model for secure data communication. In the proposed model, a new method for Neighbor Nodes Trust Tagging Model for Optimized Route Detection (NNTT-ORD) is proposed for establishing secure route for data communication in smart grids. The proposed model is compared with the existing model and the results represent that the proposed model route provides a secure environment for data transmission."}]}]}]}}