{"pii": "S2405844023011714", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Advances in information technology have dramatically enhanced mobile phones. Power capacity is one of the most significant limitations of a mobile phone. As a result, efficient energy management in such devices is critical everywhere. The goal of this research is to find a way to charge electronic devices wirelessly using radio frequency (RF) electromagnetic (EM) waves (Rectenna using energy detection-based spectrum sensing). Mechanical deformations cause frequency detuning, which lowers the effectiveness of antennas and rectennas that would otherwise allow wireless communication and RF energy harvesting in the far field. A rectenna based on a stretchable multiband antenna is designed as a self-powered system to perform reliably and integrate RF power received across its multiband despite mechanical deformations. Depending on what the battery needs, the proposed multiband antenna will work at 900 MHz, 1800 MHz, 2100 MHz, and 2.45 GHz as both an RF transducer and an RF energy harvester. Depending on the received RF power density (high), the receiving RF wave will be utilized for both communication and RF energy harvesting (RF-EH) when the battery's current voltage is less than 20% (referred to as “low voltage”). Otherwise, the received RF wave will be used only for RF-EH. The installed multiband rectifiers function perfectly in terms of efficiency and bandwidth. This proposed technique would reduce the charging crisis by 60–90% depending on the location of the mobile phone or receiver of ambient EM signals. This paper could help researchers in the field of RF energy-based wireless charging systems."}]}]}]}}