{"pii": "S2405844021014560", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Rainfall monitoring networks are key elements for the development of alerts and prediction models for communities at risk of flooding during high intensity rainfall events. Currently, most of these networks send the precipitation measurement to a data center in real-time using wireless communication protocols, avoiding travel to the measurement site. An Early Warning System (EWS) for pluvial flash floods developed in Barranquilla (Colombia), used the GPRS protocol to send rain gauge data in real-time to a web server for further processing; however, this protocol has a high consumption of energy and also high maintenance costs. This article carried out an evaluation in terms of link budget, link profile, energy consumption and devices costs of three low-power wireless communication protocols, Zigbee, LoRaWAN and Sigfox, to determine which one is the most suitable for the EWS of the city of Barranquilla. To perform the evaluation, a wireless sensor network was designed and characterized for Zigbee and LoRaWAN with Radio Mobile tool taking into account the measurement points implemented with GPRS network. The evaluation included the power consumption of Zigbee, LoRaWAN and Sigfox. From the results of simulations, LoRaWAN and Zigbee network has similar radio signal received and the LoRaWAN network obtains the least losses per path. As for power consumption, the LoRaWAN devices has the lowest energy consumption, as well as, the LoRaWAN network sensor nodes are cheaper. Finally, the protocol with the best general performance was LoRAWAN, since complies with the communication, consumption and cost requirements."}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0015", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "LoRaWAN, Rainfall Monitoring, Zigbee, Sigfox."}]}]}]}}