{"pii": "S2405844022040208", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Product visibility is a challenge for many fruit cold chains. Most challenges arise because of technological constraints, which lead to the inability to predict whether fruit temperatures are still within the stipulated requirements. To ensure that the intricately linked cold chain for citrus fruit is well coordinated and offers the visibility of fruit temperature, technologies such as temperature data loggers are used to record and communicate temperature measurements. Concerns arise because temperature-monitoring loggers are not automated and therefore do not offer real-time temperature visibility. They require manual handling, which makes continuous access to temperature data impossible. Receiving real-time temperature data of citrus fruit during the different stages of the cold chain would enable exporters proactively to address issues linked to temperature as the citrus fruit moves along the supply chain. The aim of this study was to assess the potential value of using cellular loggers in contrast to conventional loggers to allow the real-time monitoring of citrus fruit in transit. At present, exporters cannot monitor the temperature conditions of their consignments during the critical phase of cold sterilisation at sea because conventional loggers do not provide visibility of temperature data. To determine the efficacy of cellular loggers, the researchers collected temperature data at the different stages of the cold chain. In addition, interviews were conducted with industry experts in the South African citrus cold chain to determine their experience with different loggers. These interviews identified that conventional (wired) loggers offer a low-cost option, but not real-time product visibility. Cellular loggers offer more real-time data than conventional loggers, but as they depend on cell-phone towers, they offer restricted real-time visibility, especially during the sea leg of the consignment. For this reason, the study recommends that the use of cellular temperature loggers be adopted during land-based stages of the citrus cold chain but not during the sea leg, despite exporters’ concern about the limitations of conventional loggers."}]}]}]}}