{"pii": "S2405844024022229", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Smart learning environments (SLEs) have been developed to create an effective learning environment gradually and sustainably by applying technology. Given the growing dependence on technology daily, SLE will inevitably be incorporated into the teaching and learning process. Without transforming technology-enhanced learning environments into SLE, they are restricted to adding sophistication and lack pedagogical benefits, leading to wasteful educational investments. SLE research has grown over time, particularly during the COVID-19 pandemic in 2020–2021, which fundamentally altered the “landscape” of technology use in education. This study aims to discover how the stages of SLE transform from time to time by applying two bibliometric analysis approaches: publication performance analysis and science mapping. The dataset was created by extracting bibliometric data from Scopus, including 427 articles, 162 publication sources (journals and proceeding), and 1080 authors from 2002 to 2022. Three kinds of SLE research subjects were identified by keyword synthesis: SLE features, technological innovation, and adaptive learning systems. Adaptive learning and personalized learning are consistently used interchangeably to demonstrate the significance of supporting the diversity of student and teacher conditions. Learning analytics, essential to employing big data technology for educational data mining, is a new theme being considered increasingly in the future to achieve adaptive and personalized learning. The 20-year SLE research milestone, broken down into five stages with various focuses on goals and served as the foundation for creating a maturity model of SLE."}]}]}]}}