{"pii": "S2405844022029668", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The industries are presently exploring the use of wired and wireless systems for control, automation, and monitoring. The primary benefit of wireless technology is that it reduces the installation cost, in both money and labor terms, as companies already have a significant investment in wiring. The research article presents the work on the analysis of Mobile Ad Hoc Network (MANET) in a wireless real-time communication medium for a Networked Control System (NCS), and determining whether the simulated behavior is significant for a plant or not. The behavior of the MANET is analyzed for Ad-hoc on-demand distance vector routing (AODV) that maintenances communication among 150 nodes for NCS. The simulation is carried out in Network Simulator (NS2) software with different nodes cluster to estimate the network throughput, end-to-end delay, packet delivery ratio (PDR), and control overhead. The benefit of MANET is that it has a fixed topology, which permits flexibility since mobile devices may be used to construct ad-hoc networks anywhere, scalability because more nodes can be added to the network, and minimal operating expenses in that no original infrastructure needs to be developed. AODV routing is a flat routing system that does not require central routing nodes. As the network grows in size, the network can be scaled to meet the network design and configuration requirements. AODV is flexible to support different configurations and topological nodes in dynamic networks because of its versatility. The advantage of such network simulation and routing behavior provides the future direction for the researchers who are working towards the embedded hardware solutions for NCS, as the hardware complexity depends on the delay, throughput, and PDR."}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0015", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "AODV; MANET; NCS; NS2; PDR; Throughput; Control overhead; End-to-end delay; Wireless communication."}]}]}]}}