{"pii": "S2405844023057584", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Students' psychological fitness is unavoidable, hindering personal development, social interactions, peer influence, and adolescence. Academic stress may be the most dominant factor affecting college students' mental well-being. Therefore, improving the monitoring of mental health issues among college students is a vital topic for study. However, identifying the student's stress level is challenging, leading to uncertainty. Hence, this paper suggests Heuristic Fuzzy C-means Clustering Algorithm (HFCA) for analyzing college students' stress levels, psychological well-being and academic performance detection. The data are collected from the Kaggle stress dataset for predicting student mental health. This study investigates the psychological factors affecting students' academic performance using the suggested HFCA. Students' performance may be predicted using the Fuzzy Cognitive Map (FCM) in this study. This study used fuzzy clustering algorithms to discover the most crucial aspects of student success, such as student involvement and satisfaction. A better understanding of the risk factors for and protective factors against poor mental health can serve as the basis for developing policies and targeted interventions to prevent mental health problems and guarantee that at-risk students can access the help they need. The experimental analysis shows the proposed method HFCA to achieve a high student performance ratio of 96.7%, cognitive development ratio of 97.2%, student engagement ratio of 97.5% and prediction ratio of 95.1% compared to other methods."}]}]}]}}