{"pii": "S2405535216300043", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0005", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abst0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spar0005", "view": "all"}, "_": "Efficient and sustainable sea transport is a key aspect to ensure cost competitive ship operation. The constant need to increase economic feasibility, energy efficiency and safety while complying with emission regulations motivates further developments and improvements in voyage optimization and weather routing systems. These systems optimize a voyage based on meteorological and oceanographic information taking into account ship characteristics and routing information. The quality of the provided route not only depends on the quality of this data, but also on the modeling of the optimization problem and the algorithm chosen to solve it. Due to the wide range of mathematical approaches and consequently challenges in decision making, this paper aims to give a comprehensive and comparative overview of the existing state-of-the-art methods by a thorough literature review and elaboration of different modeling approaches, optimization algorithms, and their application in weather routing systems. The research shows that approaches range from modeling the weather routing problem as a constrained graph problem, a constrained nonlinear optimization problem or as combination of both. Based on the formulation of the ship weather routing optimization problem different methods are used to solve it ranging from Dijkstra's algorithm, dynamic programing and optimal control methods to isochrone methods or iterative approaches for solving nonlinear optimization problems. However, it can be concluded that the determination whether an approach is suitable, produces sufficient results and may be recommended, strongly depends on the specific requirements concerning optimization objectives, control variables and constraints as well as the implementation."}]}]}]}}