{"pii": "S2405844022030493", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Difficult laryngoscopy is associated with airway injury, and asphyxia. There are no guidelines or gold standards for detecting difficult laryngoscopy. There are many opinions on which predictors to use to detect difficult laryngoscopy exposure, and no comprehensively unified comparative analysis has been conducted. The efficacy and accuracy of deep learning (DL)-based models and machine learning (ML)-based models for predicting difficult laryngoscopy need to be evaluated and compared, under the circumstance that the flourishing of deep neural networks (DNN) has increasingly left ML less concentrated and uncreative. For the first time, the performance of difficult laryngoscopy prediction for a dataset of 671 patients, under single index and integrated multiple indicators was consistently verified under seven ML-based models and four DL-based approaches. The top dog was a simple traditional machine learning model, Naïve Bayes, outperforming DL-based models, the best test accuracy is 86.6%, the F1 score is 0.908, and the average precision score is 0.837. Three radiological variables of difficult laryngoscopy were all valuable separately and combinedly and the ranking was presented. There is no significant difference in performance among the three radiological indicators individually (83.06% vs. 83.20% vs. 83.33%) and comprehensively (83.74%), suggesting that anesthesiologists can flexibly choose appropriate measurement indicators according to the actual situation to predict difficult laryngoscopy. Adaptive spatial interaction was imposed to the model to boost the performance of difficult laryngoscopy prediction with preoperative cervical spine X-ray."}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0015", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "Difficult laryngoscopy; anesthesiology; Laryngoscope exposure; Airway management; Machine learning."}]}]}]}}