{"pii": "S2405844024022631", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "This study developed a metamaterial-inspired split-ring resonator (SRR) based inversion symmetry-shaped structure for airport surveillance radar and local area wireless network applications. The proposed device exhibited suitability for S- and C-band applications, featuring distinct resonance peaks at 2.8 and 4.9 GHz, respectively. The two-layer double negative metamaterial unit cell comprises a copper-based resonator, patch, and a low-loss substrate material known as Rogers RT5800 with a thickness of 1.575 mm. The 8 × 8 mm"}, {"#name": "sup", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": " structure unit cell was identified with an effective medium ratio (EMR) of 13.4 at the resonance peak of 2.8 GHz. With the alteration of the metamaterial unit cell structure, the electric field, surface current distribution, magnetic field, and design evolution were observed, analysed, and investigated in this study. Meanwhile, the retrieved data from the reflection and transmission coefficients from CST Microwave Studio were validated using the Ansys High-Frequency Structure Simulator (HFSS) software. A Vector Network Analyzer (VNA) further measured the numerical results. Based on the findings, the proposed novel double negative metamaterial device is suitable for radar communication and satellite applications, especially airport surveillance radar (ASR) and wireless local area network (WLAN), due to its high EMR at the desired resonance frequency."}]}]}]}]}}