{"pii": "S2405844023002098", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Graphene-polyaniline composites have captured extensive attention because of their outstanding performance during the electrochemical process, while their practical applications are limited due to the complex and uncontrollable preparation process. This work provides a simple and controllable preparation route, in which covalent modified reduced graphene oxide (E-RGO) is successfully prepared by ethylenediamine (EDA) and graphene oxide (GO), and E-RGO with different degrees of modification is obtained by adjusting the amount of EDA during the preparation process, and then in situ polymerization of aniline monomer is used to produce E-RGO/PANI in E-RGO suspension. Among them, E-RGO-12 has a relatively stretched sheet, which provides a large support surface for the subsequent in-situ polymerization of aniline and increases the utilization rate of graphene. The PANI network is tightly wrapped on the surface of E-RGO, forming a “PANI-(E-RGO)-PANI” lamellar structure and the single components are connected by covalent bonds and have a strong conjugation effect. The rough surface of the E-RGO/PANI composite and the pores in the PANI network are conducive for the electrochemical process, which increases the active site of electrode reaction, and thus improve the electron transfer rate. E-RGO-12/PANI exhibits superior property with the specific capacitance of 398 F/g at 0.6 A/g, and after the current density changes to 6 A/g, the specific capacitance retention rate is 64.8%. After 2000 cycles, the capacitance retention rate is 76.4%. The current work provides a green and efficient new idea for reducing graphene oxide and preparing E-RGO/PANI composite materials for the energy storage device."}]}]}]}}