{"pii": "S2405844024145410", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The attention and sentiment of the public are crucial for better implementation of waste sorting behaviors and moving towards green living. In this study, web scraping technology was used to collect 367,856 Weibo posts related to waste sorting from Sina Weibo. Utilizing text co-occurrence networks, Latent Dirichlet Allocation (LDA) topic modeling, and a deep learning model combining the Affective Cognitive Model (OCC) with Long Short-Term Memory Model (LSTM) (referred to as OCC-LSTM), we comprehensively understand the text at both micro and macro levels, analyzing the attention and sentiment of the public towards waste sorting behaviors on the Sina Weibo platform. Several important findings emerged from the empirical results. First, highly engaging posts were predominantly published by users with a large following, and the number of posts fluctuated over time. This reflects the influence of social hot topics and the timeliness of information dissemination. Second, there was heterogeneity in the user groups and their locations, often influenced by cultural differences due to geographical location. Third, positive sentiment towards waste sorting behavior was higher than negative sentiment on the Weibo platform. Moreover, public attention varied under different emotional influences concerning the topic of waste sorting behavior. The innovation of this study lies in the development of a research framework combining co-occurrence networks and deep learning, expanding the analysis on both micro and macro levels. This framework broadens the research paradigms and dimensions of public perception in waste sorting. This study is significant for promoting waste sorting behaviors and implementing climate policies."}]}]}]}}