{"pii": "S2405844022009902", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Although the concept of brand equity has been investigated using various approaches, a comprehensive neural basis for brand equity remains unclear. The default mode network (DMN) as a mental process might influence brand equity related consumers' decision-making, as reported in the marketing literature. While studies on the overlapping regions between the DMN and value-based decision-making related brain regions have been reported in neuroscience literature, relationships between the DMN and a neural mechanism of brand equity have not been clarified. The aim of our study is to identify neural substrates of brand equity and examine brand equity-related mental processes by comparing them to the DMN. To determine the neural substrates of brand equity, we first carried out the activation likelihood estimation (ALE) meta-analysis. We examined 26 studies using branded objects as experimental stimuli for the ALE. Next, we set the output regions from ALE as the region of interest for meta-analytic connectivity modeling (MACM). Further, we compared the brand equity-related brain network (BE-RBN) revealed by the MACM with the DMN. We confirmed that the BE-RBN brain regions overlap with the medial temporal lobule (MTL) sub-system, a module composed of the DMN but excluding the retrosplenial cortex. Further, we discovered that several brain regions apart from the DMN are also distinctive BE-RBN brain regions (i.e., the insula, the inferior frontal gyrus, amygdala, ventral striatum, parietal region). We decoded the BE-RBN brain regions using the BrandMap module. The decoded results revealed that the brand equity-related mental processes are complex constructs integrated via multiple mental processes such as self-referential, reward, emotional, memory, and sensorimotor processing. Our study demonstrated that the DMN alone is insufficient to engage in brand equity-related mental processes. Therefore, marketers are required to make strategic plans to integrate the five consumer's multiple mental processes while building brand equity."}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0015", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "Consumer neuroscience, Neuromarketing, DMN, Consumer decision making, ALE, Brand management, fMRI."}]}]}]}}