{"pii": "S2405844024126096", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The rapid integration of the Internet of Things (IoT) into logistics and supply chain management (SCM) marks a significant transformation towards enhanced efficiencies, security, and sustainability. Through a comprehensive bibliometric analysis of 2680 publications from the Scopus database, this study charts the evolution of IoT within logistics and SCM and reveals a shift from foundational explorations to mature implementations. The research unfolds a complex thematic structure, highlighting the revolutionary impacts of IoT and related technologies such as RFID, the synergy of Industry 4.0 with SCM through Artificial Intelligence (AI) and the Industrial Internet of Things (IIoT), the strategic role of blockchain for enhanced traceability and security, and the advent of novel communication and encryption technologies for secure data exchanges. Further, the analysis categorizes the scholarly discourse into critical areas including big data and IoT optimization in SCM, IoT-driven innovation in the food supply chain, applications of blockchain and smart contracts, digital transformation through Industry 4.0, security advancements with intelligent systems, and the exploration of advanced technologies for Industry 4.0 and 5.0. This review not only delineates the intellectual landscape of IoT applications in logistics and SCM but also identifies emerging research areas such as blockchain integration, 5G potential, and AI-driven optimizations, suggesting pathways for future research to broaden the understanding in this dynamically evolving field. It serves as an essential resource for academics and practitioners, providing insights into the transformative role of IoT in logistics and SCM and proposing directions for future technological and academic endeavors."}]}]}]}}