{"pii": "S2405844023015074", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "While the importance of socially shared regulatory of learning (SSRL) in computer-supported collaborative learning (CSCL) environments has increasingly been emphasized, a surge of research has been conducted to identify socially shared regulation activities and their transition sequences. However, little research has been carried out on constructing a systematic framework in which significant regulation activities and transition sequences can be mined automatically with high reliability. Moreover, though efforts have been made, the current SSRL analysis neither serves the construction of downstream teaching intervention strategy nor explores how SSRL analysis results can be utilized conversely for refining the intervention strategy. Based on advanced machine learning techniques, this work proposes a robust framework on SSRL analysis, aiming to find the optimal teaching intervention strategy to improve learners’ performance in CSCL by analyzing the SSRL process. In particular, our framework can automatically identify significant SSRL regulation activities along with high-contribution activity transition sequences. The proposed Ensemble Learning-based classification model with four distilled additional regulation activities can ensure the high reliability of our framework. The framework serves to construct a downstream teaching intervention strategy, while the strategy is updated and verified based on empirical and experimental statistical results within five rounds of iterative experiments. Extensive theoretical analysis and experimental results both confirm the effectiveness of our framework. Meanwhile, the attempt to leverage advanced machine learning algorithms to enhance SSRL analysis in this work can provide a nontrivial contribution to the literature."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "A methodology for auto-mining socially shared regulation activities and sequences."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Effective intervention strategy is proposed iteratively based on mining results."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Four novel regulation activities are distilled and proved contributive to CSCL."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "First attempt on using Ensemble Learning for regulation activities classification."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "The machine learning components of our framework outperform other models."}]}]}]}]}]}]}}