{"pii": "S2405959524000912", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e4545"}, "$$": [{"#name": "section-title", "$": {"id": "d1e4546"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e4548"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e4549"}, "$$": [{"#name": "__text__", "_": "Application Performance Monitoring (APM) is key for ensuring computer systems perform well. While most APM tools target servers and networking infrastructure, here we focus on APM for devices with strict resource constraints: extremely limited in terms of power, memory and bandwidth. We tailor this article to be both a survey and a tutorial. In the survey part, we investigate APM approaches for low-power wireless networks, with a particular focus on Time Synchronized Channel Hopping solutions, as they are well-suited for critical industrial applications. We survey performance metrics characterizing the network health condition and show how, to capture the health of a network universally, it is important to constantly monitor hardware-related, network-related and network-wide metrics. We present a collection of metrics that serves as a checklist for the design of an APM system, describe related work on APM concepts suitable for low-power wireless system, and provide core concepts for collecting, exporting and processing performance metrics. The tutorial part consists of a hands-on example of running commercial APM and networking solutions. We use the active APM framework from "}, {"#name": "italic", "_": "Memfault"}, {"#name": "__text__", "_": ", which periodically creates heartbeats including the performance metrics. We run this framework on top of the SmartMesh IP protocol stack, a commercial product by Analog Devices that offers wired-like high reliability and a decade of battery lifetime, and integrate it with the "}, {"#name": "italic", "_": "Zephyr"}, {"#name": "__text__", "_": " operating systems. This tutorial allows the readership to experiment with a complete ready-to-deploy mote-to-cloud APM chain."}]}]}]}]}}