{"pii": "S240584402403439X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Although numerous photothermal nanoparticles have been designed to improve the enhanced and permeability and retention (EPR) effect, the delivery of nanoparticles to the tumor site remains a major obstacle in cancer treatment. The interstital structure and its internal fluid that play an important role in material transmission, intercellular signal transduction, tissue morphology, immunity, tumor development, and disease diagnosis and treatment may be considered as a new route for drug delivery. Here, we prepared a nanoplatform composed of polydopamine (PDA), indocyanine green (ICG) as a photothermal agent, and paclitaxel (PTX) as a chemotherapeutic drug. The designed PDA-ICG nanoparticles displayed excellent photothermal conversion ability, with the synergistic effect of PTX, the growth of MDA-MB-231 cells was significantly suppressed with the cell viability of 6.19% "}, {"#name": "italic", "_": "in vitro"}, {"#name": "__text__", "_": ". Taking advantage of bioimaging ability of ICG, tumor-targeting of the nanoparticles injected into the interstitial space was study, Compared with intravenous injection, nanoparticles better targeted the tumor based on the interstitial fluid flow in MBA-MD-231 bearing mice. Furthermore, the antitumor efficacy was studied "}, {"#name": "italic", "_": "in vivo"}, {"#name": "__text__", "_": ". With the improved accumulation of PDA-ICG-PTX nanoparticles injected into the interstitial space and the synergistic effect of photothermal therapy and chemotherapy, tumor growth was inhibited without obvious side effects. These results demonstrated that interstitial space injection may be a superior administration route for tumor-targeting nanoparticles. The PDA-ICG-PTX nanoparticles delivered via the interstitial space exhibit great potential in the photothermal chemotherapy of cancers."}]}]}]}]}}