{"pii": "S2405844023041464", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Stubble-burning in northern India is an important source of atmospheric particulate matter (PM) and trace gases, which significantly impact local and regional climate, in addition to causing severe health risks. Scientific research on assessing the impact of these burnings on the air quality over Delhi is still relatively sparse. The present study analyzes the satellite-retrieved stubble-burning activities in the year 2021, using the MODIS active fire count data for Punjab and Haryana, and assesses the contribution of CO and PM"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2.5"}, {"#name": "__text__", "_": " from such biomass-burning activities to the pollution load in Delhi. The analysis suggests that the satellite-retrieved fire counts in Punjab and Haryana were the highest among the last five years (2016–2021). Further, we note that the stubble-burning fires in the year 2021 are delayed by ∼1 week compared to that in the year 2016. To quantify the contribution of the fires to the air pollution in Delhi, we use tagged tracers for CO and PM"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2.5"}, {"#name": "__text__", "_": " emissions from fire emissions in the regional air quality forecasting system. The modeling framework suggests a maximum daily mean contribution of the stubble-burning fires to the air pollution in Delhi in the months of October–November 2021 to be around 30–35%. We find that the contribution from stubble burning activities to the air quality in Delhi is maximum (minimum) during the turbulent hours of late morning to afternoon (calmer hours of evening to early morning). The quantification of this contribution is critical from the crop-residue and air-quality management perspective for policymakers in the source and the receptors regions, respectively."}]}]}]}]}}