{"pii": "S2405844024067069", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "In the everyday world of computer applications, from the cloud to the Internet of Things, distributed sensor networks are essential (IoT). These computer application devices are often connected to Arduino network connection and microcontrollers such sensors and actuators. Thus, a defensive network with an IDS serves as the need for contemporary networks. The intrusion detection system has unavoidably evolved throughout the years, but despite this, it remains a difficult study topic since the current intrusion detection system uses signature-based approaches rather than anomaly detection. Therefore, improving the current intrusion detection system is challenging since it is difficult to find zero-day attacks in IoT networks when dealing with varied data sources. Filtered Deep Learning Model for Intrusion Detection with a Data Communication Approach is presented in this study. The five steps that make up the suggested model are Initialization of Sensor Networks, Cluster Formation and Head Selection, Connectivity, Attack Detection, and Data Broker. It was discovered that the suggested model for intrusion detection outperformed both the current Deep Learning Neural Net and Artificial Neural Network. In comparison to the most popular algorithms, experimental findings revealed a superior result of 96.12 % accuracy. The E-shaped patch antenna is a brand-new single-patch wide-band microstrip antenna that is presented in this research. A microstrip antenna's patch has two parallel slots built into it to increase its bandwidth. Investigating the behaviour of the currents on the patch allows for the exploration of the wide-band mechanism. A broad bandwidth is achieved by optimising the slot's length, breadth, and location. Finally, a 40.3 % E-shaped patch antenna is developed, made, and tested to resonate at 7.5 and 8.5 GHz for wireless communications. Additionally displayed are the reflection coefficient, VSWR, radiation pattern and directivity."}]}]}]}}