{"pii": "S240587262100006X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "We explore the discipline’s attempts to define design in extant literature and in an analysis of 20 years of discussion extracted from the PhD Design email list hosted by JISCMail. We describe in detail our novel method using data mining and cluster visualization, and we present and compare the topics of discussion that emerged from the 20-year data sample. We identified four highly influential term labels based on their common occurrence: theory, knowledge, activity, and science. Our analysis of the text associated with these terms revealed prevailing perspectives of what design is within the design research community conversation. Despite robust discourse around relevant perspectives on design, the list discussions are and have been repetitive, with no significant progress made towards a consolidated definition of design. We propose that it may not be possible to define design in this way, and that the field should move away from reiteration and discuss the importance of design’s role as a leader of the global conversation about transdisciplinary approaches to research and design of the future scenarios and emerging pathways of humankind that such pathways point to."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "We explore the concept of what design is as presented in extant literature and in the analysis of 20 years of discussion in the PhD Design email list."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "We employed a data mining process to extract relevant emails and metadata from the list."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "This led to the identification and visualization of 79 distinct clusters, each representing different discussions over the 20-year span."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Four term labels were identified as highly influential based on their common occurrence: Theory, Knowledge, Activity, and Science."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "We propose to move on from reiterating definitions to discussing the importance of Design in leading the world conversation."}]}]}]}]}]}]}}