{"pii": "S2405844023075989", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Standardized routine operation management (SROM) has been widely accepted and applied by kinds of enterprises and played a key supporting role. With full use of the emerging knowledge-based smart management technology, SROM will further increase comprehensive efficiency and save human resources greatly at the same time, especially for small and medium enterprises (SMEs). Hence, we propose a systematic knowledge-based smart management method to transfer SROM activities from human operations to automatic response by means of knowledge explicitation, organization, sharing and reusing, which can be further achieved by employing knowledge graph. We took a typical SROM instance, ISO 9000 implementation management, as an example to validate the transformation from human activities to knowledge graph-based automatic operation. We firstly analyzed characteristics of domain knowledge and constructed an ontology model according to the knowledge stability. Secondly, a hybrid knowledge graph construction and dynamic updating framework together with related algorithms were designed by deliberately integrating semantic similarity calculation and natural language processing. Thirdly, we developed a question-answering mechanism and reasoning system based on the ISO 9000 implementation knowledge graph to support automatic decision and feedback for ISO 9000 routine operation management including knowledge learning and processes auditing. Finally, the practicability and effectiveness of SROM knowledge graph has been validated in a SME in China, realizing the application of question-answering, job responsibility recommendation, conflict detection, semantic detection, multidimensional statistical analysis. The proposed method can also be generalized to support auxiliary optimization decision, vertical risk control, operation mode analysis, optimization model improvement experience and so on."}]}]}]}}