{"pii": "S2405844022006867", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0330", "view": "all"}, "_": "Collaborative Beamforming (CB) is an essential tool towards achieving long-range transmission in Wireless Sensor Networks (WSNs). In some instances, there may be multiple intended data destinations (sinks) in a WSN. This calls for multi-CB. In comparison to sink-by-sink CB, multi-CB implies improved data rates and decreased co-channel interference; and consequently increased network capacity. In current literature, there is no research in multi-CB particularly in 3-dimension WSNs. In this paper, a novel multi-CB mechanism is brought to the fore. This is from the point of view of a random arrangement of sensor nodes in a 3-dimension manner. It is assumed that all sinks' directions are known at the CB cluster head. Node transmit amplitude and phase are optimized using a Particle Swarm Optimization (PSO) algorithm variant to concurrently achieve balanced multiple narrow beams and minimal radiation in undesired directions. The performance of the proposed scheme is checked against that of a pure multiple beam steering approach (without beam power balancing and minimization of radiation in undesired directions). Moreover, an analysis of beam power, width and steering accuracy is done upon varying the number of collaborating nodes and the collaborating cluster radius. Increasing the count of collaborating nodes yields improved beam precision/accuracy, lower radiation in undesired directions and appreciable stability in beam power performance Increasing the collaborating nodes' cluster radius yields narrow beams, improved beam precision and appreciably lower radiation in undesired directions. The contributions of this work to current literature include: (i) formulation and analysis of a multiple beamforming scheme in the realm of 3-dimension WSNs; (ii) design of a multi-CB scheme taking into account minimization of radiation in undesired directions; (iii) a statistical multi-CB performance analysis upon varying collaborating nodes' cluster radius and collaborating node count."}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "ab0020", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0340", "view": "all"}, "_": "Wireless Sensor Network; Collaborative beamforming; Multiple beamsteering"}]}]}]}}