{"pii": "S2452414X2400027X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara019", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "The older CNC machines in today's factories lack standardized communication interfaces."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "This machinery has a productive life of more than 50 years."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "Upgrading SINUMERIK CNCs with OPC-UA enables Industry 4.0 integration, including maintenance services."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "This concept introduces cost-effective, plug-and-play software, eliminating the need for extra hardware."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara020", "view": "all"}, "_": "Interconnectivity and the standardization of communications promotes the growth of Industry 4.0. The most modern industrial machinery, devices and processes are equipped with communication systems that favor such connectivity throughout industrial standards such as OPC UA (Open Platform Communications Unified Architecture). On the other hand, older computer numerical control systems (CNCs), although generating large amounts of data, lack standardized communication interfaces. Based on the above, the purpose of this research has been to provide connectivity to a subset of Siemens numerical controls, specifically the SINUMERIK 840D models in their older versions. Although previous research has explored this issue, limitations were encountered due to hardware and/or software requirements that present incompatibilities with the older versions. To address this issue, in this article, we present a Unified Communications System (UNIFIK) based on OPC UA for older SIEMENS CNCs, namely the Siemens 840D powerline (pl) and solution line (sl), through their PC Unit systems (PCU) SINUMERIK MMC, SINUMERIK HMI Advanced and SINUMERIK Operate 4.5. UNIFIK has been developed, tested, and validated in an Industry 4.0 laboratory as well as on real end-customer production lines. For the validation phase, 21 SINUMERIK devices were connected, and 7 OPC-UA clients simultaneously read 250 variables for 4 months. RAM usage was observed to range from 75 MB to 100 MB and CPU was observed to be within the normal range, fluctuating between 5 % and 30 %. These performance metrics were achieved alongside a data refresh time of less than one second (250 milliseconds for SINUMERIK Operate) and a transfer rate between the OPC-Server and the drivers of 1.65 kB/s, which represents a significant advancement in the connectivity of this type of machinery."}]}]}]}}