{"pii": "S2451958823000611", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The paper describes the method and system architecture for the intellectual analysis of text and emotions to support decision-making in the field of national security and defense. Considering the latest events in the world, mass media are becoming a powerful tool for manipulating public consciousness and promoting the interests of one country over another. The article describes the methodology of collecting historical articles from a website, analyzing peak news outbreaks, and analyzing each article's text. The morphological tagging and named-entity recognition as the core of natural language processing was described. A hybrid method based on learning rules and an ensemble of machine learning methods has been developed for sentiment analysis and covert propaganda. The proposed rule-based model allows choosing the class-based lexical approach or on collected dictionaries. The combination of the methods based on dictionaries and rules with the ensemble of machine learning models are developed. The developed stacking model combines weak classifiers and deformed meta-attributes based on the results of pairwise multiplication. Finally, the distorted features are used together with the training dataset in the meta-model. This combination avoids the correlation of the results of weak classifiers and increases the generalizability of the model. The proposed approach demonstrates high accuracy and usage for Russian and Ukrainian languages. The developed method is built on Chambers's proposal. As a result of the analysis, the manipulation of public consciousness and the number of negative articles about the two countries are determined. The results of the check give us reason to consider the information spread by the media to be manipulative."}]}]}]}}