{"pii": "S2452301117301463", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0010"}, "_": "Purpose"}, {"#name": "simple-para", "$": {"id": "sp0055", "view": "all"}, "_": "This study investigates whether the recognition memory phenomena previously found for script-based stories also apply to illness scripts, the hypothesized mental structures expert physicians apply in medical diagnosis. In addition, the development of these scripts is investigated."}]}, {"#name": "abstract-sec", "$": {"id": "abs0015", "role": "materials-methods", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0015"}, "_": "Method"}, {"#name": "simple-para", "$": {"id": "sp0060", "view": "all"}, "$$": [{"#name": "__text__", "_": "Second and sixth year students and experienced family physicians participated; the influence of typicality of information (prototypical versus atypical statements), textual presence (verbatim or implicit), and delay (15"}, {"#name": "hsp", "$": {"sp": "0.25"}}, {"#name": "__text__", "_": "min or 1 week) on recognition memory discrimination was investigated in a 3×2×2 ANOVA design and on recognition reaction times (RTs) in a 3×2×2×2 ANOVA design."}]}]}, {"#name": "abstract-sec", "$": {"id": "abs0020", "role": "results", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0020"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "sp0065", "view": "all"}, "_": "The expected developmental differences could not be replicated; all participants appear to dispose of illness script structures, which explains poorer memory discrimination for prototypical than atypical information. The results also show that at a longer delay, medical students and physicians are more inclined to infer unstated, but script-typical information. With regard to the RTs, the interaction between typicality and textual presence on RTs could be replicated: RTs for prototypical unstated items were longer than for any of the other types of information. Apart from this, RTs for different statements did not show a consistent pattern."}]}, {"#name": "abstract-sec", "$": {"id": "abs0025", "role": "discussion", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0025"}, "_": "Discussion"}, {"#name": "simple-para", "$": {"id": "sp0070", "view": "all"}, "_": "The superior memory discrimination for script atypical, compared with script prototypical, information, and at immediate retention, compared to delayed retention supports theoretical notions as well as previous research on illness scripts as general event representations with actual case information “tagged” to these stored representations. This tagged information decays over time. In terms of script development, all participants appear to have their knowledge structured in illness scripts, even students who have little experience with the diseases included in the study."}]}]}]}}