{"pii": "S2452321624007005", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0060", "view": "all"}, "_": "The reliability of structures and the preservation of the built environment are issues with a decisive role in the field of civil engineering as well as in the public eye. The existing heritage surrounding human beings is varied and fragile because of its inherent characteristics and the environment in which it is inscribed. These elements are found and emphasized when dealing with special facilities, by constitution and by public utility. This case study analyzes innovative approaches and IoT tools for defining an operational procedure for the proper Life-Cycle management of infrastructure works through a Digital Twin approach. This methodology provides key elements for the proper planning of structural rehabilitation and reinforcement strategies and techniques with innovative interventions and methods, starting with a careful investigation/monitoring campaign to assess its safety condition. This monitoring activity involves the assessment of the real robustness and safety of large structures by acquiring the general principles of signal analysis and the traditional technologies currently available for diagnostics and monitoring (accelerometers, inclinometers, deformometers, strain gauges, etc.). The case study under consideration monitoring activities go through a static type of monitoring that involves the acquisition of absolute and relative displacements, and through a dynamic structural monitoring that is based on the analysis of natural and traffic- induced vibrations using triaxial accelerometer transducers. The latter case of structural monitoring makes it possible to derive the dynamic properties of the structure and ensure the reliability of the finite element model; in addition, the variation in dynamic characteristics over time is an indicator of ongoing degradation in the structure due to damage phenomena. By means of a dense network of sensors (IoT devices) operating completely wirelessly that are able to communicate in real time through a LoRaWAN telecommunication technology, it is possible to create a digital, living and interactive copy in constant update of the physical object. In addition, the system includes implementation of a Real Time notification system called \"recognized call,\" which consists of automatically making a phone call, to numbers specified by the managing body of the work, whose content includes indication of the location, type of alarm threshold, actions to be taken. The objective of this study is to investigate the possibility of using Digital Twin-based systems associated with structural health monitoring of infrastructure works through real-time data analysis."}]}]}]}}