{"pii": "S2468428722000508", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Objective"}, {"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "We sought to train a foundational convolutional neural network (CNN) for screening computed tomography (CT) angiography (CTA) scans for the presence of infrarenal abdominal aortic aneurysms (AAAs) for future predictive modeling and other artificial intelligence applications."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0020"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "From January 2015 to January 2020, a HIPAA (Health Insurance and Accountability Act)-compliant, institutional review board–approved, retrospective clinical study analyzed contrast-enhanced abdominopelvic CTA scans from 200 patients with infrarenal AAAs and 200 propensity-matched control patients with non–aneurysmal infrarenal abdominal aortas. A CNN was trained to binary classification on the input. For model improvement and testing, transfer learning using the ImageNet database was applied to the VGG-16 base model. The image dataset was randomized to sets of 60%, 10%, and 30% for model training, validation, and testing, respectively. A stochastic gradient descent was used for optimization. The models were assessed by testing validation accuracy and the area under the receiver operating characteristic curve."}]}, {"#name": "abstract-sec", "$": {"role": "results", "id": "abssec0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0025"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "Preliminary data demonstrated a nonrandom pattern of accuracy and detectability. Iterations (≤10) of the model characteristics generated a final custom CNN model reporting an accuracy of 99.1% and area under the receiver operating characteristic curve of 0.99. Misjudgments were analyzed through review of the heat maps generated via gradient weighted class activation mapping overlaid on the original CT images. The greatest misjudgments were seen in small aneurysms (<3.3 cm) with mural thrombus."}]}, {"#name": "abstract-sec", "$": {"role": "conclusion", "id": "abssec0025", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0030"}, "_": "Conclusions"}, {"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "Preliminary data from a CNN model have shown that the model can accurately screen and identify CTA findings of infrarenal AAAs. This model serves as a proof-of-concept to proceed with potential future directions to include expansion to predictive modeling and other artificial intelligence-based applications."}]}]}]}}