{"pii": "S2468227623000959", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara031", "view": "all"}, "_": "Research in Remote Patient Monitoring Systems (RPMS) is considered to be one of the most crucial fields since it deals with human lives. The rise in usage of RPMS has increased since the emergence of the pandemic. Even though there is a rise in these systems, there are some challenges, such as mobility, heterogeneous networks, standardization of RPMSs, automation, and Quality of Service (QoS). Our discussion focuses on RPMS systems for physiological parameter monitoring in the areas of their applications, architecture, and challenges. Thus, an in-depth review of RPMS and the analysis of these data are performed in order to understand where the current RPMS literature stands. The literature shows that research in these RPMS is concentrated on two or more of the following areas: applications, architecture, methodologies, and their performance. It appears that prior to 2020, researchers focused on nearly all aspects of RPMS until the pandemic. Then there was a shift in RPMS research to focus more on the applications and architectures of these systems. As a result, more companies are developing mobile RPMS. In this paper, we present a detailed of various existing RPMS with areas of focus on their application, architecture, technology applied, and challenges faced. We further provided a comparative and statistical analysis of the existing literature, and, finally, an overview of Quality of Service (QoS) as one challenge of RPMS is provided. The surveyed QoS requirements based on traffic type, data quality, device quality and network metrics are provided, with the aim of providing the current trend for researchers and industries to adapt to the best approach in the design of quality-aware RMPS. We then conclude the work by providing future work, which, when adopted, will brighten the future of RPMS deployment."}]}]}]}}