{"pii": "S2468013318300160", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0001", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "Accelerometers track wave heights in real time with mesh-grid wireless modules on oil skimmers and in microbuoys."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "Controlled tests were done in the wave tank at Ohmsett, the National Oil Spill Response Test Facility in New Jersey."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "Wave heights calculated using the scalar magnitude of the three-axis accelerometer were within four inches of the benchmark."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara0005", "view": "all"}, "_": "Marine oil spills can be remediated by mechanical skimmers in calm waters, but performance degrades with increased wave height. We have developed and demonstrated a system that quantifies local wave characteristics with an uncertainty of four inches of heave. Our system is intended for the measurement of wave characteristics during oil spill recovery. It conveys this information to coordinators and responders in real time via WiFi and remote reporting through a satellite network. This information will allow for enhanced situational awareness during an oil spill response, assisting stakeholders and optimizing mechanical skimming operations. Our wave characterization module (WCM) uses accelerometer outputs from a very small inertial measurement unit (IMU) to generate wave statistics and calculate wave characteristics. It is configured such that a WCM can either be attached to a skimmer float or incorporated into a microbuoy. Wave height and period are transmitted via WiFi and/or a satellite-enabled mesh-grid network to a cloud-hosted geographic information system (GIS). Here, we discuss the bare-bones sensors-plus-algorithm approach we developed by using spring-mass systems to approximate the wave height and period regime of interest. We then describe open water tests carried out using that development system both mounted to a weir skimmer mockup and packaged in a microbuoy. Finally, we present controlled tests in the wave tank at Ohmsett, the National Oil Spill Response Test Facility in New Jersey, with the WCMs communicating the wave characteristics via WiFi to tankside laptops and via satellite to the cloud-based GIS. Snapshot determinations of wave height calculated using the scalar magnitude of the three-axis accelerometer in the IMU were within four inches of the benchmark wave measurement system at Ohmsett."}]}]}]}}