{"pii": "S2468227623002727", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara010", "view": "all"}, "_": "Dust particles and sand storms can cause attenuation and cross-polarization of electromagnetic wave propagation, especially at high frequencies above 10 GHz. Dust attenuation has been the focus of many research works, mainly with the deployment of a 5G wireless network in the FR-2 band (mmWave band, 23–53 GHz with TDD). This has led to the development of novel models to accurately predict and estimate attenuation. However, the existing review works have not adequately provided extensive taxonomies for these models to show the state-of-art and future research directions. This paper aims to bridge this gap by providing a comprehensive review of all electromagnetic scattering models in terms of their strengths, weaknesses, and applications. Lessons learned from the detailed survey have been stated and discussed extensively. Key findings from this review indicate that all the models developed were limited to the region where they were developed, with frequency and visibility levels as the two main parameters. The survey across regions showed no model was developed for Region 2, including the Americas, Greenland, and some of the eastern Pacific Islands. Among the dry regions of the globe, where dust and sand storms can occur either occasionally or frequently, it can be seen that only a few parts of these desert regions of Africa (Region 1) and Asia (Region 3) have been considered by authors for the development of prediction models for attenuation due to dust storms. Thus, this also shows the limitations of the overall deterministic models and presents the crucial need to develop new models or modify existing models to accurately predict dust attenuation in other regions, particularly in Africa."}]}]}]}}