{"pii": "S2468227623003873", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara016", "view": "all"}, "_": "Achieving sustainability in cities relies on effective mobility management (MM) that serves current and future generations. It involves establishing an inclusive transportation system to address many issues, like traffic congestion, air pollution, and greenhouse gas emissions. Beyond environmental concerns, robust mobility management has social and economic advantages, fostering improved access to vital services like healthcare, education, and employment. Software-defined networking (SDN) presents a viable solution for enhancing MM within networks. Unlike traditional setups, SDN merges MM through a programmable control plane, streamlining network configurations and enabling features like handover, load balancing, and quality of service (QoS). The utilization of SDN technology extends to various facets of sustainable city networks, encompassing areas like network security, performance optimization, big data processing, energy efficiency, emergency management, carbon emissions reduction, intelligent services, and MM in vehicular networks. Despite the advantages of SDN-based mobility management, it's crucial to acknowledge the challenges and limitations posed by traditional MM methods that SDN aims to overcome. The paper explores SDN's potential in sustainable cities, focusing on how it can transform mobile device management, support various networking technologies, and evaluate the impact of SDN methods on existing MM systems, considering factors like scalability and compatibility. The paper asserts that SDN-based MM has substantial potential for promoting sustainable urban development. By centralizing control, adapting to changing conditions, and optimizing resource allocation, SDN can contribute to reduced energy consumption, lower carbon emissions, and more efficient urban mobility. It emphasizes the importance of addressing potential drawbacks to ensure successful implementation in sustainable cities."}]}]}]}}