{"pii": "S246851942300023X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Tissue regeneration is yet a critical issue, and to mimic the natural extracellular matrix (ECM) innovative scaffolds need to be developed to ensure the functional and safe repair of the damaged organs or tissues. Hybrid biomaterials based on the combination of a biodegradable polymer and bioactive glasses (BGs) are potential candidates for tissue engineering (TE), since they exhibit tailored physical, biological, and mechanical properties, as well as controlled degradation behavior. Thus, the main purpose of this research was to develop by electrospinning (ES) a hybrid nanofibrous membrane composed of a synthetic polymeric matrix (PCL) and a boron and calcium silicate glass, formed via "}, {"#name": "italic", "_": "in situ"}, {"#name": "__text__", "_": " sol-gel, and based on a non-aqueous and green fabrication route. Formic acid (FA) and glacial acetic acid (AA) were used as green solvents to dissolve the PCL. Different compositions were prepared: neat PCL and PCL/SiO"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": "–B"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": "O"}, {"#name": "inf", "$": {"loc": "post"}, "_": "3"}, {"#name": "__text__", "_": "–CaO with different sol-gel aging times and green solvent systems. All prepared hybrid solutions, except the composition with only AA, were spinnable. Structural features of the hybrids were assessed by ATR-FTIR spectroscopy, which confirmed the presence of siloxane (Si–O–Si) bonds of silica and carbonyl (C"}, {"#name": "glyph", "$": {"name": "dbnd"}}, {"#name": "__text__", "_": "O) bonds characteristic of PCL polymer as well as intermolecular hydrogen-bonding interactions between the carbonyls of PCL and the silanol hydroxyls (Si–OH) of silica networks. Boron (B–O–B) and borosiloxane (B–O–Si) bonds were not visible due to the overlapping of PCL bands in the spectra. Only the solid state "}, {"#name": "sup", "$": {"loc": "post"}, "_": "11"}, {"#name": "__text__", "_": "B NMR technique allowed to find peaks assigned to trigonal BO"}, {"#name": "inf", "$": {"loc": "post"}, "_": "3"}, {"#name": "__text__", "_": " and tetrahedral BO"}, {"#name": "inf", "$": {"loc": "post"}, "_": "4"}, {"#name": "__text__", "_": " groups, which evidence the boron linkages to silica. Thermal analysis showed a change in the crystallinity of PCL with the incorporation of inorganic domains, confirming the formation of chemical interactions between the polymer and the inorganic part. Microstructure and chemical analysis, by SEM/EDS, showed a homogenous distribution of Ca and Si elements into the fibers, as well as an increase of the fiber diameter with the incorporation of boron and calcium silicate glass in the PCL. The developed compositions of PCL/boron and calcium-containing silicate were feasible to electrospin into fibrous meshes, proving its potential for further design of multicomponent nanofibrous microstructures closer to extra cellular matrix architectures."}]}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "To PCL/SiO"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": "–B"}, {"#name": "inf", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": "O"}, {"#name": "inf", "$": {"loc": "post"}, "_": "3"}, {"#name": "__text__", "_": "–CaO hybrid fibers were produced by electrospin."}]}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "A non-aqueous sol-gel process using green solvents was developed."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Hydrogen-bonding interactions between the carbonyls of PCL and silanol hydroxyls were confirmed."}]}]}]}]}]}]}}