{"pii": "S2543925123000128", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Social media platforms, search engine transaction logs, Web portal transaction logs, large text corpora, and other data sources offer users a variety of invaluable data sources. Data generated based on social media platforms and other data sources have become important sources of big data for researchers in information science. Big data provide not only challenges but also opportunities for information science. Emerging big data trends inevitably have an impact on research methods in information science. The authors of this paper discuss the impact of big data on research methods in information science."}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "This paper addresses these challenges and opportunities through the lens of research methods, ranging from data processing, to sampling, to information visualization, to temporal analysis, to sentiment analysis, to correlation, to cause-effect relationship, to data accessibility, to data privacy, and data ethics issues."}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "The discussions on related aspects of research methods provoke a healthy reflection and debate for the information science research community, which can help researchers in the field produce sound research designs for big data-oriented research studies and assist information practitioners in solving problems they face in the big data age."}, {"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "Research methods are fundamental and essential for any research studies. Big data analysis has a natural relationship with research methods. The paper discusses an emerging and important research topic big data from the unique angle of research methods."}]}]}]}}