{"pii": "S2542660523001294", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara009", "view": "all"}, "_": "The rapid proliferation of Wireless Sensor Networks (WSN) and other linked devices has given rise to several notions that blend the virtual and real worlds. A vision in which billions of intelligent objects are joined together to provide connectivity for anything, not just everyone. The data quantities gathered and transferred will expand significantly as the number of participants in the future Internet of things grows, rendering the traditional data gathering and processing methods impaired. As a result, the volume of data should be decreased so that decision-makers can mine and evaluate such massive amounts of data."}, {"#name": "simple-para", "$": {"id": "spara010", "view": "all"}, "_": "In the Internet of things (IoT), dedicated to healthcare, various data may be collected from diverse body sensors, ambient sensors, and other data sources such as cameras, voice recorders, and so on. The processing, synchronization, aggregation, and compression of these heterogeneous data are crucial tasks for providing accurate real-time healthcare services. Energy efficiency imposes a strict limitation on wearable WSNs since wireless transmission consumes a large amount of power. Several compression approaches have been presented in the literature to tackle the issue of energy consumption. These approaches can be divided into three categories: communication compression, sampling compression, and data compression. Data compression mechanisms should lessen the data length and compress data using fewer resources. The peculiarities of the data should be addressed during the compression process. Irrelevant data might be eliminated depending on the user's capacity to use or comprehend such data. Data compression techniques are extensions of compression algorithms and data aggregation methods. Data compression algorithms play a substantial role in WBSNs as the sensors in WBSNs have restricted memory and low battery power. Furthermore, data should be transmitted quickly and lossless to provide real-time services. Despite the availability of many review papers on data compression techniques in wireless sensor networks, there is a lack of surveys that identify gaps in existing data compression techniques, highlight areas for future research, and provide a comprehensive analysis of the current trends and practices in the IoT-enabled WBSN, primarily the healthcare domain. This paper will fill the gap, provide a clear analysis, and review data compression mechanisms in IoT-enabled WBSN. We outline the main requirements for IoT-enabled WBSN, existing methods, and state-of-the-art solutions. Furthermore, we evaluated the performance of the current techniques in the literature based on several criteria such as compression ratio, complexity, energy saved, minimized transmission, energy consumption, Net energy saved, energy efficiency, reliability, and scalability. More importantly, we discussed how data compression methods could be a crucial enabler in solving many IoT problems. The paper also identifies open research problems and challenges for IoT-enabled WBSN."}]}]}]}}