{"pii": "S2542660523000811", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara035", "view": "all"}, "_": "Data transmission over power line communication (PLC) infrastructure will proliferate lightweight Internet of Things (IoT) nodes in 5G and 6G networks. Consequently, a corresponding lightweight multi-hop routing protocol (LMRP) with reduced path loss and computational complexities will be required at the edges of PLC networks to connect the cloud sinks. Using a multi-layered system architecture, we present an LMRP for optimal routing and highlight the components of a smart PLC network comprising edge power pool orchestration, edge layer service provisioning, fog latency layer, and cloud resilient backbone. The LMRP reduces path loss and node failure states at the edge while optimising throughputs, minimum cost flow, and signal stability. A multi-hop deterministic testbed is designed and applied in three different locations to estimate path loss leveraging TelosB IoT node, Raspberry Pi (RPI) with NesC, and Java scripted logger application. Three different testbeds of varying path loss characteristics at the Federal University of Technology Owerri (FUTO) are used while the analysis was completed at Manchester Metropolitan University engineering LAB. The result of PL mitigation in Location 1 (sonic FUTO) shows 33.89%, 33.25%, and 32.77% with genetic algorithm (GA), particle swarm optimisation (PSO), and the proposed LMRP, respectively. In Location 2 (Old SEET Complex, FUTO), the PL obtained are 33.81%, 33.57%, and 32.62%, while Location 3 (New SEET Complex, FUTO) yields 33.65%, 33.41%, and 32.74% in PL mitigation for GA, PSO, and LMRP, respectively. Despite improved PL mitigation, the results also show that the proposed scheme offers a lightweight routing performance of at least 76.30% compared to similar schemes."}]}]}]}}