{"pii": "S2542660524002361", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara014", "view": "all"}, "_": "This paper presents the design of a robust IoT (Internet of Things) system developed for Smart Beaches Applications that allows the planning and smart management of these areas. The contributions of this development were to implement low-cost and maintained-free hardware devices with wireless data transmission based on Sigfox LPWAN (Low Power Wide Area Network) technology, evaluation of the application, and overcome the aggressive environment where nodes were placed. Nodes have a low power consumption, which allows to be supplied by batteries, and these batteries are recharged by an energy harvesting module with solar panels. These nodes include different sensors for monitoring physical parameters such as: temperature, relative humidity, ultraviolet index, etc. Sensors’ data are transmitted via the network base stations to an IoT platform and from there to an application server. A database has been designed to save the data and make it available to tourists via a mobile application. In this way, the proposed IoT system achieves real-time monitoring of the existing environmental conditions at beaches and provides tourists with information on the environmental situation of the beach. The node developed presents an average current and power consumption of 1.88 mA and 6 mW, respectively. This consumption allows an autonomous operation without solar panels for around 10 days with a full charged 500 mA battery. Conducted experiments with real deployments at beaches in the Mediterranean coast of Spain have proved that, in case of operating the nodes with solar panels and protecting them adequately, they can run for several years without maintenance thanks to a ruggedized electronic."}]}]}]}}