{"pii": "S2542660524000982", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e126", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e127"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e129", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e130", "view": "all"}, "_": "Free, open, and neutral network (FONN) is an alternative to the prevailing proprietary ISP networks on the Internet. From the FONN manifesto, we conceive two main goals: to give freedom to users and to cooperate in building and maintaining the FONN infrastructure. However, the manifesto avoids talking about the business model of this infrastructure and neglects to give the appropriate role to each member of the community in building and maintaining this infrastructure. Moreover, current research misplaces FONN’s cooperation in the avoidance of the tragedy of the commons and also overlooks ownership. The move from wireless to fiber has amplified the consequences of not considering ownership or member roles. In order to fill the previous gaps, in this article we will first relate the objectives of this manifesto to the field of free software. Next we will argue that FONN’s cooperation should be placed in the avoidance of the tragedy of the anticommons. Inspired by free software we define a new business model for FONN besides discussing different ownership licenses. Furthermore, we state the roles of members and rigorously model the economic flow of construction and maintenance costs. The main implication of the proposed business model is that future FONNs will avoid the economic and organizational collapse of some current FONN communities, mainly because funding cannot be based solely on crowdfunding or volunteering. Yet, as an overall benefit, FONN avoids the duplication of infrastructure. This new business model has been used successfully in the fiber deployment of a FONN section."}]}]}]}}