{"pii": "S2542435119301667", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Summary"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Indoor photovoltaic cells have the potential to power the Internet of Things ecosystem, including distributed and remote sensors, actuators, and communications devices. As the power required to operate these devices continues to decrease, the type and number of nodes that can now be persistently powered by indoor photovoltaic cells are rapidly growing. This will drive significant growth in the demand for indoor photovoltaics, creating a large alternative market for existing and novel photovoltaic technologies. With the re-emergence of interest in indoor photovoltaic cells, we provide an overview of this burgeoning field focusing on the technical challenges that remain to create energy autonomous sensors at viable price points and to overcome the commercial challenges for individual photovoltaic technologies to accelerate their market adoption."}]}]}, {"#name": "abstract", "$": {"class": "editor-highlights", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Context & Scale"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "The Internet of Things (IoT) ecosystem promises large networks of connected devices collecting the big data upon which our medical, manufacturing, infrastructure, and energy industries will be monitored and optimized. Billions of wireless sensors are expected to be installed over the coming decade, with almost half to be located inside buildings. Currently, the use of batteries to power these devices places significant constraints on their power consumption, where the range and frequency of data transmission are curtailed to achieve sufficient battery life, and the range of applications is also limited to the ones that allow battery replacement. Additional operation and maintenance costs are also incurred by providing replacement batteries."}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "$$": [{"#name": "__text__", "_": "Indoor photovoltaics has the potential to solve these hardware issues, providing greater reliability and operational lifetimes in wireless sensor networks. Persistently powering individual nodes by harvesting ambient light using small ∼cm"}, {"#name": "sup", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": " photovoltaic cells is becoming possible for more and more wireless technologies and devices. Characterizing IPV cells is a growing research field with the performance of a considerable number of different PV technologies having now been measured under ambient light sources. Given the interest in commercializing different photovoltaic cells in this growing market, we discuss here the outstanding research questions that must be answered by the indoor photovoltaic community to enable self-powered, indoor-located IoT nodes."}]}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0020", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "Indoor photovoltaic cells have the potential to power the Internet of Things ecosystem. As the power required to operate devices continues to decrease, the type and number of nodes that can now be persistently powered by indoor photovoltaic cells are rapidly growing. This will drive significant growth in the demand for indoor photovoltaics, creating a large alternative market for existing and novel photovoltaic technologies. We provide a perspective on this burgeoning field, outlining the technical and commercial challenges to be overcome."}]}]}]}}