{"pii": "S2542660523003566", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1798", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1799"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1801", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1802", "view": "all"}, "_": "The LoRaWAN infrastructure has been designed to allow easy implementation of backends in mixed IoT scenario with both on premise and cloud servers. Some very popular providers offer the LoRaWAN backend in the form of SaaS, or the user can install containerized versions of the backends into his/her own servers. In this paper, the containerization of LoRaWAN end node is discussed, addressing different architectures for disaggregating the tasks and decomposing the stack levels from the hardware. Such an analysis leads to the introduction of a new fully virtual end node, that paves the way to innovative use of the LoRaWAN backend. The proposed container-based architecture is then applied to some general IoT use cases, which have been setup using a commercial, industrial-grade, framework for the experimental phase. The experimental evaluation, based on purposely defined metrics, takes into account the latency in transferring data among the different stack level and backend components. The focus is on comparing the performance of the proposed architecture in the diverse use cases, and on giving a clear overview of advantages and disadvantages of the possible choices. For instance, noticeable differences emerged when comparing containerization running directly on Operating System vs. containerization running inside virtual machine. Finally, a discussion about the use of the proposed solution for increasing LoRaWAN capabilities in terms of flexibility and performance (e.g., by means of multiple end nodes leveraging a single radio for redundancy purpose) is carried out."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e1804", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1805"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e1807", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1808", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e1810"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1811"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1814", "view": "all"}, "_": "Analysis of LoRaWAN end device disaggregation, decomposition and containerization."}]}, {"#name": "list-item", "$": {"id": "d1e1816"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1819", "view": "all"}, "_": "Identification and discussion of possible use cases."}]}, {"#name": "list-item", "$": {"id": "d1e1821"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1824", "view": "all"}, "_": "Definition and analysis of different architectures and their correspondig metrics for performance evaluation."}]}, {"#name": "list-item", "$": {"id": "d1e1826"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1829", "view": "all"}, "_": "Setup of experimental testbench using an industrial-grade framework."}]}, {"#name": "list-item", "$": {"id": "d1e1831"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e1834", "view": "all"}, "_": "Discussion of possible usage of the proposed approach and future research directions."}]}]}]}]}]}]}}