{"pii": "S2589750023002182", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ceab10", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cestitle10"}, "_": "Summary"}, {"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cestitle20"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "spara120", "view": "all"}, "_": "Artificial intelligence (AI) systems for automated chest x-ray interpretation hold promise for standardising reporting and reducing delays in health systems with shortages of trained radiologists. Yet, there are few freely accessible AI systems trained on large datasets for practitioners to use with their own data with a view to accelerating clinical deployment of AI systems in radiology. We aimed to contribute an AI system for comprehensive chest x-ray abnormality detection."}]}, {"#name": "abstract-sec", "$": {"id": "ceabs20", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cestitle30"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "spara130", "view": "all"}, "_": "In this retrospective cohort study, we developed open-source neural networks, X-Raydar and X-Raydar-NLP, for classifying common chest x-ray findings from images and their free-text reports. Our networks were developed using data from six UK hospitals from three National Health Service (NHS) Trusts (University Hospitals Coventry and Warwickshire NHS Trust, University Hospitals Birmingham NHS Foundation Trust, and University Hospitals Leicester NHS Trust) collectively contributing 2 513 546 chest x-ray studies taken from a 13-year period (2006–19), which yielded 1 940 508 usable free-text radiological reports written by the contemporary assessing radiologist (collectively referred to as the “historic reporters”) and 1 896 034 frontal images. Chest x-rays were labelled using a taxonomy of 37 findings by a custom-trained natural language processing (NLP) algorithm, X-Raydar-NLP, from the original free-text reports. X-Raydar-NLP was trained on 23 230 manually annotated reports and tested on 4551 reports from all hospitals. 1 694 921 labelled images from the training set and 89 238 from the validation set were then used to train a multi-label image classifier. Our algorithms were evaluated on three retrospective datasets: a set of exams sampled randomly from the full NHS dataset reported during clinical practice and annotated using NLP (n=103 328); a consensus set sampled from all six hospitals annotated by three expert radiologists (two independent annotators for each image and a third consultant to facilitate disagreement resolution) under research conditions (n=1427); and an independent dataset, MIMIC-CXR, consisting of NLP-annotated exams (n=252 374)."}]}, {"#name": "abstract-sec", "$": {"id": "ceabs30", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cestitle40"}, "_": "Findings"}, {"#name": "simple-para", "$": {"id": "spara140", "view": "all"}, "_": "X-Raydar achieved a mean AUC of 0·919 (SD 0·039) on the auto-labelled set, 0·864 (0·102) on the consensus set, and 0·842 (0·074) on the MIMIC-CXR test, demonstrating similar performance to the historic clinical radiologist reporters, as assessed on the consensus set, for multiple clinically important findings, including pneumothorax, parenchymal opacification, and parenchymal mass or nodules. On the consensus set, X-Raydar outperformed historical reporter balanced accuracy with significance on 27 of 37 findings, was non-inferior on nine, and inferior on one finding, resulting in an average improvement of 13·3% (SD 13·1) to 0·763 (0·110), including a mean 5·6% (13·2) improvement in critical findings to 0·826 (0·119)."}]}, {"#name": "abstract-sec", "$": {"id": "ceabs40", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cestitle50"}, "_": "Interpretation"}, {"#name": "simple-para", "$": {"id": "spara150", "view": "all"}, "_": "Our study shows that automated classification of chest x-rays under a comprehensive taxonomy can achieve performance levels similar to those of historical reporters and exhibit robust generalisation to external data. The open-sourced neural networks can serve as foundation models for further research and are freely available to the research community."}]}, {"#name": "abstract-sec", "$": {"id": "ceabs50", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cestitle60"}, "_": "Funding"}, {"#name": "simple-para", "$": {"id": "spara160", "view": "all"}, "_": "Wellcome Trust."}]}]}]}}