{"pii": "S2590005622000078", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e2816"}, "$$": [{"#name": "section-title", "$": {"id": "d1e2817"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e2819"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e2820"}, "_": "Future 6G wireless communication systems are expected to feature intelligence and automation. Knowledge-defined networking (KDN) is an evolutionary step toward autonomous and self-driving networks. The building blocks of the KDN paradigm in achieving self-driving networks are software-defined networking (SDN), packet-level network telemetry, and machine learning (ML). The KDN paradigm intends to integrate intelligence to manage and control networks automatically. In this study, we first introduce the disadvantages of current network technologies. Then, the KDN and associated technologies are explored with three possible KDN architectures for heterogeneous wireless networks. Furthermore, a thorough investigation of recent survey studies on different wireless network applications was conducted. The aim is to identify and review suitable ML-based studies for KDN-based wireless cellular networks. These applications are categorized as resource management, network management, mobility management, and localization. Resource management applications can be further classified as spectrum allocation, power management, quality-of-service (QoS), base station (BS) switching, cache, and backhaul management. Within network management configurations, routing strategies, clustering, user/BS association, traffic classification, and data aggregation were investigated. Applications in mobility management include user mobility prediction and handover management. To improve the accuracy of positioning in indoor environments, localization techniques were discussed. We classify existing research into the respective KDN architecture and identify how the knowledge obtained will enhance future networks; as a result, researchers can extend their work to empower intelligence and self-organization in the network using the KDN paradigm. Finally, the requirements, motivations, applications, challenges, and open issues are presented."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e2822"}, "$$": [{"#name": "section-title", "$": {"id": "d1e2823"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e2825"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e2826"}, "$$": [{"#name": "list", "$": {"id": "d1e2828"}, "$$": [{"#name": "list-item", "$": {"id": "d1e2829"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e2832"}, "_": "Providing a comprehensive overview of the ML-based studies to enable knowledge-defined networking (KDN)."}]}, {"#name": "list-item", "$": {"id": "d1e2834"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e2837"}, "_": "A complete demonstration of the main building blocks of KDN and possible architecture, future work, challenges, and associated conditions."}]}, {"#name": "list-item", "$": {"id": "d1e2839"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e2842"}, "_": "Explanation about the shortcomings of future wireless cellular networks and the advantages of KDN."}]}, {"#name": "list-item", "$": {"id": "d1e2844"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e2847"}, "_": "Introduction to network automaton and self-driving networks."}]}]}]}]}]}]}}