{"pii": "S2590346223001566", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Jasmonates (JAs) are plant hormones with crucial roles in development and stress resilience. They activate MYC transcription factors by mediating the proteolysis of MYC inhibitors called JAZ proteins. In the absence of JA, JAZ proteins bind and inhibit MYC through the assembly of MYC–JAZ–Novel Interactor of JAZ (NINJA)–TPL repressor complexes. However, JAZ and NINJA are predicted to be largely intrinsically unstructured, which has precluded their experimental structure determination. Through a combination of biochemical, mutational, and biophysical analyses and AlphaFold-derived ColabFold modeling, we characterized JAZ–JAZ and JAZ–NINJA interactions and generated models with detailed, high-confidence domain interfaces. We demonstrate that JAZ, NINJA, and MYC interface domains are dynamic in isolation and become stabilized in a stepwise order upon complex assembly. By contrast, most JAZ and NINJA regions outside of the interfaces remain highly dynamic and cannot be modeled in a single conformation. Our data indicate that the small JAZ Zinc finger expressed in Inflorescence Meristem (ZIM) motif mediates JAZ–JAZ and JAZ–NINJA interactions through separate surfaces, and our data further suggest that NINJA modulates JAZ dimerization. This study advances our understanding of JA signaling by providing insights into the dynamics, interactions, and structure of the JAZ–NINJA core of the JA repressor complex."}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0015", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "JAZ and NINJA are largely intrinsically unstructured components of jasmonate repressor complexes. Using a combination of AlphaFold-derived modeling and biochemical and biophysical experiments, this study provides insights into the structure, dynamics, and function of their domain interfaces."}]}]}]}}