{"pii": "S2590123024001944", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "In a wireless communication chain, filters play a critical role in ensuring the efficiency, reliability, and overall performance of the system. In fact, filters are essential for selecting specific frequency bands. They can narrow or widen the bandwidth, depending on the requirements of the communication protocol. Appropriate bandwidth management is crucial for optimizing data transmission rates and accommodating multiple channels within the available spectrum. This article describes the design of a compact bandpass filter with two identical rectangular open-loop resonators. The proposed filter frequency response covers the 3.5 GHz global interoperability for microwave access (WiMAX) and fifth generation (5G) applications. The structure of this filter uses the Rogers RO6010 substrate, which has a dielectric constant of 10.2, thickness of 1.27 mm, and tangent loss of 0.0023. The proposed device is intended for wireless communication systems operating at 3.5 GHz. The filter offers a wide bandwidth of 1.21 GHz with a small size of (5.72 × 12.34) mm"}, {"#name": "sup", "$": {"loc": "post"}, "_": "2"}, {"#name": "__text__", "_": ", and a low insertion loss of −0.16 dB. The suggested filter offers effective utilization across various applications including fifth-generation (5G), sub-6G, and WiMAX. Simulation and optimization of the proposed design are conducted utilizing the HFSS (High Frequency Structure Simulator) software. To corroborate the results from HFSS, the ADS (Advanced Design System) software is employed. The simulation outcomes obtained from both HFSS and ADS simulators demonstrate close resemblance."}]}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "This article describes the design and optimization of a small microstrip band-pass filter for wireless communication systems like WiMAX that operate at 3.5 GHz and 5G applications."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The proposed band pass filter has very good performance in terms of return loss and insertion loss, as well as a high degree of selectivity within the interest band."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The proposed band-pass filter has a simpler structure: the architecture of the suggested filter is based on two rectangular open-loops. As a consequence, manufacturing the specified structure with microstrip technology is easy and economical."}]}]}]}]}]}]}}