{"pii": "S2590123024009861", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The inefficiency of maintaining static and long-lasting safety zones in environments where actual risks are limited is likely to increase in the coming decades, as autonomous systems become more common and human workers fewer in numbers. Nevertheless, an uncompromising approach to safety remains paramount, requiring the introduction of novel methods that are simultaneously more flexible and capable of delivering the same level of protection against potentially hazardous situations. We present such a method to create dynamic safety zones, the boundaries of which can be redrawn in real-time, taking into account explicit positioning data when available and using conservative extrapolation from last known location when information is missing or unreliable. Simulation and statistical methods were used to investigate performance gains compared to static safety zones. The use of a more advanced probabilistic framework to further improve flexibility is also discussed, although its implementation would not offer the same level of protection and is currently not recommended."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Static safety zones are a drag on productivity when the associated precautions become redundant due to changing circumstances."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Dynamic and/or probabilistic safety zone boundaries provide an attractive solution when specific conditions are met."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "A method to measure efficiency gains to be expected in a specific region of the parameters space is presented and tested."}]}]}]}]}]}]}}