{"pii": "S2590061724000371", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0005", "lang": "en", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0135", "view": "all"}, "_": "Seismology is among the ancient sciences that concentrate on earthquake disaster management (EQDM), which directly impact human life and infrastructure resilience. Such a pivot has made use of contemporary technologies. Nevertheless, there is a need for more reliable and insightful solutions to tackle the daily challenges and intricacies of the natural sciences that stakeholders must confront. To consolidate the substantial endeavors in this field, we undertake a comprehensive survey of the interconnected contemporary technologies. More particularly, we analyze the data communication networks (DCNs) and the Internet of Things (IoT), which are among the main infrastructures of seismic networks. In accordance, we present conventional and innovative signal-processing techniques in seismology. Then, we shed light on the evolution of EQ sensors including the acoustic sensors based on optical fibers. Furthermore, we address the role of remote sensing (RS), robots, and drones for EQDM. Afterward, we highlight the social media contribution. Subsequently, a comprehensive elucidation of the diverse optimization techniques employed in seismology and for prolonging seismic networks is presented. Besides, the paper analyzes the important functions that artificial intelligence (AI) can fulfill in several areas of seismology. Lastly, we guide stakeholders on how to prevent natural disasters and preserve human lives."}]}]}, {"#name": "abstract", "$": {"id": "ab0010", "class": "author-highlights", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0140", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "li0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Introduction to Seismology: It focuses on earthquake disaster management (EQDM), affecting human life and infrastructure."}]}, {"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Technological Advances in EQDM: Research incorporates contemporary technologies, e.g., IoT, to develop reliable solutions."}]}, {"#name": "list-item", "$": {"id": "li0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Comprehensive Survey: In-depth analysis of IoT, data communication networks (DCNs), and signal processing in seismology."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Role of Remote Sensing, Robots, and Drones: Exploration of how remote sensing, robots, and drones contribute to EQDM."}]}, {"#name": "list-item", "$": {"id": "li0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Social Media, IoT, and AI in EQDM: Emphasis on the crucial roles of social media, IoT, and AI in enhancing EQDM strategies."}]}]}]}]}]}]}}