{"pii": "S2590123024012593", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "id": "ab0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0310", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ls0150"}, "$$": [{"#name": "list-item", "$": {"id": "li0360"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0360", "view": "all"}, "_": "The comprehensive study has been done on the blackout phenomena observed in Pakistan."}]}, {"#name": "list-item", "$": {"id": "li0370"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0370", "view": "all"}, "_": "Different solutions are proposed to reduce power outages and fulfill the consumer's requirements."}]}, {"#name": "list-item", "$": {"id": "li0380"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0380", "view": "all"}, "_": "Cutting-edge storage solutions have been proposed to avoid blackouts in Pakistan's Power Infrastructure."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "ab0020", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0320", "view": "all"}, "_": "Power systems are the most complicated networks that play a crucial role in daily lifestyles. To operate such systems in a stable condition, several control and protection strategies are required. Despite preventative measures, power systems still experience issues and breakdowns like power outages. However, severe and unanticipated conditions might cause damage to the entire system and causes blackout. In this article we studied the analysis of the significant blackouts and cascading failures that have been happened in Pakistan in last few years. The authors proposed a new infrastructure for Pakistan energy sector by introducing advanced energy storage system and cutting edge technology like Vehicle-to-Grid (V2G) technology that make the existing power system robust against these phenomena. The advanced energy storage systems include like solid- state batteries that play a vital role to balance supply and demand, while V2G enables electric vehicles to contribute to grid stability. The potential of these technologies is helpful to improve the grid stability and facilitate a sustainable energy transition. The role of various electric companies in Pakistan power infrastructure has also been discussed after an occurrence of such unplanned events in power system. It has been noted that the main cause of power outages is fluctuation in frequency and voltage collapse. Finally, various solutions have been proposed to overcome these problems and make sure the reliability and stability of power grid against blackout phenomena."}]}]}]}}