{"pii": "S2590198221002402", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e465"}, "$$": [{"#name": "section-title", "$": {"id": "d1e466"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e468"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e469"}, "_": "In urban planning and design, a holistic perspective is needed to examine multiple potential scenarios in future developing plans. Access (or accessibility) is a concept that measures the performance of a city in terms of how easily residents can reach their desired activities. The land use pattern and the transport network configuration are the two critical elements of spatial access measures. This study investigates whether access-oriented design can improve accessibility outcomes, and disentangles access benefits from network design and land use patterns. A generic superblock with two types of street network design is defined, and populated with two different land use allocation strategies. Local access is measured from transit stops. Furthermore, to test the hypothesis at a larger scale, the Liverpool LGA in Sydney is selected, and different combinations of land use pattern and network topology are tested. Results indicate that the land use pattern plays a vital role in the local access; however, the network configuration significantly impacts the access at the regional scale. The application of access-oriented designs in future urban growth is discussed."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e471"}, "$$": [{"#name": "section-title", "$": {"id": "d1e472"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e474"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e475"}, "$$": [{"#name": "list", "$": {"id": "d1e477"}, "$$": [{"#name": "list-item", "$": {"id": "d1e478"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e481"}, "_": "The land use pattern and the transport network configuration are the two critical elements of spatial access measures."}]}, {"#name": "list-item", "$": {"id": "d1e483"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e486"}, "_": "Changes in the activity distribution have higher impacts on local access than changing transport networks."}]}, {"#name": "list-item", "$": {"id": "d1e488"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e491"}, "_": "Changing the land use and network at the same time increases the access significantly."}]}, {"#name": "list-item", "$": {"id": "d1e493"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e496"}, "_": "There is a hierarchy in the gain of access and pyramid-ring-radial has the highest access at the local and regional area."}]}]}]}]}]}]}}