{"pii": "S2590197424000119", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Rocks formed during different geologic time record the diverse evolution of the geosphere and biosphere. In the past decades, substantial geoscience data have been made open access, providing invaluable resources for studying the stratigraphy in different regions and at different scales. However, many open datasets have information recorded in natural language with heterogeneous terminologies, short of efficient approaches to analyze them. In this research, we constructed a hybrid Stratigraphic Knowledge Graph (StraKG) to help address this challenge. StraKG has two layers, a simple schema layer and a rich instance layer. For the schemas, we used a short but functional list of classes and relationships, and then incorporated community-recognized terminologies from geological dictionaries. For the instances, we used natural language processing techniques to analyze open text data and obtained massive records, such as rocks and spatial locations. The nodes in the two layers were associated to establish a consistent structure of stratigraphic knowledge. To verify the functionality of StraKG, we applied it to the Baidu encyclopedia, the largest online Chinese encyclopedia. Three experiments were implemented on the topics of stratigraphic correlation, spatial distribution of ophiolite in China, and spatio-temporal distribution of open lithostratigraphic data. The results show that StraKG can provide strong knowledge reference for stratigraphic studies. Used together with data exploration and data mining methods, StraKG illustrates a new approach to analyze the open and big text data in geoscience."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Built the Stratigraphic Knowledge Graph with both domain expertise and open data."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Used BERT model to extract strata and rock records and relationships from open text."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Demonstrated the utility of the built knowledge graph with several experiments."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Other geoscience disciplines can adapt the approach to explore open text data."}]}]}]}]}]}]}}