{"pii": "S2590123024006649", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0080", "view": "all"}, "_": "The rapid growth of the massive smart Internet of Things (IoT) with mobile connections, the enhanced Mobile Broadband (eMBB) and the high demand for building a connected and intelligent world increase the probability of mobile satellite systems to be a major network in providing internet communication services in the future. Currently, the mobile satellite systems are envisioned as a significant solution for providing mobile services in different settings and for various vital objectives. These satellite systems have special qualities in each of these situations, including extensive coverage area, robustness, and ability to broadcast/multicast. The Low Earth Orbit (LEO) systems are the best promising technology that will offer internet services among the different types of satellite systems. However, the LEO systems are still experiencing certain restrictions with respect to connectivity, stability, and mobility support; because of which communication becomes unreliable. Therefore, the aim of this paper is to broadly explain the LEO systems and services in a comprehensive manner using a variety of perspectives. The paper focus is on key aspects of mobile internet based on satellite systems. This paper illustrates the integration of LEO systems with fifth and sixth generations of mobile cellular networks as well as with the IoT networks. It discusses the problems being faced as a result of the integration between cellular with IoT and satellite systems by comprehending which future research plans are outlined."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "ab0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0090", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ls0010"}, "$$": [{"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0010", "view": "all"}, "_": "Rapid growth of IoT with mobile connections and eMBB fuels the potential of MSS for future internet communication services."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0020", "view": "all"}, "_": "Mobile satellite systems currently viewed as a significant solution for diverse mobile services in various settings."}]}, {"#name": "list-item", "$": {"id": "li0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0030", "view": "all"}, "_": "Special qualities of satellite systems highlighted, including extensive coverage, robustness and broadcast/multicast."}]}, {"#name": "list-item", "$": {"id": "li0040"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0040", "view": "all"}, "_": "LEO systems identified as the most promising technology for offering internet services among different satellite systems."}]}, {"#name": "list-item", "$": {"id": "li0060"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0060", "view": "all"}, "_": "Our paper's objective: explain LEO systems comprehensively from various perspectives."}]}]}]}]}]}]}}