{"pii": "S2590123023006229", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "In recent years, with the transformation of China's economy and social development, solving rural problems and achieving rural revitalization has become an urgent task. The development of information technology, specifically the advancements in deep learning technology, has provided new solutions for rural revitalization. This article aims to optimize the spatial structure of rural residential areas and investigate models for optimizing spatial design layouts within the context of rural revitalization utilizing deep learning techniques, specifically convolutional neural networks (DeepLab v3+). This article conducts in-depth research on the DeepLab v3+model and finds that it has good feature extraction ability in processing spatial information such as rural residential houses and ancillary land. By introducing an attention mechanism in the encoding region, we improved the feature extraction accuracy of the model. On the ImageNet and CoCo2017 datasets, the accuracy indicators PA, IoU, and F1 of the DeepLab v3+model performed well, reaching 98.25 %, 75.61 %, and 86.49 %, as well as 98.31 %, 74.91 %, and 85.49 %, respectively. Furthermore, it was discovered that as the training frequency approached 20, both ResNet50 and DeepLab v3-SE exhibited a generalization accuracy of 86.83 % and 89.26 %, correspondingly. This shows the effectiveness of our model in acquiring and utilizing knowledge during the training. The study further investigated the performance of the model in processing images with noise. When the noise standard deviation is 25, the mean SSIM of the O-DeepLab v3+network reaches 0.943, which is 0.53 % and 1.95 % higher than the DeepLab v3-SE network and traditional DeepLab v3+network, respectively. When the noise standard deviation is 50, the SSIM mean of the O-DeepLab v3+network reaches 0.82, which is 0.61 % and 1.49 % higher than the DeepLab v3-SE network and traditional DeepLab v3+network, respectively. This suggests that our model exhibits robustness when processing noisy images. In summary, the spatial design layout optimization model based on deep learning in the context of rural revitalization studied in this article has high accuracy and stability in processing spatial information such as rural residential houses and ancillary land. This is of great significance for optimizing rural land use, promoting urban-rural land allocation, and achieving rural revitalization. Therefore, this study has certain application value."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Crucial rural revitalization in evolving China for societal challenges."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "A deep learning model optimizes rural residential spatial structure for revitalization."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The model uses CNN DeepLab v3+ with attention mechanism for enhanced feature extraction."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "DeepLab v3+ excels on ImageNet and CoCo2017, with high accuracy metrics. ResNet50 and DeepLab."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "v3-SE also exhibit improved generalization, highlighting their practicality in rural revitalization."}]}]}]}]}]}]}}