{"pii": "S2590005622000170", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "As people are accustomed to the popularization of information services, immersive experiences are emphasized, which drives the vigorous development of virtual reality. In practice, devices are limited by their computing capabilities and rely on cloud computing to complete the overall service provided. As a result, technologies of the Internet of Things (IoT) emerge to respond to this demand. As an ideal IoT, in addition to lightweight, it is ideally to possess the following features: easy installation of devices, intelligent networking capability, multi-field equipment sharing, and customizable to meet various needs. However, most of the current IoTs are “Internet of Targets” rather than “Internet of Things”. The Internet of Targets is lacking interoperability because of incompatible communication protocols and interface features among a variety of “devices” leading to different barriers thus hindering its applicability. This research task proposes two new ideas-refactor and feedback. The former meant that the system is able to change transmission path intelligently. The later enables the system reacts and acts appropriately in real time when receiving a stimulation. On the basis of the two factors we construct a conscious system served as the core of the “ideal IoT”. For the practical operating framework, we build a service model that integrates different data formations with feedback. We demonstrate the presented design by realizing a compact IoT system for long-term health care."}]}]}]}}