{"pii": "S2590198221001081", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "id": "ab005", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "l0005"}, "$$": [{"#name": "list-item", "$": {"id": "o0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Uses interpretable features to condense large volumes of vehicle trajectory data into standard data analytics format for the use by general-purpose machine learning algorithms."}]}, {"#name": "list-item", "$": {"id": "o0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Conducts an empirical study using Statewide truck trajectory data and provides preliminary policy and investment implications."}]}, {"#name": "list-item", "$": {"id": "o0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "The approach facilitates the documentation of a data-heavy project, where the interation of structured data and unstructure human knowledge and expertise is required."}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "author", "id": "ab010", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "We propose a workflow for trajectory data mining jointly using well-tested (as opposed to "}, {"#name": "italic", "_": "ad hoc"}, {"#name": "__text__", "_": ") machine learning algorithms and unstructured local knowledge of experts and decision-makers, a common requirement in public agencies and consulting businesses. The key step of the workflow is to condense vehicle trajectory data into an analytics base table (ABT) using a set of features so that general-purpose data mining algorithms can be utilized. The case study extracts context-dependent features from high-frequency truck trajectory data from the State of Texas for analyzing patterns of truck parking in the Statewide highway system and for deriving implications for truck parking regulations and investment decisions. The results show that the approach is suitable for time-efficient implementation and provides valuable inputs for applications related to truck parking studies. This paper does not focus on the deeper understanding of the data in the case study; instead, it focuses on demonstrating how the proposed feature-oriented workflow eases the handling of high-volume trajectory data and improves the trackability of the decision process where data mining algorithms and human expertise interact significantly."}]}]}]}]}}