{"pii": "S2590332224001386", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Summary"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Biodiversity is declining rapidly. The most important causes of biodiversity loss are climate change, land- and sea-use change, invasive alien species, pollution, and overexploitation of natural resources. This unprecedented deterioration of the biosphere has profound and far-reaching consequences for insects, who play many important roles within ecosystems, including pollination and decomposition. Declines in the abundance and distribution of insects threaten these essential ecosystem functions. While there is no doubt that urgent and immediate measures are needed to address biodiversity loss and climate change, monitoring of insects is a priority to underpin and inform ongoing conservation action. Citizen science has emerged as an important tool for monitoring insects. In this primer, we explain the application of citizen science for monitoring insects and emerging approaches using digital technologies."}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0015", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "Biodiversity is declining rapidly. The most important causes of biodiversity loss are climate change, land- and sea-use change, invasive alien species, pollution, and overexploitation of natural resources. This unprecedented deterioration of the biosphere has profound and far-reaching consequences for insects, who play many important roles within ecosystems including pollination and decomposition. Declines in the abundance and distribution of insects threaten these essential ecosystem functions. While there is no doubt that urgent and immediate measures are needed to address biodiversity loss and climate change, monitoring of insects is a priority to underpin and inform ongoing conservation action. Citizen science has emerged as an important tool for monitoring insects. In this primer, we explain the application of citizen science for monitoring insects and emerging approaches using digital technologies."}]}]}]}}