{"pii": "S2590346223001037", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Verbascoside, which was first discovered in 1963, is a well-known phenylethanoid glycoside (PhG) that exhibits antioxidant, anti-inflammatory, antimicrobial, and neuroprotective activities and contributes to the therapeutic effects of many medicinal plants. However, the biosynthetic pathway of verbascoside remains to be fully elucidated. Here, we report the identification of two missing enzymes in the verbascoside biosynthesis pathway by transcriptome mining and "}, {"#name": "italic", "_": "in vitro"}, {"#name": "__text__", "_": " enzymatic assays. Specifically, a BAHD acyltransferase (hydroxycinnamoyl-CoA:salidroside hydroxycinnamoyltransferase [SHCT]) was shown to catalyze the regioselective acylation of salidroside to form osmanthuside A, and a CYP98 hydroxylase (osmanthuside B 3,3′-hydroxylase [OBH]) was shown to catalyze "}, {"#name": "italic", "_": "meta"}, {"#name": "__text__", "_": "-hydroxylations of the "}, {"#name": "italic", "_": "p"}, {"#name": "__text__", "_": "-coumaroyl and tyrosol moieties of osmanthuside B to complete the biosynthesis of verbascoside. Because SHCTs and OBHs are found in many Lamiales species that produce verbascoside, this pathway may be general. The findings from the study provide novel insights into the formation of caffeoyl and hydroxytyrosol moieties in natural product biosynthetic pathways. In addition, with the newly acquired enzymes, we achieved heterologous production of osmanthuside B, verbascoside, and ligupurpuroside B in "}, {"#name": "italic", "_": "Escherichia coli"}, {"#name": "__text__", "_": "; this work lays a foundation for sustainable production of verbascoside and other PhGs in micro-organisms."}]}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0015", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "__text__", "_": "This study reports the identification of a BAHD acyltransferase (SHCT) that mediates the regioselective acylation of salidroside to form osmanthuside A and a CYP98 hydroxylase that catalyzes meta-hydroxylations of osmanthuside B to complete the biosynthesis of verbascoside. The heterologous production of verbascoside in "}, {"#name": "italic", "_": "Escherichia coli"}, {"#name": "__text__", "_": " from renewable carbon resources was also achieved."}]}]}]}]}}