{"pii": "S2590136224000755", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st010"}, "_": "Background and aims"}, {"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The Rotavirus vaccine (RVV) introduction is a landmark event in the history of Indian public health as for the first time a novel, low-cost indigenous vaccine was introduced in a short timeline between 2016 and 2019. As per WHO mandate, post-introduction evaluation (PIE) be conducted within 6 to 12 months of vaccine introduction to provide an understanding of the operational aspects of the program. For RVV PIE, an innovative approach to developing and deploying a digitized tool was employed. The present study aims to document the processes followed for digitizing the data collection and analysis tools."}]}, {"#name": "abstract-sec", "$": {"id": "as010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st015"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "sp0010", "view": "all"}, "_": "The development of the RVV-PIE digital tool was undertaken in two phases. In the first phase, conceptualization and iteration of the modified WHO PIE tool were undertaken. Questions were organized sequentially to ensure natural progression in responses. The finalized questionnaire was converted to a digital version and extensive dummy data was entered to improve automated qualitative data analysis. Phase 2 involved updating the draft tool and incorporating changes to provide a field-tested version for deployment."}]}, {"#name": "abstract-sec", "$": {"id": "as015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st020"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "sp0015", "view": "all"}, "_": "The digital version of the tool was successfully developed. The GPS functionality of the tool allowed live tracking of data collection making the process more accountable. The tool was prepopulated with reference materials and data points for easy reference and retrieval by the evaluators. The digitization of the tool also allowed easy visualization of data through maps, charts, and graphs on a real-time user-friendly dashboard."}]}, {"#name": "abstract-sec", "$": {"id": "as020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st025"}, "_": "Conclusions"}, {"#name": "simple-para", "$": {"id": "sp0020", "view": "all"}, "_": "The digitization of the PIE tool for RVV in India has been a great learning experience where the dire situation of an ongoing pandemic catapulted us towards a more efficient and comprehensive process innovation. The RVV PIE tool could serve as a customizable digital PIE tool for other health programs heralding an era of a more effective and proficient process of PIE."}]}]}]}}