{"pii": "S2665917424001582", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "The realm of sports and physical exercise is abuzz with a plethora of opinions, ranging from enthusiastic support to disheartening criticism. Delving into this sea of sentiment can be quite challenging due to the vastness and complexity of the data. This study proposes a novel approach that combines the power of dimensionality reduction with conventional machine learning techniques to effectively analyze sentiment in sports and exercise-related texts. We have encountered that the emotions regarding sports and exercise have been flooded because of the lockdown conditions and machines are not trained to analyze these emotions. The objective of this analysis is to enhance the accuracy of sentiment classification, enabling machines to better understand the nuances of human emotions expressed in sports and exercise contexts. Our experiments demonstrate that the proposed Dimensionality Reduction-Enhanced Machine Learning approach outperforms traditional methods in identifying the sentiment in sports and exercise-related texts. This technique achieves a significant improvement in weighted F1-score of 5 %, indicating a more precise and reliable sentiment classification. Among the conventional machine learning algorithms employed, Naïve Bayes, Support Vector Machines (SVM), Logistic Regression & Artificial neural network emerged as the most effective methods, achieving a weighted F1-score of respectively 0.92,0.925, 0.935, and 0.91. This study paves the way for a deeper understanding of public opinion during pandemic times and their effect on sports and physical exercise, enabling organizations and individuals to make informed decisions regarding marketing strategies, program development, and community engagement. The ability to accurately discern sentiment from a vast array of sports and exercise-related texts holds immense potential for fostering a more engaged and inclusive sporting landscape."}]}]}]}}