{"pii": "S2667345223000263", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "This study introduces a novel flood monitoring and warning system (FMWS) that leverages the capabilities of long-range wide area networks (LoRaWAN) to maintain extensive network connectivity, consume minimal power, and utilize low data transmission rates. We developed a new algorithm to measure and monitor flood levels and rate changes effectively. The innovative, cost-effective, and user-friendly FMWS employs an HC-SR04 ultrasonic sensor with an Arduino microcontroller to measure flood levels and determine their status. Real-time data regarding flood levels and associated risk levels (safe, alert, cautious, or dangerous) are updated on The Things Network and integrated into TagoIO and ThingSpeak IoT platforms through a custom-built LoRaWAN gateway. The solar-powered system functions as a stand-alone beacon, notifying individuals and authorities of changing conditions. Consequently, the proposed LoRaWAN-based FMWS gathers information from catchment areas according to water level risks, triggering early flood warnings and sending them to authorities and residents via the mobile application and multiple web-based dashboards for proactive measures. The system's effectiveness and functionality are demonstrated through real-life implementation. Additionally, we evaluated the performance of the LoRa/LoRaWAN communication interface in terms of RSSI, SNR, PDR, and delay for two spreading factors (SF7 and SF12). The system's design allows for future expansion, enabling simultaneous data reporting from multiple sensor monitoring units to a server via a central gateway as a network."}]}]}]}}