{"pii": "S2666351123000323", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e4223", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e4224"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e4226", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e4227", "view": "all"}, "_": "The effectiveness and dependability of network communication within the Internet of Things (IoT) depends on the energy-harvesting capabilities of IoT sensors. It is imperative to efficiently handle energy resources to fulfill computational requirements, ensuring optimal performance and continuous operation of IoT sensors across various applications. This investigation examines the challenges associated with energy harvesting in commonly used IoT sensors and their corresponding communication technologies. This encompasses wireless communication, cyber–physical systems (CPS), machine-to-gateway communication (M2G), wireless power transmission (WPT), and IoT infrastructure and protocols such as IPv6, 6LoWPAN, MQTT, CoAP. Furthermore, the study explores routing algorithms within the IoT network context, recognizing their crucial role in addressing challenges related to sensor battery lifespan and energy conservation. Challenges in energy resource management, which include considerations of sensor types, spatial relationships, and connection stability, are also discussed. The study investigates the energy consumption of different types of connections in an IoT network during data transfer, considering factors such as jitter, packet loss, overhead, congestion, distance between nodes, network protocol (MQTT), and data size (32MB). Two scenarios are explored: one where the minimum frequency band and data rate are fixed, revealing that Sigfox consumes more energy than others, while Bluetooth v5.0 is more energy-efficient; and another where the maximum frequency band and data size are fixed, showing that 5G consumes more energy, whereas NB-IoT is more energy-efficient. Finally, the research investigates the energy consumption increments for various network connections (2G, 3G, 4G, 5G, Bluetooth V5.0, Sigfox, WiMAX, LoRaWAN, Zigbee, and NB-IoT) as the frequency band and network data rate increase from minimum to maximum values, revealing increments within the range of 7% to 71%."}]}]}]}}