{"pii": "S2666720724000213", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e560", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e561"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e563", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e564", "view": "all"}, "_": "The forthcoming era of industrialization is marked by intelligent production, with the manufacturing industry and the Industrial Internet of Things (IIoT) driving the creation and innovation of new concepts and systems. One innovative solution addressing the demands of industrial settings is the time-slotted channel hopping (TSCH) protocol, known for its ultra-low power consumption and reliable communication. However, the scheduling mechanism at the core of TSCH requires substantial time for every node. In this study, we propose a sustainable scheduling method for Industrial IoT networks called Linguistic Interval Type 2 Fuzzy Logic System (LIT2FLS) based Priority Aware TSCH (LIT2FLPAS). The suggested method aims to promote service diversification to extend battery life and reduce delay. The significance of each node is determined by the LIT2FLS method, which allocates the required number of slots based on priority and the volume of generated traffic. We compare our proposed LIT2FLPAS algorithm with two state-of-the-art scheduling functions, Scheduling Function-Zero (SF0) and Low Latency Scheduling Function (LLSF). The results demonstrate that LIT2FLPAS exhibits superior adaptability compared to SF0 and LLSF. It provides collision-free communications and significantly enhances the duty cycle by 8%, battery life by 30.32%, and packet loss ratio by 95% while reducing latency by 75.69% and collisions by 91%. These findings underscore the effectiveness of the LIT2FLPAS algorithm in addressing the specific challenges of industrial IoT networks, offering improved performance metrics and robust communication in dynamic industrial environments. The proposed method presents a promising solution for achieving efficient and reliable communication in the evolving landscape of intelligent industrial production."}]}]}]}}