{"pii": "S2667305322000217", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "id": "absh001", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0001", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "lst0004"}, "$$": [{"#name": "list-item", "$": {"id": "lstitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0001", "view": "all"}, "_": "Collecting a large dataset of interior, exterior, and satellite images of houses."}]}, {"#name": "list-item", "$": {"id": "lstitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0002", "view": "all"}, "_": "A novel housing price estimation method considering interior, exterior, and satellite visual attributes of the house."}]}, {"#name": "list-item", "$": {"id": "lstitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0003", "view": "all"}, "_": "Deep convolutional neural network trained on a dataset to extract visual features of the houses and classify luxury levels."}]}, {"#name": "list-item", "$": {"id": "lstitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0004", "view": "all"}, "_": "Comparing the efficiency of the proposed method with commercial services like Zestimate."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0001", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0002", "view": "all"}, "_": "Real estate price estimation has been an interesting subject in the literature from the appearance of online real estate services like Zillow and Redfin. These websites and many other works in the literature have proposed their methods for evaluation and pricing of the real estate. However, these methods fail to consider important information about the appearance and the neighborhood of the house which leads to occasional incorrect estimations. The novel proposed method in this paper tries to estimate housing price by considering attributes of the home as well as interior, exterior, and satellite visual features of the house. Deep convolutional neural networks on a large dataset of images of interior, exterior and satellite images of houses are trained to extract visual features of the houses. These features along with house attributes are fed to another system to automatically estimate the value of the house. Finally, the performance of the system is compared to Zestimate and some vision-based methods in the literature on a new dataset."}]}]}]}}