{"pii": "S2667096824000442", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara010", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "Tackling the complex problem of enhancing restaurant customer service."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "Presenting a chatbot – Genie, utilizing advanced natural language processing techniques."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "Genie provides outstanding performance by returning the most relevant answers for intricate customer queries."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0005", "view": "all"}, "_": "Improving restaurant operations by streamlining workflows, enhancing customer service experiences, and driving financial success."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "$$": [{"#name": "small-caps", "_": "Abstract"}]}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara011", "view": "all"}, "_": "In the dynamic restaurant industry, we introduce \"Genie,\" an AI-powered chatbot, represents an advancement in customer service efficiency through technological innovation. Designed to enhance restaurant operations including order processing, reservations, and FAQs management, Genie leverages advanced Natural Language Processing (NLP) techniques. By converting input queries into word embeddings and applying a sophisticated tag classification system, Genie precisely interprets customer intents and generates accurate responses, thereby markedly improving the dining experience. Our thorough examination of various word embeddings and classifiers—Word2Vec, Glove, BERT, Gaussian Naive Bayes, XGB, Artificial Neural Networks (ANN), and Recurrent Neural Networks—revealed that the combination of Word2Vec and ANN is the most effective, achieving an impressive accuracy rate of 88.9 %. This discovery highlights Genie's capability to not only streamline restaurant operations but also enhance customer satisfaction by minimizing wait times and facilitating contactless service options. Additionally, this study enriches the understanding of AI's application in service industries and explores the potential future impact of generative AI technologies on chatbot interactions. As AI technology advances, its integration is essential for Genie to deliver increasingly personalized and dynamic customer experiences, aligning with the evolving demands of the digital era. This research emphasizes the transformative impact of AI in the restaurant industry, providing valuable insights into its practical applications and future prospects for automated customer service solutions."}]}]}]}}