{"pii": "S2665917422000800", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Edge Computing (EC) has made decisions regarding offloading tasks. Also, it might be a challenging task for a gadget of the multi-hop cause of competing network models due to the limited bandwidth available. The literature provides several studies on the issue of the multi-hop cloud environment. Moreover, partial offloading of multi-hop computing and dynamic network management leads to network problems. And inefficient performance measured in terms of task completion time has not been factored into current studies. To reduce the average finishing time of all jobs, this article proposed joint multi-task complete unloading and a network that supports the scheduling issue. Several variable decision factors such as the partial systematic ratio of offloading, Offloading remote devices, task start time, path of routing & dynamic network start time were optimized by the formulated problem. To manage tasks, we use the features inherent in multiple processors with various CPU frequencies. Under the restrictions of power & latency, we determine the appropriate quantity of task data to be handled immediately or distributed to the preferred nodes on the clouds remotely. Our objective is to solve the issue of optimization of task scheduling on a limited quasi-quadratic function. We offer an Improved Offloading and Heuristic Flow Optimization (IOHFO) solution effectively to solve these problems by using semi-definite relaxation. Finally, a simulator can be used to evaluate our proposed unloading system to reduce the (optimal) cost of unloading profiles for various parameters."}]}]}]}}