{"pii": "S266709922400001X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara024", "view": "all"}, "_": "Rhinoplasty is a popular surgical operation, so proposing trustworthy assessment methods is crucial. Previous studies often utilized traditional or non-automatic methods for rhinoplasty evaluation, overlooked the aesthetic harmony of the nose with other facial features, and provided limited descriptions of facial beauty without detailed explanations. To address these limitations, we have developed a deep learning-based system for quantitative and qualitative facial beauty assessment and rhinoplasty results based on the random preoperative and postoperative color photographs of 376 patients, differentiating male and female faces. The quantitative evaluation includes automatically extracting 3D facial key points from frontal and lateral views, developing a novel mathematical 3D facial model, applying seven criteria from rhinoplasty literature, and assigning related scores. The qualitative evaluation comprises the design of a questionnaire, the extraction of facial features using a unique CNN-based algorithm, and the assignment of scores based on the questionnaire's results. Our method calculates the success percentage of rhinoplasty and provides precise and comprehensive quantitative and qualitative beauty scores. The accuracy of the proposed facial feature extraction network is 71 %, which is considered acceptable according to the complexity of defining beauty and the novelty of this work. All procedures and outcomes are verified by an ENT (Ear, Nose, and Throat) specialist. In particular, based on the presented extensive tables and histograms, some patients have lower postoperative scores than preoperative ones in some instances, which caused negative success scores. For this reason, individuals' appearance may occasionally worsen following rhinoplasty instead of improving. Therefore, preoperative assessments of facial features are crucial, and our proposed system facilitates this process. Our research also impacts individual self-assessment and surgeons' awareness significantly."}]}]}]}}