{"pii": "S2665917424001995", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "In the context of today's information explosion, how to extract useful information from a large amount of image data and convey it to users is a challenging problem. Therefore, this study aims to achieve effective communication of image data by constructing a sensor network simulation and utilizing visual feature extraction methods. The study constructed a sensor network simulation to simulate the working principle of a biosensor system, thereby achieving perception and understanding of image data, and automatically obtaining and processing information from input images. Research on the use of visual feature extraction methods to extract features that describe the content and structure of images, and apply them to the results obtained from sensor network simulation to accurately capture important information in image data. The research aims to convey the extracted feature information to users through visual means, and present the extracted feature information to users in an intuitive graphical form, in order to gain a more intuitive understanding of the meaning and features of image data, improve the ability to understand data and analyze results. By constructing a sensor network to simulate the perception process of image data and using visual feature extraction methods to extract key feature information, this article can effectively convey this information to users through visualization methods. This method provides a new solution for the field of image data visualization communication, which helps to improve the efficiency and accuracy of data communication."}]}]}]}}