{"pii": "S2667295222000216", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0001", "view": "all"}, "$$": [{"#name": "__text__", "_": "The ability of Voice User Interface (VUI) to understand how users will express their commands naturally and intuitively is an essential component of user experience, especially when the user is interacting with the VUI for the first time. Designing an automated method for testing the usability of VUI is a challenge for two reasons. First, there are many different ways for a user to express the same intention, e.g. “"}, {"#name": "italic", "_": "play some music"}, {"#name": "__text__", "_": "”, ””"}, {"#name": "italic", "_": "put some music on"}, {"#name": "__text__", "_": "”, etc., that is difficult to determine in advance. Second, many VUI apps today typically rely on the platform service provider (e.g. Amazon, Google, etc.) to perform many of the speech recognition and natural language processing tasks, and these services are provided as a blackbox. Consequently, it is difficult for the app developer to obtain information about errors and user feedback. In this paper, we propose a framework, VORI, to systematically evaluate the interactability of VUI, as well as a new metric for quantifying the interactability of a VUI. We use VORI to analyze 127 applications on Alexa by sending over 82,931 commands. Our analysis results highlight that 41.7% of apps only accept strict input that has to exactly match the developer’s predefined sample commands with an interactability score of 20% or less. This suggests developers should consider a better interactability strategy in the design of VUIs, and more research is needed to further explore the design space to improve the interactability."}]}]}]}]}}