{"pii": "S2666247723000660", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Summary"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "Cleft palate (CP) is one of the most common craniofacial birth defects; however, there are relatively few established genetic risk factors associated with its occurrence despite high heritability. Historically, CP has been studied as a single phenotype, although it manifests across a spectrum of defects involving the hard and/or soft palate. We performed a genome-wide association study using transmission disequilibrium tests of 435 case-parent trios to evaluate broad risks for any cleft palate (ACP) (n = 435), and subtype-specific risks for any cleft soft palate (CSP), (n = 259) and any cleft hard palate (CHP) (n = 125). We identified a single genome-wide significant locus at 9q33.3 (lead SNP rs7035976, p = 4.24 × 10"}, {"#name": "sup", "$": {"loc": "post"}, "_": "−8"}, {"#name": "__text__", "_": ") associated with CHP. One gene at this locus, angiopoietin-like 2 ("}, {"#name": "italic", "_": "ANGPTL2"}, {"#name": "__text__", "_": "), plays a role in osteoblast differentiation. It is expressed both in craniofacial tissue of human embryos and developing mouse palatal shelves. We found 19 additional loci reaching suggestive significance (p < 5 × 10"}, {"#name": "sup", "$": {"loc": "post"}, "_": "−6"}, {"#name": "__text__", "_": "), of which only one overlapped between groups (chromosome 17q24.2, ACP and CSP). Odds ratios for the 20 loci were most similar across all 3 groups for SNPs associated with the ACP group, but more distinct when comparing SNPs associated with either subtype. We also found nominal evidence of replication (p < 0.05) for 22 SNPs previously associated with orofacial clefts. Our study to evaluate CP risks in the context of its subtypes and we provide newly reported associations affecting the broad risk for CP as well as evidence of subtype-specific risks."}]}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0020", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "$$": [{"#name": "__text__", "_": "Cleft palate is a common birth defect for which few genetic causes are known. Here, we identify a locus associated with cleft hard palate at 9q33.3 near "}, {"#name": "italic", "_": "ANGPTL2"}, {"#name": "__text__", "_": ", which is expressed in the developing mouse palate and plays a role in bone formation."}]}]}]}]}}