{"pii": "S2666389920300040", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Entropy is the natural tendency for decline toward disorder over time. Information entropy is the decline in data, information, and understanding that occurs after data are used and results are published. As time passes, the information slowly fades into obscurity. Data discovery is not enough to slow this process. High-quality metadata that support understanding and reuse and cross domains are a critical antidote to information entropy, particularly as it supports reuse of the data—adding to community knowledge and wisdom. Ensuring the creation and preservation of these metadata is a responsibility shared across the entire data life cycle from creation through analysis and publication to archiving and reuse. Repositories can play an important role in this process by augmenting metadata through time with persistent identifiers and connections they facilitate. Data providers need to work with repositories to encourage metadata evolution as new capabilities and connections emerge."}]}]}, {"#name": "abstract", "$": {"class": "editor-highlights", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "The Bigger Picture"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "Reusing data requires understanding, trust, and a community that values complete metadata and actively participates in the long-term knowledge building process. Participants include authors who document their data well using generic metadata standards and accessible conventions, researchers who review manuscripts and data with reuse in mind, and readers who keep an eye out for well-documented data and then use that data to build community knowledge and wisdom. Repositories play a critical active stewardship role in this process, augmenting and managing metadata that connect researchers and research objects across the community. This participation extends the data life cycle, broadens impact, and slows information entropy."}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0020", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "Are data from your published work suffering from information entropy since they were published? Are they experiencing a slow decrease in impact because other researchers cannot understand or trust them? High-quality metadata, persistent identifiers, and active repository partnerships might help revive them and ensure their role in building community understanding and wisdom."}]}]}]}}