{"pii": "S2666389922002021", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Summary"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "This article systematically investigates the technology licensing by Stanford University. We analyzed all the inventions marketed by Stanford’s Office of Technology Licensing (OTL) between 1970 to 2020, with 4,512 inventions from 6,557 inventors. We quantified how the innovation landscape at Stanford changed over time and examined factors that correlate with commercial success. We found that the most profitable inventions are predominantly licensed by inventors’ own startups, inventions have involved larger teams over time, and the proportion of female inventors has tripled over the past 25 years. We also identified linguistic features in how the inventors and OTL describe the inventions that significantly correlate with the invention’s future revenue. Interestingly, inventions with more adjectives in their abstracts have worse net income. Our study opens up a new perspective for analyzing the translation of research into practice and commercialization using large-scale computational and linguistics analysis."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Computational analysis of 4,512 inventions marketed by Stanford OTL since 1970"}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Most profitable inventions are predominantly licensed by inventors’ own startups"}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Inventions involved larger teams over time"}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Marketing abstracts predict future revenue of inventions"}]}]}]}]}]}, {"#name": "abstract", "$": {"class": "editor-highlights", "id": "abs0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0020"}, "_": "The bigger picture"}, {"#name": "abstract-sec", "$": {"id": "abssec0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "Universities play an increasingly central role in research innovations and commercialization that drive technological development and economic growth. However, in-depth data science analysis of university technology transfer is underexplored in literature because the relevant data is often unavailable. To address this gap, we collaborated with the Stanford University Office of Technology Licensing (OTL) to curate a comprehensive dataset of all 4,512 inventions marketed by the OTL between 1970 to 2020. We have detailed information about each invention together with its generated revenue and cost, which critically captures outcomes missing in previous works. Examples of technologies licensed from Stanford include PageRank, recombinant DNA, and music synthesizers. Our study opens up a new perspective for analyzing the translation of research into practice and commercialization using large-scale computational and linguistics analysis."}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0025", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0025", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "Computational analysis of 4,512 inventions marketed by Stanford’s Office of Technology Licensing between 1970 and 2020 characterizes how the academic innovation landscape has changed over time. We identified factors, such as the composition of the inventors, associated with the commercial success of the inventions. We also identified linguistic differences in how high- and low-revenue inventions in the same field are described and marketed."}]}]}]}}