{"pii": "S2666592123000033", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Consideration of occasional loads attributed to events like wind and earthquakes serves as a major design practice in the pipeline engineering field. Numerous methods and approaches previously developed model or categorize such loads as either quasi-static or dynamic. This paper focuses on the provision of a systematic methodology for pipeline flexibility analysis under the presence of wind and earthquake loads. Emphasis is laid on outlining the scheme for insertion of necessary rest supports and guide restraints to withstand the occasional load effects. A novel analytical formulation was first developed, yielding an optimum range of span distance between adjacent rest supports. This derivation examined the underlying contributions from all persisting loading conditions, i.e., weight, pressure, temperature, wind, and earthquake. The computed span range was then verified through a sensitivity analysis study utilizing CAESAR II software simulation. A second sensitivity analysis was further numerically performed to determine the optimal layout of guide restraints. The resulting support-restraint configuration was then comprehensively assessed based on the allowable pipeline displacements, stresses, reaction loads and nozzle forces. These permissible limits were referenced from the design recommendations of ASME B31.4 code and other standard industrial practices. The proposed approach and analytical framework can be readily adapted for any linear pipeline system under seismic and wind loads influence. Moreover, the presented flexibility evaluation technique can serve to further elucidate and expedite the pipeline analysis activity."}]}]}]}}