{"pii": "S2667305323001102", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0150", "view": "all"}, "_": "Automation of incoming invoices processing promises to yield vast efficiency improvements in accounting. Until a universal adoption of fully electronic invoice exchange formats has been achieved, machine learning can help bridge the adoption gaps in electronic invoicing by extracting structured information from unstructured invoice formats. Machine learning especially helps the processing of invoices of suppliers who only send invoices infrequently, as the models are able to capture the semantic and visual cues of invoices and generalize them to previously unknown invoice layouts. Since the population of invoices in many companies is skewed toward a few frequent suppliers and their layouts, this research examines the effects of training data taken from such populations on the predictive quality of different machine-learning approaches for the extraction of information from invoices. Comparing the different approaches, we find that they are affected to varying degrees by skewed layout populations: The accuracy gap between in-sample and out-of-sample layouts is much higher in the Chargrid and random forest models than in the LayoutLM transformer model, which also exhibits the best overall predictive quality. To arrive at this finding, we designed and implemented a research pipeline that pays special attention to the distribution of layouts in the splitting of data and the evaluation of the models."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "ab0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0160", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ls0010"}, "$$": [{"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0010", "view": "all"}, "_": "In most companies, the number of received invoices are skewed toward a few vendors."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0020", "view": "all"}, "_": "Models trained from such corpora favor invoices from highly recurrent vendors."}]}, {"#name": "list-item", "$": {"id": "li0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0030", "view": "all"}, "_": "The magnitude of this bias varies across different models."}]}, {"#name": "list-item", "$": {"id": "li0040"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0040", "view": "all"}, "_": "We implement a methodology to account for this bias in the evaluation of models."}]}]}]}]}]}]}}