{"pii": "S2666165924000358", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Given the high demand in South Korea, apartments, constituting 78% of residential projects, have witnessed substantial construction. This growth has coincided with an increase in defects appearing throughout the life cycle of construction projects, frequently becoming a central factor in the escalating disputes between general contractors and occupants. Some defects only surface during occupancy, underscoring the need to address and fulfill occupant requirements during the repairing, given their dissatisfaction can fuel such disputes. Post-occupancy evaluation (POE) offers valuable feedback yet is often subjective, influenced by the perspectives of companies and managers, potentially failing to capture user experiences accurately. The development of POE concerning the construction defect repair service has not been paid attention to, for newly constructed apartments. To overcome these challenges, this paper introduces a Latent Dirichlet Allocation (LDA)-based framework for identifying evaluation metrics, enabling the development of a POE process for construction defect repair services in newly constructed apartments. As a result, “repeated construction”, “rapid response”, “promised fulfillment”, “punctuality”, “defect processing”, and “services and finishing” are identified as key evaluation metrics. Besides enhancing the serviceability of construction defect repair services, the proposed methodology offers the means to continuously monitor occupant experiences and preferences across varying times and regions."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "A Latent Dirichlet Allocation (LDA)-based framework was developed for identifying evaluation metrics in defect services."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The Post-Occupancy Evaluation (POE) process technique was adopted for newly constructed apartments in Korea."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "A case demonstration was conducted using 32,895 sets of feedback (claims for defect repairs) from occupants (2018 to 2021)."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "The results highlight key evaluation metrics, including “repeated construction”, “rapid response” and “promise fulfillment”."}]}]}]}]}]}]}}