{"pii": "S2666603022000264", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Growth in technology has witnessed the comfort of an individual in domestic and professional life. Although, such existence was not able to meet the medical emergencies during the pandemic COVID-19 and during other health monitoring scenarios. This demand is due to the untouched Quality of Service network parameters like throughput, reliability, security etc. Hence, remote health monitoring systems for the patients who have undergone a medical surgery, bed ridden patients, autism affected subjects etc is in need that considers postural change and then forward to the caretaker in hospitals through wireless body area networks (WBAN). Security in these data are very important as it deals with the life of a subject. In this work, a Hierarchical Energy Efficient Secure Routing protocol (HEESR) is proposed that categorizes the deployed body nodes in to direct node and relay node based on the threshold vale. Unlike other conventional protocols the cluster head selection is based on the energy levels and the traffic priority data like critical and non-critical data, followed by an optimal route to forward the acquired data is identified and the data is compressed using Huffman encoding technique and encrypted using asymmetric cryptographic algorithm for secure data transmission. This protocol mainly appends security and routing efficiency in a hierarchical pattern through data prioritization and out performs the other conventional routing protocols by yielding a better energy consumption of 6%, throughput 92% and security of 93%, which has balanced the packet drop rate considerably and deliver the data within the stipulated time period."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "The model proposed a Hierarchical Routing algorithm based on the node type in Wireless Body Area Networks."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Data transmission happens through optimal route selection, depending on the distance between the transmitting node and the neighbour node."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Data traffic categorized into regular medical data, periodic medical data and non-medical data."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "The QoS parameters like throughput, reliability and security are improved."}]}]}]}]}]}]}}