{"pii": "S2666548424002087", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "role": "background", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Background"}, {"#name": "simple-para", "$": {"id": "spara011", "view": "all"}, "_": "Osteoporotic Vertebral Compression Fracture (OVCF) substantially reduces a person's health-related quality of life. Computer Tomography (CT) scan is currently the standard for diagnosis of OVCF. The aim of this paper was to evaluate the OVCF detection potential of artificial neural networks (ANN)."}]}, {"#name": "abstract-sec", "$": {"id": "abss0002", "role": "materials-methods", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0003"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "spara012", "view": "all"}, "_": "Models of artificial intelligence based on deep learning hold promise for quickly and automatically identifying and visualizing OVCF. This study investigated the detection, classification, and grading of OVCF using deep artificial neural networks (ANN). Techniques: Annotation techniques were used to segregate the sagittal images of 1,050 OVCF CT pictures with symptomatic low back pain into 934 CT images for a training dataset (89%) and 116 CT images for a test dataset (11%). A radiologist tagged, cleaned, and annotated the training dataset. Disc deterioration was assessed in all lumbar discs using the AO Spine-DGOU Osteoporotic Fracture Classification System. The detection and grading of OVCF were trained using the deep learning ANN model. By putting an automatic model to the test for dataset grading, the outcomes of the ANN model training were confirmed."}]}, {"#name": "abstract-sec", "$": {"id": "abss0003", "role": "results", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0004"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "spara013", "view": "all"}, "_": "The sagittal lumbar CT training dataset included 5,010 OVCF from OF1, 1942 from OF2, 522 from OF3, 336 from OF4, and none from OF5. With overall 96.04% accuracy, the deep ANN model was able to identify and categorize lumbar OVCF."}]}, {"#name": "abstract-sec", "$": {"id": "abss0004", "role": "conclusion", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0005"}, "_": "Conclusions"}, {"#name": "simple-para", "$": {"id": "spara014", "view": "all"}, "_": "The ANN model offers a rapid and effective way to classify lumbar OVCF by automatically and consistently evaluating routine CT scans using AO Spine-DGOU osteoporotic fracture classification system."}]}]}]}}