{"pii": "S2666603024000095", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Currently, servers store information from different sources and file types, which are then retrieved via electronic Information Management Systems (e-IMS), with Smart serving as an effective prototype system. Association rule testing and collaborative filtering are implemented to develop a Recommendation System (RS) for Mobile Application-based Official Document Management and Information Retrieval Systems (MA-ODM-IRS) that utilizes data structure and propensities to develop unique recommendations for common users. Reliable and accurate RS, which employs Machine Learning (ML)-based sentiment analysis to classify recommendations and novel performance metrics for target Information Retrieval (IF) from evaluation DMSs, enhances user trust. A recovery method significantly reduces data loss hazards and improves test case procedures for searching in IR, testing Mean Reciprocal Rank (MRR), Average Precision (AP), and retrieved document percentages. It recommends the novel MA-ODM-IRS and discusses the three experimental system iterations. A 0.75% reciprocal rank is better achieved by optimizing the MABIRS discovery process for users. Identifying feasible ideas, designing and implementing testing processes employing UML tools, and assessing the system gave the participants 98.19% acceptance."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "The study examines the best method to recommend smartphone apps to DMS users."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The recommendation system ranks highly diverse web data to make accurate e-document recommendations."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The study assessed a secured IRS's retriever performance using advanced metrics and end-user functional criteria."}]}]}]}]}]}]}}