{"pii": "S2667305324000085", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara022", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "To achieve this objective, we employ the ML-AKLS technique for dimensionality reduction."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "A stack regression-based PLST algorithm is described, using an updated M parameter."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "The suggested M.L.C model is evaluated using ten multi-label datasets."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "The outcomes of the suggested algorithm are contrasted with the most superior existing M.L.C algorithms."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara023", "view": "all"}, "_": "The importance of data quality and quantity cannot be overstated in automatic data analysis systems. An important factor to take into account is the capability to assign a data item to many classes. In Lithuania, there is currently no mechanism for classifying textual data that permits allocating a data item to multiple classes. Multi-label categorization learning offers a multi-dimensional viewpoint for objects with several meanings and has emerged as a prominent area of study in machine learning in recent times. Within the context of big data, it is imperative to develop a high-speed and effective algorithm for multi-label classification. This paper utilized the Machine Learning Advanced Kernel-Based Learning System for Multi-Label Classification Problem (ML-AKLS) to eliminate the need for repetitive learning operations. Concurrently, a thresholding function that is both dynamic and self-adaptive was developed to address the conversion from the ML-AKLS network's actual value outputs to a binary multi-label vector. ML-AKLS offers the ideal solution with the least squares method, requiring less parameters to be set. It ensures steady execution, faster convergence speed, and superior generalization performance. Extensive experiments in multi-label classification were conducted on datasets of varying scales. The comparative analysis reveals that ML-AKLS has superior performance when applied to extensive datasets characterized by high-dimensional sample features."}]}]}]}}