{"pii": "S266591742400374X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Recognizing human activity plays a crucial role in many applications such as medical care services in smart healthcare environments. Inertial or motion sensors can measure physiognomies such as acceleration and angular velocity of body movement while performing the activities and we can use them to learn the models capable of activity recognition. Over the past decades, many state-of-the-art activity recognition systems have been developed but there is still room to improve. In this paper, we have proposed a novel approach to identify human activity from motion sensor data by employing an enormous analysis of sensor data. Based on data analysis, we yielded quality data by preprocessing using a preprocessing chain for human activity recognition (PC-HAR) which also includes the Synthetic Minority Over-sampling Technique to balance the data of the dataset. As a recognition model, we proposed an ensemble of three different deep learning algorithms, namely, modified DeepConvLSTM, modified InceptionTime, and modified ResNet which is named ‘Ensem-DeepHAR’. The outcome of the proposed model is carried out by stacking predictions from each of the mentioned models and then a Random Forest as a meta-model uses those predictions to recognize the final activity. We evaluated our method on both person-dependent and person-independent cases and achieved 99.31 %, 99.08 %, and 97.52 % accuracies for the former case and 97.95 %, 98.11 %, and 99.51 % accuracies for the latter case using three common benchmark datasets: WISDM_ar_v1.1, PAMAP2, and UCI-HAR respectively. The various performance metrics and measures of experimental results establish the supremacy of the proposed model over the state-of-the-arts."}]}]}]}}