{"pii": "S2666603024000137", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Users could engage and interact with their immediate surroundings without effort in smart settings. The emergence of intelligent technologies along with software-based services has made this possible. It is clear that technical advancements have ushered in a new era for both computer processing and sensor technology, facilitating the concept of smart surroundings. Even though their implementation faces a number of obstacles, numerous expansive projects are working to advance their adoption. The problem of anomalies in the sensor data could result inappropriate decisions and could lead unamicable situations to the users. Many such algorithms are already there, which does not provide satisfactory predictions for the sensor data for the time series data. Time series anomaly detection problems are typically stated as finding outlier data points in comparison to some norm or typical signal. Better anomaly detection in time series data is provided by the proposed Markov and enhanced LSTM technique. The Markov model and the enhanced LSTM offer accurate predictions for extra- and short-term data, which is highly useful in situations involving intelligent environments. When compared to the KNN algorithm, the technique offers reduced MAE, RMSE, MSE and MAPE errors. The algorithm also performs better than other LSTM and RNN methods. The proposed algorithm provides 0.00047 reduced error in humidity data, 0.00416 reduced error in temperature and 0.01771 reduced MAE value in case of light intensity when comparing with the KNN algorithm."}]}]}]}}