{"pii": "S2666790824000636", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "This study presents a conceptual design of an Internet of Things (IoT) communication system for monitoring power generation systems in Colombian Non-Interconnected Zones (NIZs), which lack IoT connectivity due to complex geographical factors. The proposed system aims to ensure the proper operation and energy efficiency of off-grid systems while tracking the variables that influence their performance."}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "The methods used in this study include identifying the needs of such a system, identifying requirements, obtaining technical specifications, and developing a conceptual design. The study also analyses and compares various technologies, including Wi-Fi, Bluetooth, LoRa and ZigBee, to determine which ones are best suited for IoT system design."}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "The conceptual design of the proposed IoT monitoring system considers the geographical, communication and coverage characteristics of the NIZs and the technical characteristics of the energy projects to provide a complete functional system that can connect approximately 2 million people located in these isolated and vulnerable zones. Finally, the defined system can serve as a precedent for building prototypes in various NIZs, and research on IoT technologies suitable for NIZs can help us seek the technologies that are most suitable for these areas. Depending on the application and conditions of the energy project, the most appropriate technology can be determined on a case-by-case basis."}]}]}]}}