{"pii": "S2666351124000068", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e714", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e715"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e717", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e718", "view": "all"}, "_": "The significance of a more convenient and sustainable power transfer has been more crucial recently with the increasing need for low power electronic devices and their applications in internet of things (IoT). Wireless power transfer (WPT) technologies can conveniently transmit power to sensor and electronic devices deployed in hard-to-reach locations and therefore improving their convenience and mobility. On the other hand, low power wide area networks (LPWANs) provide low-power consumption, low bandwidth interaction between IoTs and the cloud, all which are traits of low-cost solutions for long range communication. Conversely, due to these devices’ locations (hard-to-reach/hazardous), it is a challenge to sustainably charge them and for the power sources or their mechanisms to last for longer term. This review analyses recent work on LPWANs and low power WPT with strong focus on the main challenges and key solutions that would allow for their integration in IoT applications. Challenges facing WPT systems such as end-device power intake, transmission power loss, power regulation, and coil/loop misalignment are highlighted in reference to recent research, recommending various challenge-mitigating techniques. Furthermore, for LPWAN end-devices, energy profiling of such devices is discussed through recent work aiming to optimise their power consumption. Specifically, we discuss factors affecting LPWAN end-devices’ power consumption which comprises the spreading factor, communication range and bit-rate. Also, comparison analysis is performed to highlight the superiority of wireless sensors/power transfer, in terms of cost, reliability, environmental impact and scalability Essentially, it is necessary to realise the potential of these two techniques (WPT and LPWAN), as their integration can advance various fields like structural health monitoring (SHM), precision agriculture, healthcare, and environmental monitoring."}]}]}]}}