{"pii": "S2667295223000922", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e693"}, "$$": [{"#name": "section-title", "$": {"id": "d1e694"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e696"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e697"}, "_": "Mobile ad hoc networks (MANETs), which correspond to a novel wireless technology, are widely used in Internet of Things (IoT) systems such as drones, wireless sensor networks, and military or disaster relief communication. From the perspective of communication and data collection, the success rate of collaborations between nodes in mobile ad hoc networks and reliability of data collection mainly depend on whether the nodes in the network operate normally, namely, according to the established network rules. However, mobile ad hoc networks are vulnerable to attacks targeting transmission channels and nodes owing to their dynamic evolution, openness, and distributed characteristics. Therefore, during the network operation, it is necessary to classify and detect the behavior and characteristics of each node. However, most existing research only analyzes and considers responses against a single or small number of attacks. To address these issues, this article first systematically analyzed and classified common active attacks in MANETs. Then, a node trust model was proposed based on the characteristics of various attacks; subsequently, a new secure routing protocol, namely, TC-AODV, was proposed. This protocol has minimal effect on the original communication dynamics and can effectively deal with Packet drop, wormhole, Session hijacking, and other main attacks in MANETs. The NS3 simulation results show that the proposed routing protocol attains good transmission performance, can effectively identify various attacks and bypass malicious nodes, and securely complete the communication process."}]}]}]}}