{"pii": "S2667305323000728", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "st0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0140", "view": "all"}, "_": "The design and implementation of a domain specific conversational agent requires efficient Natural Language Understanding (NLU). The task is harder when multiple languages have to be supported, and training datasets can be beneficial. This work focuses on the development of an intelligent system, an automated multilingual customer service conversational agent (chatbot) for university students, which supports both Greek and English and combines Intent Classification or Intent Extraction (IE) and Named Entity Recognition (NER) to understand the content (i.e. type of actions conveyed and respective entities) of users' messages. We focus on the development of the fundamental tasks required by a conversational agent to provide customer services in the education industry and manage requests with instant responses and increased customer satisfaction. Instead of handling IE and NER separately, as it is common in the related work, we develop a joint model that combines Bidirectional Long Short-Term Memory (BiLSTM) and Conditional Random Fields (CRF) layers and generates outputs both for IE and NER. We introduce a novel, open access dataset for customer services in education industry, the UniWay dataset, that has been used for training and evaluating our model, comprises students' questions in English and Greek about essential information related to their studies. A comparative evaluation of the proposed model versus state-of-the-art standalone and joint model solutions in UniWay and xSID datasets, results in improvement of the performance for the IE task up to 1.4% and it is on par with the state-of-the-art for the NER task. These results justify the intuition that closed domains can benefit from less sophisticated architectures, but less costly in terms of computational and memory resources, that jointly resolve multiple NLU tasks."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "ab0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0020"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "as0020", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0150", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ls0010"}, "$$": [{"#name": "list-item", "$": {"id": "li0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0010", "view": "all"}, "_": "Novel dataset for customer services in the education industry."}]}, {"#name": "list-item", "$": {"id": "li0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0020", "view": "all"}, "_": "Bilingual dataset for joint Named Entity Recognition (NER) and Intent Extraction (IE)."}]}, {"#name": "list-item", "$": {"id": "li0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0030", "view": "all"}, "_": "Fast and memory efficient unified deep learning model for both NER and IE tasks."}]}, {"#name": "list-item", "$": {"id": "li0040"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0040", "view": "all"}, "_": "Comparative evaluation that highlights the superiority of joint models."}]}, {"#name": "list-item", "$": {"id": "li0050"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "pr0050", "view": "all"}, "_": "Architecture for closed-domain conversational agents and federated learning solutions."}]}]}]}]}]}]}}