{"pii": "S2666910224001455", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ceab10", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cestitle10"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "ceabs10", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara40", "view": "all"}, "$$": [{"#name": "__text__", "_": "Identifying cows with low CH"}, {"#name": "inf", "$": {"loc": "post"}, "_": "4"}, {"#name": "__text__", "_": "-emitting potential can significantly contribute to CH"}, {"#name": "inf", "$": {"loc": "post"}, "_": "4"}, {"#name": "__text__", "_": " abatement in dairy herds. However, this process has been cumbersome and labor-intensive. Ear tags and collar-based accelerometers measure rumination and chewing behaviors, potentially identifying novel phenotypes in cows. This study aimed to determine whether rumination and eating time are linked to enteric CH"}, {"#name": "inf", "$": {"loc": "post"}, "_": "4"}, {"#name": "__text__", "_": " emissions and serve as proxies to identify CH"}, {"#name": "inf", "$": {"loc": "post"}, "_": "4"}, {"#name": "__text__", "_": " yield phenotype in lactating dairy cows. We applied the Dynamic Time Warping model to rumination and eating time data sets to classify cows differing in these phenotypes. We calculated the distances between cows differing in rumination and eating times and depicted them in a PCA plot. From 49 cows in early to mid-lactation, 10 low-rumination and 10 high-rumination cows were selected to test the relationship between rumination and eating time with CH"}, {"#name": "inf", "$": {"loc": "post"}, "_": "4"}, {"#name": "__text__", "_": " yield phenotype over 7 weeks. Enteric CH"}, {"#name": "inf", "$": {"loc": "post"}, "_": "4"}, {"#name": "__text__", "_": " emissions were measured using the GreenFeed® System. The Dynamic Time Warping model identified cows with distinct rumination and eating patterns. High-rumination cows had higher dry matter intake, milk yield, and lower enteric CH"}, {"#name": "inf", "$": {"loc": "post"}, "_": "4"}, {"#name": "__text__", "_": " emissions than low-rumination cows. High-rumination cows also had lower CH"}, {"#name": "inf", "$": {"loc": "post"}, "_": "4"}, {"#name": "__text__", "_": " intensity and higher production efficiency than low-rumination cows. Overall, rumination and eating time can be suitable proxies for identifying CH"}, {"#name": "inf", "$": {"loc": "post"}, "_": "4"}, {"#name": "__text__", "_": " yield phenotype in dairy cows. Further studies, including larger dairy herds, different dietary regimens, and stages of lactation in dairy cattle and other ruminant species to validate rumination and eating time as proxies for identifying CH"}, {"#name": "inf", "$": {"loc": "post"}, "_": "4"}, {"#name": "__text__", "_": " yield phenotype, are required."}]}]}]}]}}