{"pii": "S2666990023000186", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara022", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "Processing for hair removal is fundamental for dermoscopy image analysis."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "Hair segmentation by multilayer perceptron with filter-based pixel-wise features."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "Hair segmentation with end-to-end Encoder-Decoder."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "Results are given in terms of hair-free image quality and accuracy of image classification."}]}, {"#name": "list-item", "$": {"id": "celistitem0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0005", "view": "all"}, "_": "Hair removal from dermoscopy images improves melanoma classification versus lesions."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara023", "view": "all"}, "_": "Removing hair from digital dermoscopy images is occasionally a necessary step before further analysis is applied to the images. This work considers two machine learning approaches that segment the hair pixels from dermoscopy images. Subsequently, morphological post-processing is applied to refine the segmented hair and an image inpainting algorithm replaces the hair pixels with values based on the surrounding image structures. The first hair segmentation approach combines pixel-wise features extracted using the well-known Gaussian image pyramid with a traditional shallow multilayer perceptron (MLP-ANN), to detect hair pixels in images. The second approach uses a deep neural convolutional Encoder – Decoder (ED) network to segment hair. Both hair segmentation methods (MLP-ANN and ED) are trained with a set of 32 dermoscopy images with manually annotated hair, whereas the MLP-ANN dataset is constructed in a pixel-wise manner."}, {"#name": "simple-para", "$": {"id": "spara024", "view": "all"}, "_": "Both proposed methods underwent three different assessments. First a set of 50 images with a-priori known hair is used for hair segmentation evaluation. Secondly, a set of 13 different dermoscopy images with hair added using a suitably trained Generative Adversarial Network -GAN- are used to assess the quality of hair removal that generates the hair-free image, in terms of several error metrics with respect to the original hair-free image. Finally, both proposed hair segmentation methods (MLP-ANN and ED) are applied on a set of 200 hair and hair-free images, which is used for training an image classifier to recognize melanoma against nevi lesions and the improvement in the image classification accuracy is measured. Comparative results against several other state-of-the-art hair removal techniques are also presented."}, {"#name": "simple-para", "$": {"id": "spara025", "view": "all"}, "_": "Results show that in terms of hair removal, both the proposed hair removal techniques outperform the best performing of the state-of-the-art methods under comparison, in terms of several error metrics. Considering the effect of hair removal on melanoma image classification, the application of both MLP-ANN and ED increases the accuracy of melanoma classification. In all assessments, the ED was consistently the best performer. The statistical significance of the findings is also established."}]}]}]}}