{"pii": "S2666603023000155", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "__text__", "_": "The advent of Industry 4.0 has brought with it the integration of digital twin technology, which has enabled businesses to develop a virtual replica of their physical assets. This technology allows businesses to optimize their operations and improve their overall efficiency. However, the successful implementation of digital twin technology in Industry 4.0 heavily relies on the effective utilization of gateways. A significant challenge in gateway utilization is the fair allocation of resources, particularly in heterogeneous environments where gateways have different capabilities"}, {"#name": "bold", "_": "."}, {"#name": "__text__", "_": " Digital Twin is helping Industry 4.0 vision by connecting the authorized people to the exact data and processes to protect the data/assets from unauthorized access. It is accomplished by connecting sensing devices using a unique addressing system and transmitting their combined data to the Internet of Things (IoT) cloud. Massive volumes of heterogeneous data have resulted from the rapid growth of IoT applications and services. As a result, evaluation of data which affects the Digital Twin enabled industry is studied in this article which focuses on data traffic generated from different Industry 4.0 applications and protection of data along with the industry assets is looked by Digital Twin technology. IoT gateways are currently used to connect the devices from various technologies to the Digital Twins. In such networks, sudden increase in demand of IoT gateways will increase with the increase in IoT devices and the operational cost will also be increased. In the proposed system, low-cost specific gateways are proposed to minimize cost and maximize network performance for protecting assets of smart city through Digital Twin technology. In order to accomplish effective resource allocation in a Digital Twin based infrastructure, data transmission fairness at every gateway is accomplished in an IIoT network by considering link scheduling issues. To address these issues and provide fairness in heterogeneous networks with enhanced data transfer, two steps solution is implemented. The Long Short-Term Memory (LSTM) technique is used in the initial step of traffic prediction to assess the minimal time of prior traffic conditions before being applied to estimate dynamic traffic. In the second step, effective link scheduling and selection are made for each wireless technology, taking into account predicted load, gateway distance, link capacity, and estimated time. More data is transmitted at maximum capacity as a result of improved data transfer fairness for all gateways and then the data is protected by Digital Twin technology. Simulated results show that our suggested strategy performs better than other approaches by obtaining maximum network throughput in Industry 4.0 to provide protective solutions using Digital Twin technology."}]}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "Index Terms – Internet of Things (IoT), Link Scheduling, Traffic Prediction, Machine Learning (ML), Industry 4.0."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "This paper addresses the optimization of gateways in a Digital Twin-based industry environment to enhance data handling and protection."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The proposed fairness driven gateway scheduling approach provides optimal results by improving MAPE dstribution, by maximizing packet delivery ratio, and by minimizing average delay in transmission.."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "The proposed system introduces low-cost specific gateways to minimize operational costs and maximize network performance for protecting assets in a smart city using Digital Twin technology."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Effective resource allocation and data transmission fairness are achieved in the IIoT networks by considering link scheduling issues, resulting in improved network throughput."}]}]}]}]}]}]}}