{"pii": "S2667100X24000975", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara009", "view": "all"}, "_": "Aminoglycosides are concentration-dependent antibiotics exerting a bactericidal effect when concentrations at the site of infection are equal to or greater than 5 times the minimum inhibitory concentrations (MIC). When administered intravenously, they exhibit poor lung penetration and high systemic renal and ototoxicity, imposing to restrict their administration to 5 days. Experimental studies conducted in anesthetized and mechanically ventilated sheep and pigs provide evidence that high doses of nebulized aminoglycosides induce a rapid and potent bacterial killing in the infected lung parenchyma. They also confirm that the alveolar-capillary membrane, either normal or injured by the infectious process, restricts the penetration of intravenous aminoglycosides in the infected lung parenchyma, precluding a bactericidal effect at the site of infection. However, injury of the alveolar-capillary membrane promotes the systemic diffusion of nebulized aminoglycosides. Based on experimental data obtained in animals with inoculation pneumonia, it challenges the classical belief that nebulization protects against systemic toxicity. Loss of lung aeration decreases the lung penetration of nebulized aminoglycosides. Nevertheless, lung tissue concentrations measured in non-aerated lung regions with severe and extended pneumonia are most often greater than 5 times the MICs, resulting in a bactericidal effect followed by a progressive pulmonary reaeration. It is likely that the penetration into the consolidated lung, results from the bronchial diffusion of nebulized aminoglycosides toward adjacent non-aerated infected alveolar spaces and their penetration into mechanical ventilation-induced intraparenchymal pseudocysts and distended bronchioles. In animals receiving nebulized aminoglycosides, epithelial lining fluid concentrations grossly overestimate lung interstitial fluid concentrations because of the bronchial contamination of the distal tip of the bronchoscope during the bronchoalveolar procedures. Lung microdialysis is the only technique able to accurately assess lung pharmacokinetics in animals with inoculation pneumonia treated by nebulized aminoglycosides. In 2024, the European Investigators Network for Nebulized Antibiotics in Ventilator-associated Pneumonia (ENAVAP) called for the creation of an international research network for Lung Microdialysis applied to Nebulized Antibiotics (LUMINA) to promote multicentered, experimental, randomized, and controlled studies addressing lung pharmacokinetics of intravenous vs. nebulized antibiotics, using different dosing and ventilator settings."}]}]}]}}