{"pii": "S266730532300090X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "An intelligent tourism route planning model based on efficiency improvement is proposed, which integrates ant colony algorithm with genetic algorithm."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "The model introduces individual update and crossover operation to enhance its functionality."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "The calculation of transfer probability has been altered to improve the operation efficiency of the model."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara016", "view": "all"}, "_": "With the proposal and development of intelligent tourism destination, the problem of tourism route planning has become a hot topic in tourism research. This study proposes an intelligent tourism route planning model based on efficiency improvement for Guangxi tourism route planning. In order to improve the efficiency of the model, this paper combines ant colony algorithm with genetic algorithm and introduces smoothing factor and guiding factor, and obtains genetic algorithm (genetic algorithm-path smoothing ant colony optimization) with changing probability. Experimental results show that the convergence speed of the algorithm is fast, and it can converge in 78 iterations, and the operation efficiency is higher. The result error of the proposed algorithm is 1.39, which is smaller than that of other comparative algorithms. In the actual application effect evaluation, the average satisfaction of the planned route of the intelligent tourism route planning model based on efficiency improvement is 15.38, which is higher than that of the traditional genetic algorithm and simulated annealing algorithm. It shows that the model can not only efficiently plan the best travel route, but also comprehensively consider the whole trip of tourists, so that tourists can have a better travel experience. The research provides an intelligent route planning method that is more efficient and more in line with tourists' needs for tourism development."}]}]}]}}