{"pii": "S2667096822000726", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "id": "absh001", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0001", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "lst0001"}, "$$": [{"#name": "list-item", "$": {"id": "lstitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0001", "view": "all"}, "_": "This paper introduces a context-aware model for textual data warehouses and defines OLAP operations that improve the efficiency of information management within decision support systems."}]}, {"#name": "list-item", "$": {"id": "lstitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0002", "view": "all"}, "_": "The proposed model supports business applications that represent contextual information as well as where the dimensions are organized in hierarchical form to represent the same data in different abstract forms."}]}, {"#name": "list-item", "$": {"id": "lstitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0003", "view": "all"}, "_": "The model dynamically categorizes the documents using word embedding and agglomerative hierarchical clustering algorithms."}]}, {"#name": "list-item", "$": {"id": "lstitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0004", "view": "all"}, "_": "Documents are arranged according to the concept hierarchy existing among the contextual dimensions."}]}, {"#name": "list-item", "$": {"id": "lstitem0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0005", "view": "all"}, "_": "Extensive experimental results show the effiectiveness of our proposal in capturing semantic textual similarity and enhancing decision-making by speeding up of the execution time of OLAP operations."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0001", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0002", "view": "all"}, "_": "Decision Support Systems (DSS) that leverage business intelligence are based on numerical data and On-line Analytical Processing (OLAP) is often used to implement it. However, business decisions are increasingly dependent on textual data as well. Existing research work on textual data warehouses has the limitation of capturing contextual relationships when comparing only strongly related documents. This paper proposes an Information System (IS) based context-aware model that uses word embedding in conjunction with agglomerative hierarchical clustering algorithms to dynamically categorize documents in order to form the concept hierarchy. The results of the experimental evaluation provide evidence of the effectiveness of integrating textual data into a data warehouse and improving decision making through various OLAP operations."}]}]}]}}