{"pii": "S2666721524000437", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Despite efforts to identify and prevent causes, construction claims remain inevitable and repetitive. Therefore, focus has shifted to managing claims with systematic processes, yet challenges related to claim preparation persist. Drawing from political governance, where data analytics promote self-governance to overcome similar challenges, this study contrasts politics with construction claims, aiming to investigate potential for adopting similar data-driven approaches in the construction claim context. Through a systematic literature review in conjunction with ten industry interviews, we present similarities in control mechanisms and disciplinary powers as regulatory elements but reveal dissimilarities in self-governance and utilisation of data analytics. This study proposes categorizing initiatives in claim preparation to people-led, organisational-led, and data-led with data analytics pivotal in each. Through the application of data analytics resembling governmentality within the realm of political governance, the study reveals that the integration of self-governance and smart data analytics presents a potential solution for effectively addressing the challenges inherent in the preparation of construction claims."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Construction claims remain inevitable and repetitive."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Stagnation exists in offering practical remedies for the issues encountered in claim management."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Governmentality has a real potential to address the highlighted challenges through embedding smart data analytics in the claim preparation initiatives across a claim's lifecycle."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Initiatives of claim preparation were categorized to people-led, organisational-led, and data-led with data analytics pivotal in each."}]}]}]}]}]}]}}