{"pii": "S2665917424002368", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "As a cross-perception and cognitive research field in video understanding, motion training feature recognition is a very challenging task to establish a good spatio-temporal modeling of human motion due to the uncertainty of human motion speed, start and end time, appearance and posture, as well as the interference of physical factors such as lighting, perspective and occlusion. The purpose of this study is to use artificial intelligence data mining technology to study the feature recognition application of iot voice devices in sports training. Install the sensor in the appropriate position according to the position and posture to be measured. Ensure that the sensor can accurately measure the relevant features and maintain a stable connection. Using iot voice devices for data acquisition, sensors collect data on relevant features in real time to transmit the data to a cloud platform or local processing device via a wireless connection. By analyzing and mining the data collected by iot voice devices, we hope to effectively identify the characteristics of sports training and provide accurate feedback and guidance for athletes and coaches. The experimental results show that the iot voice device based on artificial intelligence data mining has achieved good results in the feature recognition application of sports training. Through the analysis of sports training data, we can successfully identify the characteristic patterns of different movements, and accurately predict the athletic state and posture of athletes."}]}]}]}}