{"pii": "S2666660X23000397", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Individuals, local communities, environmental associations, private organizations, and public representatives and bodies may all be aggrieved by environmental problems concerning poor air quality, illegal waste disposal, water contamination, and general pollution. Environmental complaints represent the expressions of dissatisfaction with these issues. As the time-consuming of managing a large number of complaints, text mining may be useful for automatically extracting information on stakeholder priorities and concerns. The paper used text mining and semantic network analysis to crawl relevant keywords about environmental complaints from two online complaint submission systems: online claim submission system of Regional Agency for Prevention, Environment and Energy (Arpae) (“Contact Arpae”); and Arpae's internal platform for environmental pollution (“Environmental incident reporting portal”) in the Emilia-Romagna Region, Italy. We evaluated the total of 2477 records and classified this information based on the claim topic (air pollution, water pollution, noise pollution, waste, odor, soil, weather-climate, sea-coast, and electromagnetic radiation) and geographical distribution. Then, this paper used natural language processing to extract keywords from the dataset, and classified keywords ranking higher in Term Frequency-Inverse Document Frequency (TF-IDF) based on the driver, pressure, state, impact, and response (DPSIR) framework. This study provided a systemic approach to understanding the interaction between people and environment in different geographical contexts and builds sustainable and healthy communities. The results showed that most complaints are from the public and associated with air pollution and odor. Factories (particularly foundries and ceramic industries) and farms are identified as the drivers of environmental issues. Citizen believed that environmental issues mainly affect human well-being. Moreover, the keywords of “odor”, “report”, “request”, “presence”, “municipality”, and “hours” were the most influential and meaningful concepts, as demonstrated by their high degree and betweenness centrality values. Keywords connecting odor (classified as impacts) and air pollution (classified as state) were the most important (such as “odor-burnt plastic” and “odor-acrid”). Complainants perceived odor annoyance as a primary environmental concern, possibly related to two main drivers: “odor-factory” and “odors-farms”. The proposed approach has several theoretical and practical implications: text mining may quickly and efficiently address citizen needs, providing the basis toward automating (even partially) the complaint process; and the DPSIR framework might support the planning and organization of information and the identification of stakeholder concerns and priorities, as well as metrics and indicators for their assessment. Therefore, integration of the DPSIR framework with the text mining of environmental complaints might generate a comprehensive environmental knowledge base as a prerequisite for a wider exploitation of analysis to support decision-making processes and environmental management activities."}]}]}]}}