{"pii": "S2666651023000232", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e1828", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1829"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e1831", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e1832", "view": "all"}, "$$": [{"#name": "__text__", "_": "Word sense induction (WSI) is a challenging problem in natural language processing that involves the unsupervised automatic detection of a word’s senses (i.e., meanings). Recent work achieves significant results on the WSI task by pre-training a language model that can exclusively disambiguate word senses. In contrast, others employ off-the-shelf pre-trained language models with additional strategies to induce senses. This paper proposes a novel unsupervised method based on hierarchical clustering and invariant information clustering (IIC). The IIC loss is used to train a small model to optimize the mutual information between two vector representations of a target word occurring in a pair of synthetic paraphrases. This model is later used in inference mode to extract a higher-quality vector representation to be used in the hierarchical clustering. We evaluate our method on two WSI tasks and in two distinct clustering configurations (fixed and dynamic number of clusters). We empirically show that our approach is at least on par with the state-of-the-art baselines, outperforming them in several configurations. The code and data to reproduce this work are available to the public"}, {"#name": "cross-ref", "$": {"id": "d1e1834", "refid": "fn1"}, "$$": [{"#name": "sup", "$": {"loc": "post"}, "_": "1"}]}, {"#name": "footnote", "$": {"id": "fn1"}, "$$": [{"#name": "label", "_": "1"}, {"#name": "note-para", "$": {"id": "d1e1840", "view": "all"}, "$$": [{"#name": "inter-ref", "$": {"xmlns:xlink": true, "id": "interref1", "href": "https://github.com/hadi-abdine/wsi-mim", "type": "simple"}, "_": "https://github.com/hadi-abdine/wsi-mim"}, {"#name": "__text__", "_": "."}]}]}, {"#name": "__text__", "_": "."}]}]}]}]}}