{"pii": "S2666449624000343", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara014", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "Propose a human behaviour detection dataset (HBDset) for improving safety in emergency evacuation."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "HBDset includes 8 human-behaviour categories, including normal people and different vulnerable."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "The dataset is designed to train AI-based computer vision model for real-time human detection."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "Computer vision model trained by HBDset achieves good performance for emergency evacuation."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara015", "view": "all"}, "_": "During emergency evacuation, it is crucial to accurately detect and classify different groups of evacuees based on their behaviours using computer vision. Traditional object detection models trained on standard image databases often fail to recognise individuals in specific groups such as the elderly, disabled individuals and pregnant women, who require additional assistance during emergencies. To address this limitation, this study proposes a novel image dataset called the Human Behaviour Detection Dataset (HBDset), specifically collected and annotated for public safety and emergency response purposes. This dataset contains eight types of human behaviour categories, i.e. the normal adult, child, holding a crutch, holding a baby, using a wheelchair, pregnant woman, lugging luggage and using a mobile phone. The dataset comprises more than 1,500 images collected from various public scenarios, with more than 2,900 bounding box annotations. The images were carefully selected, cleaned and subsequently manually annotated using the LabelImg tool. To demonstrate the effectiveness of the dataset, classical object detection algorithms were trained and tested based on the HBDset, and the average detection accuracy exceeds 90 %, highlighting the robustness and universality of the dataset. The developed open HBDset has the potential to enhance public safety, provide early disaster warnings and prioritise the needs of vulnerable individuals during emergency evacuation."}]}]}]}}