{"pii": "S2667096822000854", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara007", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "Human activity recognition detects and identifies human action and interaction."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "A decade-long review of transfer learning enhanced vision-based activity recognition."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "Transfer learning leverage pre-cultivated knowledge of one action to solve another."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "Recognize human action from vision sensors using machine and deep."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara008", "view": "all"}, "_": "The discovery of several machine learning and deep learning techniques has paved the way to extend the reach of humans in various real-world applications. Classical machine learning algorithms assume that training, validation, and testing data come from the same domain, with similar input feature spaces and data distribution characteristics. In some real-world exercises, where data collection has become difficult, the above assumption does not hold true. Even, if possible, the scarcity of rightful data prevents the model from being successfully trained. Compensating for outdated data, reducing the need and hardship of recollecting the training data, avoiding many expensive data labeling efforts, and improving the foreseen accuracy of testing data are some significant contributions of transfer learning in the real-world application. The most cited transfer learning application includes classification, regression, and clustering problems in activity recognition, image and video classification, wi-fi localization, detection and tracking, sentiment analysis and classification, and web-document classification. Human activity recognition plays a cardinal role in human- to-human and human-to-object interaction and interpersonal relations. Pairing with robust deep learning algorithms and improved hardware technologies, automatic recognition of human activity has opened the door in the direction of constructing a smart society. To the best of our knowledge, our survey is the first to link machine learning, transfer learning, and vision sensor-based activity recognition under one roof.. However, this survey exploits the above connection by reviewing around 350 related research articles from 2011 to 2021. Findings indicate an approximate 15% increment in research publications connected to our topic every year. Among these reviewed articles, we have selected around 150 significant ones that give insights into various activity levels, classification techniques, performance measures, challenges, and future directions related to transfer learning enhanced vision sensor-based HAR."}]}]}]}}