{"pii": "S2666188824001989", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara016", "view": "all"}, "_": "Digitalization and Industry 4.0 concepts promise substantial improvements in productivity and coordination, their adoption across the entire project lifecycle remains sporadic and incomplete in the construction industry. This digital divide not only hampers current performance but also poses a significant barrier to the industry's future competitiveness and sustainability. This study addresses a critical research gap by evaluating the comprehensive integration of digital twin technology from early design through project delivery in construction. Through an extensive literature review, we examine digital twin applications in the built environment and construction sector. Unlike previous studies focused on isolated use cases, our research provides a holistic assessment of digital twin implementation across all project stages. This study identifies key opportunities for digital twin to enhance collaboration, data sharing, and innovation in traditionally fragmented construction processes. The findings reveal that creating and populating digital twin from project inception enables more coordinated information flows and decision-making. This approach facilitates improved asset quality, sustainability outcomes, and stakeholder integration compared to conventional methods. By elucidating the full lifecycle potential of digital twin in construction, this study makes a novel contribution to both research and practice. The study also indicates that digital twin adoption aligns with and enables industry sustainability goals, though further research is needed to quantify these impacts. This work provides a foundation for future studies on optimizing digital twin implementation to transform construction productivity, quality and environmental performance."}]}]}]}}