{"pii": "S2667305324000528", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara021", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0005", "view": "all"}, "_": "A clustering method for local density and global dissimilarity of remote supervision."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0006", "view": "all"}, "_": "Get a lot of low noise aviation text data."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0007", "view": "all"}, "_": "Combining reinforcement learning to enhance textual consistency."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0008", "view": "all"}, "_": "Reduce interference from unrelated words, and achieve fast capture of key entities."}]}, {"#name": "list-item", "$": {"id": "celistitem0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0009", "view": "all"}, "_": "Refines the functionality of highly relevant features while inhibits the functionality of less relevant features."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara022", "view": "all"}, "_": "In the process of building domain knowledge graph, the result of relationship extraction between entities is an important guarantee of the quality of the graph. Therefore, we propose a clustering method based on reinforcement learning for remote supervised relation extraction. For the relationship extraction of accident information in the aviation domain mapping, a clustering method combining local dense and global dissimilarity is proposed in combination with remote supervision, which can obtain a large amount of low-noise labeled data and reduce part of the wrong labeling and missing labeling due to the strong specialization in the aviation domain; meanwhile, reinforcement learning is introduced to denoise the negative instance noise in the positive sample data; Finally, we propose a two-attention segmentation (DAPCNN) relationship extraction model to mine deep semantic sentences. The experimental results show that in the civil aviation relationship extraction text constructed in this paper, the Micro_R, Micro_P and Micro_F1 values of the proposed relationship extraction method reach 83.41 %, 84.16 % and 83.96 %. In the open relationship extraction dataset DuIE, The Micro_R, Micro_P and Micro_F1 of the proposed method are up to 83.41 %, 93.58 % and 94.02 % respectively. Compared with the current advanced multi-instance and multi-label model, the proposed method can more accurately extract the relationship between aviation accident entities. At the same time, the performance of the open data set is also good, and has a certain universality."}]}]}]}}