{"pii": "S2666285X21000169", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "abs0001", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara013", "view": "all"}, "$$": [{"#name": "__text__", "_": "Multicast routing is the process of sending data from one or more sources to many destinations. To achieve high efficiency, it is mandatory to minimize path delay due to blocking, and the cost of the path tree to reach destinations "}, {"#name": "cross-ref", "$": {"id": "crf0006a", "refid": "bib0006"}, "_": "[6]"}, {"#name": "__text__", "_": ". Evolutionary Algorithms have become more and more popular in the domain of searching, optimization and machine learning. Notwithstanding, a mesh is extremely slight when the nodes support high in topologies. The ODMRP needs control messages initiate at each source node of a multicast group to be flooded all over the networks. To optimize this problem, some heuristic approaches like the Particle Swarm Optimization (PSO) and Genetic Algorithm (GA) have been deployed in the route selection strategy "}, {"#name": "cross-ref", "$": {"id": "crf0006b", "refid": "bib0007"}, "_": "[7]"}, {"#name": "__text__", "_": ". A GA based ODMRP is planned for efficient multicast mesh routing. In this paper, modified genetic operators such as topology encoding, topology crossover and node mutation. The number of senders performing flooding and the issue of restricting the flood of control messages is minimized by reducing the number of forwarding nodes by means of applying the heuristic technique GA. Along with path tree, consistent key chaining and key management is required to execute a standard security framework. This anticipated work will be done using Newton's interpolation technique to implement. It shows efficient encoding scheme of the reconstruction of the multicast mesh topology and the simulation results demonstrate the effectiveness of the sGenODMRP compared to the ODMRP protocol."}]}]}]}]}}