{"pii": "S2665917424000643", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Researchers are drawn to Wireless Sensor Networks (WSNs) due to its versatility and possible use cases in a variety of fields, including target tracking and identification environmental sensing, industrial process tracking, and tactical systems. Recently, there has been a lot of focus on the particular issues that arise from implementing routing in sensor networks as opposed to the more conventional data routing in wireless connections. Due to the importance of energy conservation in the design of WSNs, numerous protocols for routing, power management, and data transmission have been developed for these networks. When it comes to environmental monitoring, traffic monitoring, etc., routing in WSNs is crucial. The primary objective of this study is to analyse routing issues and to analyse routing-related optimization issues. Features pertaining to routing issues like energy consumption, security, speed, and dependability are explored later. Attention has been paid to the routing protocols, which might vary by use case and network design. In this study, a comprehensive review is performed on the cutting-edge approaches to routing in WSNs. A brief introduction to WSNs and a discussion of the obstacles that routing protocols must overcome throughout their creation before moving on to a thorough examination of the various routing approaches now in use is considered. The comparative analysis is performed different routing techniques like Energy-Aware Routing for Software-Defined Multihop Wireless Sensor Networks (EAR-SDMWSN), DORA: A Destination-Oriented Routing Algorithm for Energy-Balanced Wireless Sensor Networks (DORA) and Energy Proficient Load Balancing Routing Scheme for Wireless Sensor Networks (EP-LBR). The benefits and drawbacks of each routing method, with an emphasis on performance is also performed."}]}]}]}}