{"pii": "S266591742200174X", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Wireless Underground Sensor Networks (WUSN) are gaining popularity due to their usage in vast prospective domains. Despite wide potential applications, many research issues in WUSNs need to be dealt with. Coverage Holes in WUSNs are one of the major issues that need attention. Nature-inspired optimization algorithms play a crucial role in modern computing, and for more than three decades, the field has made tremendous progress. Traditional algorithms are being replaced with these and have proved their competitiveness in various domains. In this paper, we have proposed an intelligent optimization algorithm based on the TSA (Tree Seed Algorithm) for patching the holes in the network and deciding on effective patching positions such that it reduces the maximum number of holes in the network. The proposed algorithm makes use of random, best, and spiral tree generation for getting the best optimal locations of sensor nodes to be deployed for healing the target region. First, an energy-efficient deterministic algorithm is applied for hole identification in the network. Then, an optimization-based nature-inspired algorithm is applied to heal the holes. The proposed algorithms and others are simulated through MATLAB and results are computed for the randomly deployed network. The proposed hole healing algorithm MTSA (modified TSA) has been compared with PSO (Particle Swarm Optimization) and TSA algorithms. Simulation results prove the effectiveness and robustness of the proposed algorithm. The proposed hole healing algorithm is suitable for small to large-size networks and reduces the larger number of holes than PSO and the original TSA algorithm."}]}]}]}}