{"pii": "S2666378320300052", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab0005", "lang": "en", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as0005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0065", "view": "all"}, "_": "The methods and tools of Geographic Information Sciences (GIScience)—spatial analysis, spatial statistics, and geographic information technologies—are increasingly being used in forensic humanitarian projects. In this article we explore ways to parse and analyze social and media releases from the United States Customs and Border Patrol (CBP) to gain an understanding of the death of migrants at the Texas-Mexico border. The methods we used include corpus linguistic (CL)/natural language processing (NLP) and Qualitative Spatial Representation (QSR) and Semantic Triples (ST). Our results indicate that CL/NLP and QSR/ST have the potential to increase and improve deceased migrant case identification by providing a framework for searching for key terms or themes throughout multiple textual sources. In the specific case examined, however, CL/NLP showed that CBP social media focused on drug confiscation and general patrolling activities and were of limited use for tabulating incidences of migrant death. On the other hand, QSR/ST visualizations showed which CBP Stations most frequently reported deceased migrant recoveries (i.e., search and collection of human remains) and with whom they collaborated."}, {"#name": "simple-para", "$": {"id": "sp0070", "view": "all"}, "_": "We believe these methods are part of the methodological toolkit needed to lay the ground for what we call Humanitarian GIS—the application of spatial analytical perspectives and tools to genocide studies, spatial forensics, and, in general, human rights topics and events. Within this toolkit, CL/NLP and QSR/ST highlight spatial relationships that are not necessarily mappable in a traditional GIS setting and allow researchers to detect patterns across large corpora of heterogeneous information. The mixing of methodologies and the combination of qualitative and quantitative data in Humanitarian GIS may change our understanding of an ongoing humanitarian crisis and aid in improving and increasing response to such crises."}]}]}]}}