{"pii": "S2666979X23001787", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Summary"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "It is widely accepted that large-scale genomic data (e.g., whole-genome sequencing, whole-exome sequencing, and genome-wide association study data) be shared through a controlled-access mechanism. This protects the privacy of research participants and ensures downstream uses of data align with participants’ informed consent regarding future sharing of their data. In 2019, GA4GH approved the Data Use Ontology (DUO) standard to define data use terms with machine-readable representations to represent how a dataset can be used. We endeavored to determine the parity of existing data use restrictions (“Data Use Limitations” [DULs]) for datasets registered in the National Institutes of Health database for Genotypes and Phenotypes (dbGaP) with the DUO standard. We found substantial (93%) parity between the dbGaP DULs (n = 3,575) and DUO. This study demonstrates the comprehensiveness of the DUO standard and encourages data stewards to standardize data use restrictions in machine-readable formats to facilitate data sharing."}]}]}, {"#name": "abstract", "$": {"class": "teaser", "id": "abs0015", "view": "all"}, "$$": [{"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "The Data Use Ontology (DUO) is a machine-readable vocabulary describing data use terms for research data. DUO facilitates data discovery and access requests, expediting the pace of research and scientific discovery. This paper shares the methods and results of attempting to map data use terms of 3,500 National Institutes of Health (NIH) datasets to DUO. 93% of NIH datasets were directly mappable and 3% partially mappable. Our results validate DUO as standard and provide guidance on assigning data use terms at NIH and beyond."}]}]}]}}