{"pii": "S2772442524000285", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Skin cancer can be detected through visual examination and confirmed through dermoscopic analysis and various diagnostic tests. This is because visual observation enables early detection of unique skin images by artificial intelligence. Promising outcomes are shown by several Convolution Neural Network (CNN)–based skin lesion classification systems that employ tagged skin images. This study suggests a practical approach for identifying skin cancers using dermoscopy pictures, improving specialists' ability to distinguish benign from malignant tumors. The Swarm Intelligence (SI) approach used dermoscopy photographs to locate lesions on the skin areas Region of interest (ROI). The Grasshopper Optimization technique produced the best segmentation outcomes. The Speed-Up Robust Features (SURF) approach is applied to extract features based on these findings. Two groups were created using the ISIC-2017, ISIC-2018, and PH-2 databases to categorize skin tumors. With an estimated accuracy in classification of 98.52%, preciseness of 96.73%, and Matthews Correlation Coefficient (MCC) of 97.04%, the suggested classification and segmentation methodologies have been evaluated for classification efficacy, specificity, sensitivity, F-measure, preciseness, the MCC, the dice coefficient, and Jaccard's index. In every performance indicator, the method we suggest outperformed state-of-the-art methods."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Study and analyze the existing segmentation and feature extraction techniques for skin cancer detection."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "Implement efficient optimization and feature extraction techniques for skin cancer classification."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "Classify the optimized feature set using machine learning methods."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "Evaluate and compare the performance metrics with other classification algorithms."}]}, {"#name": "list-item", "$": {"id": "u0030"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0030", "view": "all"}, "_": "Improve the diagnosis of malignant and benign tumor lesions compared to state-of-the-art methods."}]}]}]}]}]}]}}