{"pii": "S2772375524001564", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara023", "view": "all"}, "$$": [{"#name": "__text__", "_": "Energy savings in Wireless Sensor Networks for fish farms is necessary and beneficial. We present a novel energy savings method that minimizes the interpolation errors of sensors' measurements. Sensors follow a working cycle in which they are active when measuring data, and inactive or suspended when data is interpolated from the above measurements and consumed energy is reduced. To our knowledge, we are the first to implement interpolation for energy savings. We improved that model to describe the non-linear property of the consumed energy in the batteries, adding a new variable that explains their real behavior. Several experiments with a prototype of a Wireless Sensor Network with pH, water temperature, and ambient temperature sensors are implemented to validate our method. We made a series of measurements to determine the actual energy savings at each sensor and compared these savings with those predicted by each theory model. The results show that the model is more accurate, presenting less than "}, {"#name": "italic", "_": "5"}, {"#name": "__text__", "_": " % prediction errors which does not affect fish growth. Furthermore, our paper introduces an energy-saving method for extending WSN lifetime by modeling the non-linear power consumption of sensors' batteries. We propose a new mathematical optimization formulation using an efficient interpolation mechanism that operates in real-time. A real-scale WSN prototype installed over water validates and refines our method. Finally, we showed that the number of interpolated values is of a broader range for aquatic sensors than for outdoor sensors such as ambient temperature. That is, energy savings for fish farming is acceptable."}]}]}]}]}}