{"pii": "S2772485923000066", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e872"}, "$$": [{"#name": "section-title", "$": {"id": "d1e873"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e875"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e876"}, "_": "Open Artificial Intelligence (AI) published an AI chatbot tool called ChatGPT at the end of November 2022. Generative Pre-trained Transformer (GPT) architecture is the foundation of ChatGPT. On the internet, ChatGPT has been rapidly growing. This chatbot enables users to discuss with the AI by inputting prompts, and it is based on OpenAI’s language model. Although ChatGPT is fantastic and produces exciting results for writing tales, poetry, songs, essays, and other things, it has certain restrictions. Users may ask the bot questions, and it will reply with pertinent, convincing subjects and replies. ChatGPT has now risen to the top of several academic agendas. Administrators create task teams and hold institution-wide meetings to react to the tools, with most of the advice being to adopt this technology. This paper briefs about the ChatGPT and its need. Further, various Progressive Work Flow Processes of the ChatGPT Tool are stated diagrammatically. Specific features and capabilities of the ChatGPT Support System are studied in this paper. Finally, we identified and discussed the significant roles of ChatGPT in the current scenario. The neural language models that form the foundation of character AI have been developed from the bottom up with talks in mind. This technology implies that the programme uses deep learning methods to analyse and produce text. The model “understands” the subtleties of human-produced natural language using vast amounts of data from the internet."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e882"}, "$$": [{"#name": "section-title", "$": {"id": "d1e883"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e885"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e886"}, "$$": [{"#name": "list", "$": {"id": "d1e888"}, "$$": [{"#name": "list-item", "$": {"id": "d1e889"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e892"}, "_": "Open Artificial Intelligence (AI) published an AI chatbot tool called ChatGPT at the end of November 2022."}]}, {"#name": "list-item", "$": {"id": "d1e894"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e897"}, "_": "This paper briefs about ChatGPT and its need in the current scenario."}]}, {"#name": "list-item", "$": {"id": "d1e899"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e902"}, "_": "Progressive Work Flow Processes of the ChatGPT tool are diagrammatically stated."}]}, {"#name": "list-item", "$": {"id": "d1e904"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e907"}, "_": "Specific features and capabilities of the ChatGPT support system are elaborated in this paper."}]}, {"#name": "list-item", "$": {"id": "d1e909"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e912"}, "_": "Paper identified and discusses the significant roles of ChatGPT in the current scenario."}]}]}]}]}]}]}}