{"pii": "S2772572323000286", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "abstract-sec", "$": {"role": "background", "id": "abssec0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Background and Aims"}, {"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "Polymorphisms near the membrane bound O-acyltransferase domain containing 7 (MBOAT7) genes are associated with worsened nonalcoholic fatty liver (NASH), and nonalcoholic fatty liver disease (NAFLD)/NASH may decrease MBOAT7 expression independent of these polymorphisms. We hypothesized that enhancing MBOAT7 function would improve NASH."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Methods"}, {"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "Genomic and lipidomic databases were mined for MBOAT7 expression and hepatic phosphatidylinositol (PI) abundance in human NAFLD/NASH. Male C57BL6/J mice were fed either choline-deficient high-fat diet or Gubra Amylin NASH diet and subsequently infected with adeno-associated virus expressing MBOAT7 or control virus. NASH histological scoring and lipidomic analyses were performed to assess MBOAT7 activity, hepatic PI, and lysophosphatidylinositol (LPI) abundance."}]}, {"#name": "abstract-sec", "$": {"role": "results", "id": "abssec0020", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0020"}, "_": "Results"}, {"#name": "simple-para", "$": {"id": "abspara0020", "view": "all"}, "_": "Human NAFLD/NASH decreases MBOAT7 expression and hepatic abundance of arachidonate-containing PI. Murine NASH models display subtle changes in MBOAT7 expression, but significantly decreased activity. After MBOAT7 overexpression, liver weights, triglycerides, and plasma alanine and aspartate transaminase were modestly improved by MBOAT7 overexpression, but NASH histology was not improved. Despite confirmation of increased activity with MBOAT7 overexpression, content of the main arachidonoylated PI species was not rescued by MBOAT7 although the abundance of many PI species was increased. Free arachidonic acid was elevated but the MBOAT7 substrate arachidonoyl-CoA was decreased in NASH livers compared to low-fat controls, likely due to the decreased expression of long-chain acyl-CoA synthetases."}]}, {"#name": "abstract-sec", "$": {"id": "abssec0025", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0025"}, "_": "Conclusion"}, {"#name": "simple-para", "$": {"id": "abspara0025", "view": "all"}, "_": "Results suggest decreased MBOAT7 activity plays a role in NASH, but MBOAT7 overexpression fails to measurably improve NASH pathology potentially due to the insufficient abundance of its arachidonoyl-CoA substrate."}]}]}]}}