{"pii": "S2773230423000719", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"lang": "en", "id": "abs0010", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "_": "As the profundity of open-pit mining operations has increased, so has the frequency of geological disasters. The complex interaction of factors causing these disasters presents technical challenges for early warning and control systems. However, emergent technologies such as the internet, 5G networks, and artificial intelligence provide new opportunities for constructing integrated digital early warning platforms that synthesise multifaceted monitoring data to predict and mitigate open-pit mine hazards. Using efficient Internet-mediated information integration, data from various sources can be consolidated for enhanced disaster management. This paper reviews the current state of digital early warning platforms for open-pit mines using a Web of Science database search for pertinent literature. The framework, data layer, technology layer, and application layer of these platforms are investigated in order to identify associated technologies and obstacles. Important results include: (1) Inconsistent data formats and monitoring software diminish platform workflow efficiency. Robust data exchange protocols and feature-rich software could increase efficiency. (2) Platforms rely on limited data types as opposed to intelligent algorithms that integrate diverse monitoring inputs into global disaster predictions. The underutilization of advanced technologies such as artificial intelligence, the internet of things, and cloud computing. Mining calamity mechanisms and rock mechanics require additional study."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0015", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "Summarize the framework of open-pit mine early warning platform."}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "The incompatibility of application, data and technology in the platform is the main problem."}]}, {"#name": "list-item", "$": {"id": "u0020"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0020", "view": "all"}, "_": "An early warning platform framework adapted to future trends is proposed."}]}, {"#name": "list-item", "$": {"id": "u0025"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0025", "view": "all"}, "_": "AI and IOT perception are the trend of future early warning platform."}]}]}]}]}]}]}}