{"pii": "S2772503023000427", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara035", "view": "all"}, "_": "Opportunistic Network (Oppnets) is one of the influencing network of wireless ad-hoc Network in today's era of research. Massive publications have already existed in Oppnets, which considers diverse techniques of Opportunistic Routing (OR) to provide an adequate selection of relay nodes. This article contributes to the bibliometric evaluation of the routing protocols and study of network simulation tools. Bibliometric analysis is the statistical analysis of published articles by researchers at particular time and place, with the relation among these articles. The data were pre-processed and analyzed with the VOS viewer and Bibliometrics, the professional mapping tool. 16 years of publication (from 2006 to 2022) were included in this evaluation process. Firstly, persuasive citation evaluation of countries and articles were addressed. Secondly, contribution assessment of documents according to countries and researchers. Thirdly, most effective sources, keywords, and trending topics with co-occurrence of bibliographic coupling were encountered. At last, 23 wireless-tools were analysed and also compared. These tools were also discussed with their unique features, leverages, and detriments. The primary objective is to give researchers enormous knowledge and help them elaborate their work in OR, and select appropriate tools to simulate their work. From this study; Readers, Researchers, and Authors can find easily the most reliable “researcher”, “document”, and “source of journal”. The author can find what work has been already published and illuminates their research work with more outcome."}]}]}]}}