{"pii": "S2772662224000572", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e4237"}, "$$": [{"#name": "section-title", "$": {"id": "d1e4238"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e4240"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e4241"}, "_": "Disaster tweet classification has gained significant attention in natural language processing (NLP) due to its potential to aid disaster response and emergency management. The goal of disaster tweet classification is to automate the identification of informative tweets containing information related to various types of disasters, such as floods, earthquakes, wildfires, and more. This classification task plays a crucial role in real-time monitoring, situational awareness, and timely response coordination during emergency situations. In this context, we propose a Deep Parallel Hybrid Fusion Model (DPHFM) that combines features from Convolutional Neural Networks (CNNs) and Bidirectional Long Short-Term Memory (Bi-LSTM) as base learners. The features extracted from these base learners are combined using a fusion mechanism and then reconstructed for input to a meta-learner for making predictions. The DPHFM is trained on disaster datasets, such as crisisMMD, which consists of seven natural disaster events. The model underwent thorough evaluation using various metrics, demonstrating an average performance improvement of 90% to 96%. Furthermore, the proposed model’s performance surpassed that of other state-of-the-art models, showcasing its potential for disaster tweet classification using deep learning techniques."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e4255"}, "$$": [{"#name": "section-title", "$": {"id": "d1e4256"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e4258"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e4259"}, "$$": [{"#name": "list", "$": {"id": "d1e4261"}, "$$": [{"#name": "list-item", "$": {"id": "d1e4262"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e4265"}, "_": "Propose a deep parallel hybrid fusion model for disaster tweet classification."}]}, {"#name": "list-item", "$": {"id": "d1e4267"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e4270"}, "_": "Preprocess tweet text using various techniques and convert them into vectors using various embedding techniques."}]}, {"#name": "list-item", "$": {"id": "d1e4272"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e4275"}, "_": "Use the embedding representation of text information (vectors) as input to the parallel models that work as a base learner."}]}, {"#name": "list-item", "$": {"id": "d1e4277"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e4280"}, "_": "Use a fusion technique to combine the extracted features (Flatten) and improve the performance of the parallel architecture."}]}, {"#name": "list-item", "$": {"id": "d1e4282"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e4285"}, "_": "Supply the extracted features to the meta-learner to predict the input text information as informative or non-informative using machine learning."}]}]}]}]}]}]}}