{"pii": "S2772442523001053", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "d1e441", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e442"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "d1e444", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e445", "view": "all"}, "_": "Prevalent mental disorders, such as depression and anxiety, commonly manifest in students throughout the transition to early adulthood. Mental illnesses can significantly impact students’ academic and social activities. An automatic or semiautomatic health monitoring approach is very effective for diagnosing depression and anxiety. This study aims to implement and scrutinize a data-driven optimization method for identifying and providing therapy to students with symptoms of depression and anxiety. The proposed method starts with data preprocessing and operating sentiment analysis to identify mentally disordered students. An ensemble learning classifier later divides students with symptoms into three categories based on their health condition: severe, moderate, and mild. A hyperparameter optimization approach is further adopted to improve the model’s performance. Finally, a rule-based dispatching system is implemented for scheduling therapy sessions. The proposed novel data-driven method is a post-disaster intelligent and reliable method that integrates three well-adopted techniques to address students’ depression and anxiety. The findings indicate that the conventional approach to monitoring depression among students previously detected only 7 to 15% of cases. However, the performance of the offered strategy revealed a confirmed rate of 44% of depressed and anxious students."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "id": "d1e455", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "d1e456"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "d1e458", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "d1e459", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "d1e461"}, "$$": [{"#name": "list-item", "$": {"id": "d1e462"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e465", "view": "all"}, "_": "This study develops a data-driven optimization method for managing mental problems."}]}, {"#name": "list-item", "$": {"id": "d1e467"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e470", "view": "all"}, "_": "This study used sentiment analysis to identify mentally disordered patients."}]}, {"#name": "list-item", "$": {"id": "d1e472"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e475", "view": "all"}, "_": "An optimized ensemble learning classifier categorized identified students."}]}, {"#name": "list-item", "$": {"id": "d1e477"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e480", "view": "all"}, "_": "The final step discusses a scheduling approach by which students receive therapy."}]}, {"#name": "list-item", "$": {"id": "d1e482"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "d1e485", "view": "all"}, "_": "A real-life case study is discussed to evaluate the proposed method."}]}]}]}]}]}]}}