{"pii": "S2772671124001372", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara018", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "The most prevalent kind of cancer in people is skin cancer. More than 1 million people are thought to have skin cancer every year in the entire world. The efficacy of illness therapies is significantly impacted by early disease detection."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0005", "view": "all"}, "_": "Preprocessing is the first stage in the noise removal process that a median filter uses to improve skin images. EfficientNet and UNet are combined in order to increase segmentation precision. Additionally, to reduce information loss during the learning phase, modified tuna swarm optimisation (IMSO) is employed to fine-tune the U-EfficientNet's adjustable parameters."}]}, {"#name": "list-item", "$": {"id": "celistitem1002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para1005", "view": "all"}, "_": "This study is the need of the hour and will be a cost-effective method of prediction aiding the medical professionals."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara019", "view": "all"}, "_": "The second-leading cause of cancer-related deaths globally is lung cancer. A patient's life may be saved if this cancer is discovered early. Cancer can be difficult to detect on computed tomography (CT) images, according to physicians. Strong nodule segmentation is a difficulty because to the variety of pulmonary nodules and the visual similarities between nodules and their surroundings. Preprocessing, feature extraction, and classification are the three phases of the approach. Gather databases first from open source platforms. Unwanted noise in acquired CT images reduces the effectiveness of classification. In order to remove undesired noise from the input image, preprocessing techniques like filtering and contrast enhancement might be taken into consideration. The essential segmentation of the image is then carried out using optimization approaches like Automatic Lung Parenchyma Mining and Remora Concavity (ALPM & RC). Cross Spectral Visual Transformer and Improved Moth Flame Optimization (CSViT-IMFO) are the two classifiers that are being suggested. For multi-process optimization in CSViT, like structural and hyperparameter optimization, IMFO is used. Utilizing performance matrices like accuracy, precision, recall, specificity, sensitivity, and F_Measure, the proposed method is put into practice in MATLAB. On the LIDC dataset, our suggested solution outperforms cutting-edge learning-based methods with a classification accuracy of 99.5 %."}]}]}]}}