{"pii": "S2772390922000385", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "id": "ab005", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "st005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "as005", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "_": "The Internet of Things (IoT) symbolizes numerous devices which are connected globally through the internet technology and are able to collect and share relevant data. The IoT has thus achieved a significant advancement in the field of sensors, networks, and communication technologies, such as long-term evolution (LTE) technology, fifth generation (5G) technology, wireless sensor networks (WSN), and others. Apart from technological advancements, the ability of IoT to run fully embedded (with or without an operating system), gather real-time data, estimate physical parameters, facilitate decision making based on the data gathered, use of various networks (e.g., local area networks (LAN), low-power wide-area network (LPWAN), cellular LPWAN) has provided enormous opportunities for its applications in the railway industry and other domains. The current study performs a comprehensive holistic survey of various IoT technologies that can be used in railway operations, management, maintenance, video surveillance, and safety at level crossings. This study also discusses current trends in the IoT, emerging IoT technologies, green IoT applications, and various research studies that have been conducted in the areas related to railway applications. Furthermore, various challenges that are associated with the IoT applications are discussed along with potential efforts that can be made to overcome these challenges. The outcomes of this work are expected to offer important insights regarding the applicability of IoT technologies for sustainable railway transportation, their future potential, operational benefits to relevant stakeholders and authorities, as well as critical future research needs that have to be addressed in the following years."}]}]}]}}