{"pii": "S2772671123001870", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara018", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "Optimal boundary formation for microgrids (MGs) during grid failure."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0005", "view": "all"}, "_": "Exploitation of modified backward-forward search-based power flow in MGs."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0006", "view": "all"}, "_": "Implementation of LSTM and ARIMA model for hour-ahead demand prediction."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0007", "view": "all"}, "_": "Development of a single-stage solution algorithm for boundary selection."}]}, {"#name": "list-item", "$": {"id": "celistitem0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0008", "view": "all"}, "_": "Performance analysis on 33-bus, 69-bus, and 118-bus radial distribution network."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara019", "view": "all"}, "_": "Microgrid (MG) operation has become an intriguing possibility to enhance the sustainability, reliability, and resilience of electricity distribution systems in emergencies. However, identifying suitable physical boundaries of MGs from an active power delivery infrastructure is a highly challenging task. This study describes a novel approach for determining the topological boundary of multiple MGs to restore power supply in a power distribution system during the unavailability of grid power supply. This method tries to enhance the self-adequacy of the MGs by increasing power flow within the MG boundaries. In this context, possible demand at the nodes of the power delivery infrastructure during an emergency is anticipated by an autoregressive integrated moving average (ARIMA) and long short-term memory (LSTM) network-based time series forecast models. A modified backward-forward sweep (MBFS) power flow analysis, tailored for islanded mode, is employed to assess the power flow status in the MGs during emergencies. The MGs are supplied with locally available dispatchable distributed generators (DDGs). A particle swarm optimization (PSO) algorithm intertwined with the MBFS power flow method has been employed to determine the boundary of MGs by identifying minimum power flow line in the shortest path between the consecutive DDGs. Further, this study demonstrates the evaluation of the shortest path between paths between the consecutive DDGs with the help of a breadth-first search (BFS) algorithm. The proposed strategy has been tested on a modified 33-bus, 69-bus and 118-bus power distribution test systems. The experimented results are verified with the results obtained from similar existing approaches to explore the opportunities in the proposed methodology."}]}]}]}}