{"pii": "S2772375523001168", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara010", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "During the occurrence of the 2016 Kumamoto Earthquake, our developed wireless sensor network system (WSNS) with TDT sensors recorded rapid increases in soil water content and pore-water electrical conductivity caused by soil liquefaction in a lowland polder with shallow saline groundwater conditions. The soil liquefaction resulted in significant temporal and spatial variations in soil salinity, leading to the death of salt-tolerant tomatoes within a month. However, the soil desalinization process was completed within four months, and the subsequent cultivation season demonstrated robust growth of tomatoes."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara011", "view": "all"}, "$$": [{"#name": "__text__", "_": "After the 2016 Kumamoto Earthquake (Kumamoto earthquake sequence) of maximum magnitude M7.3 occurred, agricultural fields and crops were significantly damaged by soil liquefaction in lowland polders, which had shallow saline groundwater. A desalinization treatment was required to recover agricultural production in polders in Kumamoto. To understand the soil salinity levels in the root zone, we installed multiple-point measurements using the wireless sensor network system (WSNS) for real-time monitoring of soil moisture ("}, {"#name": "italic", "_": "θ"}, {"#name": "__text__", "_": " ) and bulk soil EC (EC"}, {"#name": "inf", "$": {"loc": "post"}, "_": "b"}, {"#name": "__text__", "_": ") in a cherry tomato greenhouse. Pore-water electrical conductivity (EC"}, {"#name": "inf", "$": {"loc": "post"}, "_": "w"}, {"#name": "__text__", "_": ") can be estimated as an indicator of the field's salinity level simultaneously. First, we found rapid increases in "}, {"#name": "italic", "_": "θ"}, {"#name": "__text__", "_": " and EC"}, {"#name": "inf", "$": {"loc": "post"}, "_": "w"}, {"#name": "__text__", "_": " where soil liquefaction and sand boils occurred. Through soil survey, we confirmed the existence of a large channel beneath one of the liquefaction plots, suggesting considerably high spatial heterogeneity of soil salinity across the greenhouse. Secondly, the high salinity level could not be controlled by drip irrigation at all. Finally, 1-week flooded leaching treatments were carried out; the electrical resistivity tomography (ERT) survey indicated that the salinity level decreased significantly except around the channel plot. The combination of the flooded leaching and natural rainfall was more effective for salt leaching in macropores and channels. Our analysis using the WSNS highlighted three management strategies that may help reduce a polder's salinity level."}]}]}]}]}}