{"pii": "S2772671124001244", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara024", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "The work is oriented to deal with the upcoming power quality issues in most emerging technology Internet of Things."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0005", "view": "all"}, "_": "The smart power converters called Power Management Units (PMU) are supervised through soft computing technique."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0006", "view": "all"}, "_": "The deep learning based adaptive ANFIS technology is associated with conventional controller to deal with uncertainty of stimulus."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0007", "view": "all"}, "_": "The effect of ANFIS supervised active power filter is remarkable and it has reduced the THD by 0.78 %, which is quite below from acceptable IEEE519 standards."}]}, {"#name": "list-item", "$": {"id": "celistitem0005"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0008", "view": "all"}, "_": "The proposed model and methodology is highly feasible to smart industrial and commercial applications, where the devices are on edge of network and standalone operations."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara025", "view": "all"}, "_": "The emergence of Internet of Things (IoT) offers numerous functions, such as intelligent sensor integration, remote sensing, and high-speed data transmission, which have found widespread applications in the smart industry and commercial applications. The associative nonlinear effects of a variety of undesirable power quality concerns were resolved by using harmonic mitigation in nonlinear loads and high-performance converters were built on power electronics in conventional systems. Among other performance objectives, total harmonic (THD) distortion analysis and higher order harmonics mitigation is given main concern in smart electronics equipment. This paper proposes an approach to minimize higher-order harmonics due to nonlinear load disturbances in smart IoT devices using the Takagi–Sugeno (TS) Neuro Fuzzy (TS-ANFIS) supervised shunt APF. The proposed work elicits the novel adaptive harmonic mitigation technique in hybrid IoT embedded systems to protect from malfunctioning and to deal with the uncertainty of harmonic signal stimuli in sensitive sensors-based IoT systems. Hysteresis current control is used for the ignition of reference signal under uncertainty of harmonic stimuli. The single phase shunt APF is used to mitigate higher-order harmonics from supply mains, while the implementation of TS-ANFIS supervises the controller action to generate a trigger signal for adequate single phase APF gate excitation. The higher order harmonic current data set is used for error deviation for training neural networks and adaptive control. The estimated adoption of the neuron's empirical weight reduces the total THD to a significant reduction rate of 72.8 % to 0.78 %. The control mechanism is feasible for a range of smart IoT systems to adhere to the standard of 519 (IEEE)."}]}]}]}}