{"pii": "S2773186324000720", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara008", "view": "all"}, "_": "The swift advancement and updating of urban lighting systems, along with the incorporation of smart and Internet of Things (IoT) infrastructure, have opened up numerous opportunities for technological progress across various facets of life. This paper offers a comprehensive overview on the development of smart public street lighting infrastructure tailored for IoT applications in smart cities. Initially, the focus lies on transitioning from conventional lighting to Light-Emitting Diodes (LEDs) technology in street lighting. Complementing this transition, the incorporation of the wireless networked sensors and controllers ensures dynamic brightness control in operational zones, envisioning substantial energy savings. Furthermore, the notion characterizing smart cities denotes incorporating modern digital infrastructures to develop innovative functionalities and connect various application, following the IoT paradigm. The key findings from the proposed study have enhanced knowledge regarding smart public street lighting application. This system integrates smart poles equipped with LEDs lamps technology, smart sensors, communication network and monitoring unit, leveraging current technological advancements in IoT applications. The implementation of IoT-based smart public street lighting systems presents several challenges, including integrating diverse sensors and actuators ensuring robust device communication, secure data management, and effective system scaling and maintenance. Despite these challenges, this system significantly advances smart city infrastructure by enhancing energy efficiency, safety, and sustainability. However, addressing their high initial costs, data privacy and security concerns, and ongoing maintenance are crucial in future studies to realize their full potential in smart cities."}]}]}]}}