{"pii": "S2772503023000282", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara025", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0001", "view": "all"}, "_": "Prevalence, bias, and observed agreement indexes are essential to interpreting IAA."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "It is crucial to use discourse markers for claim and premise (evidence) detection."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "If the observed agreement index is almost perfect, the value of k increases."}]}, {"#name": "list-item", "$": {"id": "celistitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "The prevalence index predominates over the bias index when both are very low."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara026", "view": "all"}, "$$": [{"#name": "__text__", "_": "There are many annotation methods for the English language based on adapting an argumentation model according to the study domain. However, as far as research has been done, there are no annotation methods for detecting argumentative content in Spanish, not only due to the complexity of identifying the evidence but also because of the lack of data available for this task. The research aims to present and evaluate an annotation method consisting of an adapted argumentation model, an annotation guide, and an annotation process based on Twitter data analysis. The Inter Annotator Agreement (IAA) study achieves 0.63 Fleiss Kappa for Argument/Non-Argument tagging, 0.35 Fleiss Kappa for Argument Component tagging, and 0.53 Fleiss Kappa for Non-Argument Component tagging, while the best Cohen's kappa (k) index achieved, was 0.73, 0.52 and 0.75 respectively. The results' assessment highlights the need to include linguistic segmentation rules for the second annotation task. It is crucial to use discourse markers for the claim and evidence detection. For the first annotation task, it determined that if the prevalence index and the bias index are very low, the prevalence index predominates over the bias index because k increases (0.52<="}, {"#name": "italic", "_": "k"}, {"#name": "__text__", "_": "<=0.72); likewise, for the third annotation task, when the observed agreement index is almost perfect (0.92) the value of k increases ("}, {"#name": "italic", "_": "k"}, {"#name": "__text__", "_": "=0.75) despite a high prevalence index and a low bias index. The annotated corpus with a Fleiss Kappa >= 0.60, agreement and disagreement tables, and confusion matrices code are available on Mendeley Data Repository."}]}]}]}]}}