{"pii": "S2772671124000135", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "id": "absh001", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abssec0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0005", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "lst0001"}, "$$": [{"#name": "list-item", "$": {"id": "lstitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0001", "view": "all"}, "_": "This work introduces a real-time temporary grounding monitoring system integrated with the supervisory system."}]}, {"#name": "list-item", "$": {"id": "lstitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0002", "view": "all"}, "_": "Effective monitoring of the active or inactive status of temporary grounding in substations and transmission lines."}]}, {"#name": "list-item", "$": {"id": "lstitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0003", "view": "all"}, "_": "Application of mesh network technology for monitoring the state of temporary grounding."}]}, {"#name": "list-item", "$": {"id": "lstitem0004"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0004", "view": "all"}, "_": "Results demonstrate the system’s viability in environments with high electromagnetic interference."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0001", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sctt0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0006", "view": "all"}, "_": "The importance of grounding techniques is undeniable in ensuring the safety of workers involved in high-voltage systems. During maintenance routines, using multiple grounding cables is common; however, individually verifying if each cable is correctly connected can be challenging. This work presents an innovative proposal to control and check the connection state of grounding cables listed in a maintenance routine at a predefined point. The proposed solution employs electronic devices that create mesh networks, significantly improving safety levels. Through real-time monitoring, the system allows quick and accurate identification of potential failures or disconnections in the grounding cables. This feature plays a pivotal role in safeguarding the maintenance team, averting accidents linked to grounding issues. Field tests performed in real substation and transmission tower environments validated the system’s resilience, showcasing its adeptness in managing communication interferences effectively. The results showed that the system is highly reliable, providing essential and precise information to the maintenance team. Implementing this real-time monitoring system for the temporary grounding connection status represents a significant advancement in the safety of maintenance operations at substations. By offering a comprehensive view of the status of each grounding cable, the system enables more appropriate decision-making and swift interventions in case of issues. The goal is to minimize risks and ensure a safer working environment for the high-voltage team that maintains the systems."}]}]}]}}