{"pii": "S2772415823000160", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e1151"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1152"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e1154"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e1155"}, "_": "To effectively prevent crimes, it is vital to anticipate their patterns and likely occurrences. Our efforts focused on analyzing diverse open-source datasets related to London, such as the Met police records, public social media posts, data from transportation hubs like bus and rail stations etc. These datasets provided rich insights into human behaviors, activities, and demographics across different parts of London, paving the way for a machine learning-driven prediction system. We developed this system using unique crime-related features extracted from these datasets. Furthermore, our study outlined methods to gather detailed street-level information from local communities using various applications. This innovative approach significantly enhances our ability to deeply understand and predict crime patterns. The proposed predictive system has the potential to forecast potential crimes in advance, enabling government bodies to proactively deploy targeted interventions, ultimately aiming to prevent and address criminal incidents more effectively."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e1170"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1171"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e1173"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e1174"}, "$$": [{"#name": "list", "$": {"id": "d1e1176"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1177"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1180"}, "_": "Open-source datasets like police data, station records etc. can serve crime analysis and prediction purposes."}]}, {"#name": "list-item", "$": {"id": "d1e1182"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1185"}, "_": "Crime prediction relies on timestamps and locations of previous crimes."}]}, {"#name": "list-item", "$": {"id": "d1e1187"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1190"}, "_": "Merging diverse open datasets on crime facilitates basic regression for predicting criminal activities."}]}, {"#name": "list-item", "$": {"id": "d1e1192"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1195"}, "_": "Street-level data collection relies on mobile apps where pedestrians can share their safety sentiments about streets."}]}]}]}]}]}]}}