{"pii": "S2772941924000164", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara014", "view": "all"}, "_": "Online network education offers convenience, however, the inefficiency and time-consuming nature of question-answering models negatively impact the demand for online learning. To address this issue, the study puts forward the development of an automatic English question-answering model. The improved model leverages a term frequence-inverse document frequency approach and an unsupervised participle algorithm based on deep learning. The precision and promptness of the question-answering model were enhanced by refining the weighted allocation of the term frequence-inverse document frequency algorithm and the unsupervised word-splitting algorithm. The validation shows that the improved precision rate is 68.14%, which is 34.37% and 50.45% more than the other two methods, respectively. The precision rate, recall rate, and F1 value for semantic similarity calculation improved by 9.23%, 9.22%, and 9.71%, respectively, compared to the traditional method. The validation experiments of the automatic English question-answering model indicate that its average accuracy was 94.68%, surpassing other models by 4.77%. The average answer time for the four types of questions was 30.52 ms, and the average answer time for the cause questions was 11.45 ms. The results show that the proposed English automatic question-answering model has better accuracy and timeliness of answering questions, and the improved accuracy for weight calculation is better. The English automatic question-answering model integrating word frequency-inverse document frequency and participle algorithm can satisfy the basic needs of teachers and students in online teaching, course question-answering, etc., which is of positive significance for the development of online education in the context of the Internet."}]}]}]}}