{"pii": "S2772671123000165", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara015", "view": "all"}, "_": "The inclusion of renewable energy in the conventional grid system and the digitalization of the various aspects of the power system have precipitated the transformation of the traditional grid system to a smart grid. Key to the implementation of the smart grid is various communication technologies. The emerging dominance of communication technologies in power systems applications is pivotal to modernizing the conventional grid system. This research presented an overview of the application of communication technologies in the digitalization of the power systems network. It reviews smart grid communication technologies, their features, relevance, and various roles being played toward delivering an effective electrical service to stakeholders. Hence, this study focused on wireless and wired communication technologies applicable to smart grid applications. Based on the review, each communication technology has its strengths and weaknesses; hence in selecting the most appropriate technology for application in a smart grid, a compromise must be made. Therefore, for choosing the most preferred communication technology in any smart grid application, it is important to deploy the efficacy of multi-criteria methods. To serve as a case study, a framework for selecting a communication technology for advanced metering infrastructure is proposed and applied. Based on the spectrum, data rate, and coverage range, the study revealed that WiMAX communication technology is the most preferred, followed by Zigbee; the least preferred communication technology for smart grid communication is Power Line Communication (PLC)."}]}]}]}}