{"pii": "S2772375523001144", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "class": "author-highlights", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara039", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "celist0001"}, "$$": [{"#name": "list-item", "$": {"id": "celistitem0001"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0002", "view": "all"}, "_": "Artificial Intelligence Internet of Things (AIoT) integration for fish farming management and monitoring."}]}, {"#name": "list-item", "$": {"id": "celistitem0002"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0003", "view": "all"}, "_": "Integration of digital twin infrastructure with AIOT for intelligent fish farming using cloud, artificial intelligence, and Internet of Things for fish farming."}]}, {"#name": "list-item", "$": {"id": "celistitem0003"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "para0004", "view": "all"}, "_": "Digital twin services for smart fish farming include fish feeding optimization, fish metric estimation, environmental monitoring, and health monitoring."}]}]}]}]}]}, {"#name": "abstract", "$": {"id": "abs0002", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0002"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0002", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara040", "view": "all"}, "_": "This paper focuses on designing a Digital Twin infrastructure that supports an agile-based Artificial Intelligence Internet of Things (AIoT) system for intelligent fish farming in aquaculture. Our infrastructure includes the Internet of Things, cloud technology, and Artificial Intelligence (AI) as its building blocks. Our physical entity is equipped with smart devices such as sensors and actuators embedded in smart machines (fish feeding and sorting machines) that collect and transmits big data to the cloud using wireless communication networks for real-time and remote monitoring. We have four major digital twin services: fish feeding to automate the feeding process, metric estimation (fish count, size, and weight), environmental monitoring (water condition, net hole, and green algae), and health monitoring (vitality, mortality, and diseases). Each digital twin service is equipped with multiple AI services (or the digital twin objects) capable of performing complex and other functions such as optimizations, predictions, and analyses for intelligent decision-making to optimize farm profits and production. We integrated a prototype that represents the virtual entity accessible using the web and mobile devices where users can perform fish farm monitoring using the various digital twin services and their related AI services."}]}]}]}}