{"pii": "S2772662223001297", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e400"}, "$$": [{"#name": "section-title", "$": {"id": "d1e401"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e403"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e404"}, "_": "Sentiment analysis is crucial in understanding and analyzing public opinions, feedback, and social media data. In this study, we propose a modified Bayesian Boosting algorithm with weight-guided optimal feature selection for sentiment analysis. The goal is to improve the accuracy and efficiency of sentiment classification by selecting the most informative features and utilizing an optimized boosting algorithm. The proposed algorithm leverages the strength of the Bayesian framework and boosting techniques to handle the challenges of sentiment analysis effectively. It incorporates a feature selection mechanism that assigns weights to individual features based on their importance in sentiment classification. This weight-guided feature selection approach helps identify the most relevant and discriminative features, enhancing classification performance. The algorithm employs a modified Bayesian boosting algorithm to optimize the boosting process. It dynamically adjusts the weights assigned to weak classifiers during the boosting iterations, emphasizing the misclassified instances and providing more focused learning for accurate sentiment prediction. The proposed algorithm is evaluated on a benchmark sentiment analysis dataset, comparing it with other state-of-the-art algorithms. The results demonstrate that the modified Bayesian Boosting algorithm with weight-guided optimal feature selection achieves superior accuracy, precision, recall, and F1 score. The algorithm shows its effectiveness in capturing the sentiment patterns and improving the overall sentiment classification performance. The results demonstrated that the proposed model had gained an accuracy level of 98.49%, even the Random Forest algorithm gained an accuracy level of 78.6%, and the C4.5 model achieved an accuracy level of 68.58% individually. The proposed modified Bayesian Boosting algorithm with weight-guided optimal feature selection presents a promising approach for sentiment analysis. It effectively addresses the challenges of feature selection and boosting, leading to improved sentiment classification accuracy. The algorithm’s ability to adjust weights and select informative features adaptively enhances its sentiment analysis tasks performance. This research opens up new avenues for advancing sentiment analysis techniques and contributes to developing more accurate and efficient sentiment analysis models."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e414"}, "$$": [{"#name": "section-title", "$": {"id": "d1e415"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e417"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e418"}, "$$": [{"#name": "list", "$": {"id": "d1e420"}, "$$": [{"#name": "list-item", "$": {"id": "d1e421"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e424"}, "_": "Handles big data sets commonly encountered in sentiment analysis tasks."}]}, {"#name": "list-item", "$": {"id": "d1e426"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e429"}, "_": "Can be used for sentiment analysis of different types of textual data."}]}, {"#name": "list-item", "$": {"id": "d1e431"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e434"}, "_": "Achieves enhanced accuracy, precision, and recall in sentiment classification tasks."}]}, {"#name": "list-item", "$": {"id": "d1e436"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e439"}, "_": "Improves the efficiency and effectiveness of the sentiment analysis process."}]}, {"#name": "list-item", "$": {"id": "d1e441"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e444"}, "_": "Improve sentiment analysis accuracy and handle large-scale data sets."}]}]}]}]}]}]}}