{"pii": "S2949944524000133", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0080", "view": "all"}, "_": "Recent advancements in flexible and stretchable electronics have underscored the critical importance of maintaining essential electrical properties under stretching conditions, especially in wearable technology. The integration of stretchable conductors into wearable devices, such as soft sensors and stretchable batteries, highlights efforts to enhance durability and performance. Despite extensive studies into the development of stretchable conductors, the impedance characteristics of stretchable electrodes have largely evaded in-depth examination within existing literature. This review paper aims to bridge this gap by offering a comprehensive overview of recent advancements in both material and structural designs tailored for impedance property of stretchable electrodes. It delves into the exploration of various conductive materials, including metals, liquid metals, conducting polymers, hydrogels, and textiles, each offering unique properties suited for specific applications. Moreover, it discusses the diverse fabrication methods employed, such as direct mixing, surface coating/deposition, printing, and specialized techniques for creating electrically conductive networks. Beyond material and fabrication strategies, the review also explores innovative structural concepts capable of accommodating large deformations, such as serpentine, coiled, Kirigami, and open-mesh structures. These designs not only enhance the mechanical resilience of stretchable electronics but also contribute to their electrical performance, particularly in low impedance electronic applications. Finally, the paper provides insights into the emerging applications of conductive nanocomposites with low impedance for wearable electronics, addressing key challenges and discussing future research directions."}]}]}]}}