{"pii": "S2949719124000372", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e1566"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1567"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e1569"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e1570"}, "_": "Digital platforms on the internet are invaluable for collecting user feedback, suggestions, and opinions about various topics, such as company products and services. This data is instrumental in shaping business strategies, enhancing product development, and refining service delivery. Suggestion mining is a key task in natural language processing, which focuses on extracting and analysing suggestions from these digital sources. Initially, suggestion mining utilized manually crafted features, but recent advancements have highlighted the efficacy of deep learning models, which automatically learn features. Models like Convolutional Neural Networks (CNN), Recurrent Neural Networks (RNN), Long Short-Term Memory (LSTM), and Bidirectional Encoder Representations from Transformers (BERT) have been employed in this field. However, considering the relatively small datasets and the faster training time of LSTM compared to BERT, we introduce TransLSTM, a novel LSTM-Transformer hybrid model for suggestion mining. This model aims to automatically pinpoint and extract suggestions by harnessing both local and global text dependencies. It combines the sequential dependency handling of LSTM with the contextual interaction capabilities of the Transformer, thus effectively identifying and extracting suggestions. We evaluated our method against state-of-the-art approaches using the SemEval Task-9 dataset, a benchmark for suggestion mining. Our model shows promising performance, surpassing existing deep learning methods by 6.76% with an F1 score of 0.834 for SubTask A and 0.881 for SubTask B. Additionally, our paper presents an exhaustive literature review on suggestion mining from digital platforms, covering both traditional and state-of-the-art text classification techniques."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e1572"}, "$$": [{"#name": "section-title", "$": {"id": "d1e1573"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e1575"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e1576"}, "$$": [{"#name": "list", "$": {"id": "d1e1578"}, "$$": [{"#name": "list-item", "$": {"id": "d1e1579"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1582"}, "_": "Comprehensive review and comparison of state-of-the-art suggestion mining methods."}]}, {"#name": "list-item", "$": {"id": "d1e1584"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1587"}, "_": "Proposed TransLSTM model integrates Bi-LSTM and Transformer for suggestion mining."}]}, {"#name": "list-item", "$": {"id": "d1e1589"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1592"}, "_": "Achieved F1 score of 0.834 (SubTask A) and 0.881 (SubTask B) on SemEval’19 Task 9."}]}, {"#name": "list-item", "$": {"id": "d1e1594"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e1597"}, "_": "Outperformed existing methods by 6.76% on SubTask A and by 2.68% on SubTask B."}]}]}]}]}]}]}}