{"pii": "S2949863524000190", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "ab0010", "class": "author", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sect0005"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abs0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "sp0120", "view": "all"}, "_": "Despite abundant research on the application of artificial intelligence (AI) in reverse logistics, no comprehensive study with bibliometric and network analysis has been conducted. This study uses bibliometric analysis to derive the prominent research statistics in AI-centric reverse logistics, considering 2929 articles from the last three decades. The most impactful contributors and countries that employ AI in reverse logistics are identified using various bibliometric tools. Also, network analysis is performed to reveal the most influential articles and emerging trends and map the relationships via clustering. The results of keyword co-occurrence and co-citation analyses reveal that machine learning and deep learning techniques have been commonly used for addressing reverse logistics challenges with higher frequency in recent years. Furthermore, a systematic review is carried out, considering the influential articles from recent years. The review is conducted following the systematic literature review framework, and 79 articles are chosen to be studied thoroughly. Subsequently, the articles are divided based on various reverse logistics processes, and the most frequently used AI techniques are identified and categorized into five distinct groups. The comprehensive investigation of AI techniques reveals the use-case scenario of AI algorithms in the reverse logistics domain. This study concludes with implications and recommendations for prospects by addressing the shortcomings of the current studies and providing future researchers and practitioners with a robust roadmap to investigate reverse logistics in their research further."}]}]}]}}