{"pii": "S2949719124000141", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e2341"}, "$$": [{"#name": "section-title", "$": {"id": "d1e2342"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e2344"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e2345"}, "_": "Automated fact-checking has drawn considerable attention over the past few decades due to the increase in the diffusion of misinformation on online platforms. This is often carried out as a sequence of tasks comprising (i) the detection of sentences circulating in online platforms which constitute claims needing verification, followed by (ii) the verification process of those claims. This survey focuses on the former, by discussing existing efforts towards detecting claims needing fact-checking, with a particular focus on multilingual data and methods. This is a challenging and fertile direction where existing methods are yet far from matching human performance due to the profoundly challenging nature of the issue. Especially, the dissemination of information across multiple social platforms, articulated in multiple languages and modalities demands more generalized solutions for combating misinformation. Focusing on multilingual misinformation, we present a comprehensive survey of existing multilingual claim detection research. We present state-of-the-art multilingual claim detection research categorized into three key factors of the problem, verifiability, priority, and similarity. Further, we present a detailed overview of the existing multilingual datasets along with the challenges and suggest possible future advancements."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e2347"}, "$$": [{"#name": "section-title", "$": {"id": "d1e2348"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e2350"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e2351"}, "$$": [{"#name": "list", "$": {"id": "d1e2353"}, "$$": [{"#name": "list-item", "$": {"id": "d1e2354"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e2357"}, "_": "Comprehensive review of multilingual claim detection."}]}, {"#name": "list-item", "$": {"id": "d1e2359"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e2362"}, "_": "Discuss claim detection task categorized into verifiability, priority, and similarity identification."}]}, {"#name": "list-item", "$": {"id": "d1e2364"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e2367"}, "_": "Overview of state-of-the-art approaches for multilingual claim detection."}]}, {"#name": "list-item", "$": {"id": "d1e2369"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e2372"}, "_": "Existing multilingual datasets for a wide range of claim detection tasks."}]}, {"#name": "list-item", "$": {"id": "d1e2374"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e2377"}, "_": "Open challenges and future directions of multilingual claim detection."}]}]}]}]}]}]}}