{"pii": "S2949719123000468", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e733"}, "$$": [{"#name": "section-title", "$": {"id": "d1e734"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e736"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e737"}, "_": "The identification of abstracts plays a vital role in efficiently locating the content and providing clarity to the article. Existing algorithms for move recognition exhibit a deficiency in their capacity to acquire word adjacent position information when word changes in Chinese expressions to obtain contextual semantics changes. This paper introduces EPAG: a novel enhanced move recognition algorithm with the improved pre-trained framework and downstream model for unstructured abstracts of Chinese scientific and technological papers. The proposed algorithm first performs data segmentation and vocabulary training. The EPAG framework is leveraged to incorporate word positional information, facilitating deep semantic learning and targeted feature extraction. Experimental results demonstrate that the proposed algorithm achieves 13.37% higher accuracy on the split dataset than on the original dataset and a 7.55% improvement in accuracy over the basic comparison model."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e739"}, "$$": [{"#name": "section-title", "$": {"id": "d1e740"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e742"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e743"}, "$$": [{"#name": "list", "$": {"id": "d1e745"}, "$$": [{"#name": "list-item", "$": {"id": "d1e746"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e749"}, "_": "This paper presents an enhanced EPAG framework for focused feature extraction, which enables deep semantic learning and improves the recognition performance of the model."}]}, {"#name": "list-item", "$": {"id": "d1e751"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e754"}, "_": "The enhanced EPAG framework integrates a large-scale text corpus, knowledge graph, and domain-specific corpus for contextual learning. Position information is embedded in the pre-trained framework for semantic comprehension. A continuous learning mechanism strengthens context representation by considering long-range dependencies."}]}, {"#name": "list-item", "$": {"id": "d1e756"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e759"}, "_": "Combining the handling of long and complex sentences with domain-specific knowledge training enhances the model’s comprehension of nested sentence structures and domain-specific semantics."}]}, {"#name": "list-item", "$": {"id": "d1e761"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e764"}, "_": "The effectiveness of the proposed model is validated through experimental comparison with multiple baseline models."}]}]}]}]}]}]}}