{"pii": "S2949719123000146", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author", "view": "all", "id": "d1e535"}, "$$": [{"#name": "section-title", "$": {"id": "d1e536"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e538"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e539"}, "_": "Natural language processing (NLP) is crucial in the current processing of data because it takes into account many sources, formats, and purposes of data as well as information from various sectors of our economy, government, and private and public lives. We perform a variety of NLP operations on the text in order to complete certain tasks. One of them is NER (Named Entity Recognition). An act of recognizing and categorizing named entities that are presented in a text document is known as named entity recognition. The purpose of NER is to find references of rigid designators in the text which belong to established semantic kinds like a person, place, organization, etc. It acts as a cornerstone for many Information Extraction-related activities. In this work, we present a thorough analysis of several methodologies for NER ranging from unsupervised learning, rule-based, supervised learning, and various Deep Learning based approaches. We examine the most relevant datasets, tools, and deep learning approaches like Convolutional Neural Networks (CNNs), Recurrent Neural Networks (RNNs), Bidirectional Long Short Term Memory, Transfer learning approaches, and numerous other approaches currently being used in present-day NER problem environments and their applications. Finally, we outline the difficulties NER systems encounter and future directions."}]}]}, {"#name": "abstract", "$": {"class": "author-highlights", "view": "all", "id": "d1e545"}, "$$": [{"#name": "section-title", "$": {"id": "d1e546"}, "_": "Highlights"}, {"#name": "abstract-sec", "$": {"view": "all", "id": "d1e548"}, "$$": [{"#name": "simple-para", "$": {"view": "all", "id": "d1e549"}, "$$": [{"#name": "list", "$": {"id": "d1e551"}, "$$": [{"#name": "list-item", "$": {"id": "d1e552"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e555"}, "_": "Rule based approaches are not highly generalized because these rules are restricted to a specific domain only."}]}, {"#name": "list-item", "$": {"id": "d1e557"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e560"}, "_": "Advantages of Deep Learning include feature engineering, less complexity while implementing, less human intervention and faster execution."}]}, {"#name": "list-item", "$": {"id": "d1e562"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e565"}, "_": "Bi-LSTMs are frequently employed in NLP applications to extract contextual characteristics from the input text in both the backward and forward directions."}]}, {"#name": "list-item", "$": {"id": "d1e567"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"view": "all", "id": "d1e570"}, "_": "Originally used in image processing, CNNs are also applied to NER tasks."}]}]}]}]}]}]}}