{"pii": "S2950328024000463", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"class": "author-highlights", "lang": "en", "id": "abs0010", "view": "all"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0010"}, "_": "Key Points:"}, {"#name": "abstract-sec", "$": {"id": "abssec0010", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0010", "view": "all"}, "$$": [{"#name": "list", "$": {"id": "ulist0010"}, "$$": [{"#name": "list-item", "$": {"id": "u0010"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0010", "view": "all"}, "_": "MARCH5 plays an essential role in Multiple Myeloma, and its expression significantly correlates with disease progression, OS, and PFS"}]}, {"#name": "list-item", "$": {"id": "u0015"}, "$$": [{"#name": "label", "_": "•"}, {"#name": "para", "$": {"id": "p0015", "view": "all"}, "_": "MARCH5-Knockdown compromises MM cell viability due to its regulation of autophagy through AKT-mediated degradation of FOXO3"}]}]}]}]}]}, {"#name": "abstract", "$": {"lang": "en", "id": "abs0015", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "sectitle0015"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abssec0015", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "abspara0015", "view": "all"}, "_": "Multiple myeloma (MM) stands as a formidable blood malignancy, necessitating innovative therapeutic approaches. Excessive immunoglobulin (Ig) production within myeloma cells leads to a buildup of toxic proteins, and autophagy plays a crucial role in their survival by degrading toxic aggregates and generating energy. Membrane-associated RING finger protein 5 (MARCH5) is an E3-ligase positioned at the outer mitochondrial membrane and has been shown to regulate autophagy by competing for MIR30A. Given the fundamental significance of autophagy in promoting the survival of myeloma cells, coupled with the regulatory role of MARCH5 in autophagic activity, we hypothesize that MARCH5 plays an essential function in multiple myeloma and holds a pivotal position in the pathogenesis and progression of MM. We found MARCH5's unique dependencies in MM cells by analysing the Cancer Dependency Map, establishing its significance in MM biology. Examining various datasets, including CoMMpass and HOVON, demonstrated a correlation between MARCH5 expression and patient outcomes. Knockdown of MARCH5 revealed a substantial reduction in MM cell viability, associated with a decreased autophagic activity. Mechanistically, we unravelled a novel MARCH5/AKT/FOXO3 axis, wherein MARCH5 regulates autophagy through the AKT-mediated degradation of FOXO3. Compromised MM cell viability observed with MARCH5 knockdown was recapitulated in FOXO3 knockdown experiments, validating the pivotal role of FOXO3 in mediating MARCH5's effects. In conclusion, this research highlights the crucial role of MARCH5 in MM, and the identified MARCH5/AKT/FOXO3 axis enhances our understanding of MM biology and provides a foundation for developing targeted therapies."}]}]}]}}