{"pii": "S2950550X24000207", "abstracts": {"#name": "abstracts", "$": {"xmlns:ce": true, "xmlns:dm": true, "xmlns:sb": true}, "$$": [{"#name": "abstract", "$": {"id": "abs0001", "view": "all", "class": "author"}, "$$": [{"#name": "section-title", "$": {"id": "cesectitle0001"}, "_": "Abstract"}, {"#name": "abstract-sec", "$": {"id": "abss0001", "view": "all"}, "$$": [{"#name": "simple-para", "$": {"id": "spara011", "view": "all"}, "_": "In the context of Industry 4.0, the precise location information of resources is fundamental for orchestrating myriad operations and processes. In outdoor environments, the Global Navigation Satellite System (GNSS) provides universal positioning, navigation, and timing services to users worldwide. Nevertheless, GNSS signals are severely obstructed and interfered with indoors, rendering the system ineffective in such environments. Notably, most Industry 4.0 settings, such as shopfloors, warehouses, and production sites, are in indoor or semi-indoor environments, where structures and means of production elements can obstruct or interfere with GNSS signals. Therefore, GNSS cannot fully meet the precise positioning requirements of Industry 4.0. Indoor Positioning Systems (IPS) can effectively compensate for the limitations of GNSS to enable the identification and tracking of precise object position within indoor or semi-indoor environments. Over the past decade, substantial research on IPS has been conducted within the academic and industrial sectors, with findings disseminated across numerous academic journals. However, there remains a notable absence of comprehensive reviews on IPS from an Industry 4.0 perspective to date, as well as any distillation of the functionality of IPS in industrial scenarios. This paper offers an exhaustive review of state-of-the-art IPS research and categorizes IPS applications as resource management, production management, and safety management to bridge this gap. The goal is to assist researchers and industry stakeholders in recognizing current research gaps, grasping the content of IPS theory, appreciating its industrial applications, and charting paths for future scholarly inquiry. This work potentially provides an innovative spatial-temporal framework for the technology-centric focus of Industry 4.0 or even insights into the value-driven perspective of Industry 5.0."}]}]}]}}